script_name('FBI Tools')
script_version('2.5.1')
script_author('Sesh Jefferson and Thomas Lawson') -- код биндера от DonHomka
require 'lib.moonloader'
require 'lib.sampfuncs'
local sf = require 'sampfuncs'
local key = require "vkeys"
local inicfg = require 'inicfg'
local sampev = require 'lib.samp.events'
local imgui = require 'imgui' -- загружаем библиотеку
local encoding = require 'encoding' -- загружаем библиотеку
local rkeys = require 'rkeys'
local Sphere = require 'Sphere'
local hk = require 'lib.imcustom.hotkey'
local wm = require 'lib.windows.message'
local gk = require 'game.keys'
local first_window = imgui.ImBool(false)
local second_window = imgui.ImBool(false)
local third_window = imgui.ImBool(false)
local command_window = imgui.ImBool(false)
local ykwindow = imgui.ImBool(false)
local fpwindow = imgui.ImBool(false)
local akwindow = imgui.ImBool(false)
local shpwindow = imgui.ImBool(false)
local ftthelp = imgui.ImBool(false)
local changetextpos = false
local dlstatus = require('moonloader').download_status
encoding.default = 'CP1251' -- указываем кодировку по умолчанию, она должна совпадать с кодировкой файла. CP1251 - это Windows-1251
u8 = encoding.UTF8
hk._SETTINGS.noKeysMessage = u8("Нет")
seshsps = 1
mcheckb = false
tazer = false
nikk = nil
tdmg = nil
rank = 'Нету'
frac = 'Нету'
rabden = false
post = nil
zaproop = false
aroop = false
dmoop = false

function Sphere.onEnterSphere(id)
  post = id
end

function Sphere.onExitSphere(id)
    post = nil
end

function imgui.TextColoredRGB(text)
  local style = imgui.GetStyle()
  local colors = style.Colors
  local ImVec4 = imgui.ImVec4

  local explode_argb = function(argb)
      local a = bit.band(bit.rshift(argb, 24), 0xFF)
      local r = bit.band(bit.rshift(argb, 16), 0xFF)
      local g = bit.band(bit.rshift(argb, 8), 0xFF)
      local b = bit.band(argb, 0xFF)
      return a, r, g, b
  end

  local getcolor = function(color)
      if color:sub(1, 6):upper() == 'SSSSSS' then
          local r, g, b = colors[1].x, colors[1].y, colors[1].z
          local a = tonumber(color:sub(7, 8), 16) or colors[1].w * 255
          return ImVec4(r, g, b, a / 255)
      end
      local color = type(color) == 'string' and tonumber(color, 16) or color
      if type(color) ~= 'number' then return end
      local r, g, b, a = explode_argb(color)
      return imgui.ImColor(r, g, b, a):GetVec4()
  end

  local render_text = function(text_)
      for w in text_:gmatch('[^\r\n]+') do
          local text, colors_, m = {}, {}, 1
          w = w:gsub('{(......)}', '{%1FF}')
          while w:find('{........}') do
              local n, k = w:find('{........}')
              local color = getcolor(w:sub(n + 1, k - 1))
              if color then
                  text[#text], text[#text + 1] = w:sub(m, n - 1), w:sub(k + 1, #w)
                  colors_[#colors_ + 1] = color
                  m = n
              end
              w = w:sub(1, n - 1) .. w:sub(k + 1, #w)
          end
          if text[0] then
              for i = 0, #text do
                  imgui.TextColored(colors_[i] or colors[1], u8(text[i]))
                  imgui.SameLine(nil, 0)
              end
              imgui.NewLine()
          else imgui.Text(u8(w)) end
      end
  end

  render_text(text)
end

local fthelpsub =
{
  {
    title = '{9966CC}/ft {ffffff}- Открыть меню скрипта',
    onclick = function()
      sampSetChatInputEnabled(true)
      sampSetChatInputText('/ft')
    end
  },
  {
    title = '{9966cc}/st [id]{ffffff} - Попросить игрока заглушить свое Т/С через мегафон [/m]',
    onclick = function()
      sampSetChatInputEnabled(true)
      sampSetChatInputText('/st ')
    end
  },
  {
    title = '{9966cc}/oop [id]{ffffff} - Написать в волну департамента об ООП',
    onclick = function()
      sampSetChatInputEnabled(true)
      sampSetChatInputText('/oop ')
    end
  },
  {
    title = '{9966cc}/warn [id] [departament]{ffffff} - Предупредить игрока в волну департамента о нарушении подачи в розыск',
    onclick = function()
      sampSetChatInputEnabled(true)
      sampSetChatInputText('/warn ')
    end
  },
  {
    title = '{9966cc}/su [id]{ffffff} - Выдать розыск через диалог',
    onclick = function()
      sampSetChatInputEnabled(true)
      sampSetChatInputText('/su ')
    end
  },
  {
    title = '{9966cc}/ssu [id]{ffffff} - Выдать розыск через серверную команду',
    onclick = function()
      sampSetChatInputEnabled(true)
      sampSetChatInputText('/ssu ')
    end
  },
  {
    title = '{9966cc}/cput [id] [seat]{ffffff} - РП отыгровка посадки преступника в автомобиль/мото',
    onclick = function()
      sampSetChatInputEnabled(true)
      sampSetChatInputText('/cput ')
    end
  },
  {
    title = '{9966cc}/ceject [id]{ffffff} - РП отыгровка высадки преступника из автомобиля/мото',
    onclick = function()
      sampSetChatInputEnabled(true)
      sampSetChatInputText('/ceject ')
    end
  },
  {
    title = '{9966cc}/deject [id]{ffffff} - РП отыгровка вытаскивания преступника из автомобиля/мото',
    onclick = function()
      sampSetChatInputEnabled(true)
      sampSetChatInputText('/deject ')
    end
  },
  {
    title = '{9966cc}/tl [id] [type]{ffffff} - РП отыгровка изъятия лицензии',
    onclick = function()
      sampSetChatInputEnabled(true)
      sampSetChatInputText('/tl ')
    end
  },
  {
    title = '{9966cc}/ms [type]{ffffff} - РП отыгровка взятия маскировки',
    onclick = function()
      sampSetChatInputEnabled(true)
      sampSetChatInputText('/ms ')
    end
  },
  {
    title = '{9966cc}/keys{ffffff} - РП отыгровка сравнения ключей от КПЗ',
    onclick = function()
      sampSetChatInputEnabled(true)
      sampSetChatInputText('/keys')
    end
  },
  {
    title = '{9966cc}/pr{ffffff} - Зачитать права игроку',
    onclick = function()
      sampSetChatInputEnabled(true)
      sampSetChatInputText('/pr')
    end
  },
  {
    title = '{9966cc}/rh [departament]{ffffff} - Запросить патрульный экипаж в текущий квадрат',
    onclick = function()
      sampSetChatInputEnabled(true)
      sampSetChatInputText('/rh ')
    end
  },
  {
    title = '{9966cc}/tazer{ffffff} - РП тайзер',
    onclick = function()
      sampSetChatInputEnabled(true)
      sampSetChatInputText('/tazer')
    end
  },
  {
    title = '{9966cc}/gr [departament] [reason]{ffffff} - Написать в волну департамента о пересечении юрисдикции',
    onclick = function()
      sampSetChatInputEnabled(true)
      sampSetChatInputText('/gr ')
    end
  },
  {
    title = '{9966cc}/df{ffffff} - Открыть диалог с разминированием бомб',
    onclick = function()
      sampSetChatInputEnabled(true)
      sampSetChatInputText('/df')
    end
  },
  {
    title = '{ffffff}Продолжение',
    submenu =
    {
      {
        title = '{9966cc}/ar [army]{ffffff} - Попросить разрешение на въезд на военную территорию в волну департамента',
        onclick = function()
          sampSetChatInputEnabled(true)
          sampSetChatInputText('/ar ')
        end
      },
      {
        title = '{9966cc}/kmdc [id]{ffffff} - РП отыгровка фотографии человека через КПК',
        onclick = function()
          sampSetChatInputEnabled(true)
          sampSetChatInputText('/kmdc ')
        end
      },
      {
        title = '{9966cc}/ftazer [type]{ffffff} - РП отыгровка ftazer',
        onclick = function()
          sampSetChatInputEnabled(true)
          sampSetChatInputText('/ftazer ')
        end
      },
      {
        title = '{9966cc}/ftreload{ffffff} - Перезагрузить скрипт',
        onclick = function()
          sampSetChatInputEnabled(true)
          sampSetChatInputText('/ftazer')
        end
      },
      {
        title = '{9966cc}/nwanted{ffffff} - Новый вид сообщений подачи в розыск, очистки розыска, начала патруля',
        onclick = function()
          sampSetChatInputEnabled(true)
          sampSetChatInputText('/nwanted')
        end
      },
      {
        title = '{9966cc}/nclear{ffffff} - Дополнительные уведомления при очистке розыска',
        onclick = function()
          sampSetChatInputEnabled(true)
          sampSetChatInputText('/nclear')
        end
      },
      {
        title = '{9966cc}/hrt{ffffff} - Запросить перекличку HRT по волне департамента',
        onclick = function()
          sampSetChatInputEnabled(true)
          sampSetChatInputText('/hrt')
        end
      },
      {
        title = '{9966cc}/fvz [id] [organization]{ffffff} - Вызвать игрока в офис ФБР со старшими',
        onclick = function()
          sampSetChatInputEnabled(true)
          sampSetChatInputText('/fvz ')
        end
      },
      {
        title = '{9966cc}/gpc{ffffff} - Узнать координаты курсора (для инфо-бара)',
        onclick = function()
          sampSetChatInputEnabled(true)
          sampSetChatInputText('/gpc')
        end
      },
      {
        title = '{9966cc}/fbd [id] [organizaton]{ffffff} - Запросить причину изменения БД по волне департамента',
        onclick = function()
          sampSetChatInputEnabled(true)
          sampSetChatInputText('/fbd ')
        end
      },
      {
        title = '{9966cc}/fstate{ffffff} - Изменить отыгровки на мужские/женские',
        onclick = function()
          sampSetChatInputEnabled(true)
          sampSetChatInputText('/fstate')
        end
      },
      {
        title = '{9966cc}/fhud{ffffff} - Включить/выключить инфо-бар',
        onclick = function()
          sampSetChatInputEnabled(true)
          sampSetChatInputText('/fhud')
        end
      },
      {
        title = '{9966cc}/ticket [id] [Сумма] [Причина]{ffffff} - РП отыгровка штрафа',
        onclick = function()
          sampSetChatInputEnabled(true)
          sampSetChatInputText('/ticket ')
        end
      },
      {
        title = '{9966cc}/blg [id] [Фракция] [Причина]{ffffff} - Выразить благодарность по волне департамента',
        onclick = function()
          sampSetChatInputEnabled(true)
          sampSetChatInputText('/blg ')
        end
      },
      {
        title = '{9966cc}/r и /f{ffffff} - Автотег в рацию'
      },
      {
        title = '{9966cc}/yk{ffffff} - Открыть шпору УК',
        onclick = function()
          sampSetChatInputEnabled(true)
          sampSetChatInputText('/yk')
        end
      },
      {
        title = '{9966cc}/fp{ffffff} - Открыть шпору ФП',
        onclick = function()
          sampSetChatInputEnabled(true)
          sampSetChatInputText('/fp')
        end
      },
      {
        title = '{ffffff}Продолжение',
        submenu =
        {
          {
            title = '{9966cc}/ak{ffffff} - Открыть шпору АК',
            onclick = function()
              sampSetChatInputEnabled(true)
              sampSetChatInputText('/ak')
            end
          },
          {
            title = '{9966cc}/shp{ffffff} - Открыть настраиваемую шпору',
            onclick = function()
            sampSetChatInputEnabled(true)
            sampSetChatInputText('/shp')
            end
          },
          {
            title = '{9966cc}/fyk{ffffff} - Поиск по УК шпоре',
            onclick = function()
              sampSetChatInputEnabled(true)
              sampSetChatInputText('/fyk')
            end
          },
          {
            title = '{9966cc}/ffp{ffffff} - Поиск по ФП шпоре',
            onclick = function()
              sampSetChatInputEnabled(true)
              sampSetChatInputText('/ffp')
            end
          },
          {
            title = '{9966cc}/fak{ffffff} - Поиск по АК шпоре',
            onclick = function()
              sampSetChatInputEnabled(true)
              sampSetChatInputText('/fak')
            end
          },
          {
            title = '{9966cc}/fshp{ffffff} - Поиск по настраиваемой шпоре',
            onclick = function()
              sampSetChatInputEnabled(true)
              sampSetChatInputText('/fshp')
            end
          },
          {
            title = '{9966cc}/fst{ffffff} - Изменить время',
            onclick = function()
              sampSetChatInputEnabled(true)
              sampSetChatInputText('/fst')
            end
          },
          {
            title = '{9966cc}/fsw{ffffff} - Изменить погоду',
            onclick = function()
              sampSetChatInputEnabled(true)
              sampSetChatInputText('/fsw')
            end
          },
          {
            title = '{9966cc}/cc{ffffff} - Очистить чат',
            onclick = function()
              sampSetChatInputEnabled(true)
              sampSetChatInputText('/cc')
            end
          },
          {
            title = '{9966cc}/dkld{ffffff} - Сделать доклад',
            onclick = function()
              sampSetChatInputEnabled(true)
              sampSetChatInputText('/dkld')
            end
          },
          {
            title = '{9966cc}/mcheck{ffffff} - Пробить по /mdc всех на расстоянии 200 метров',
            onclick = function()
              sampSetChatInputEnabled(true)
              sampSetChatInputText('/mcheck')
            end
          }
        }
      }
    }
  }
}

local shpt = [[
Пока что вы не настроили шпору.
Что бы вставить сюда свой текст вам нужно выполнить ряд дейтсвий:
1. Открыть папку fbitools которая находится в папке moonloader
2. Открыть файл shp.txt любым блокнотом
3. Изменить текст в нем на какой вам нужен
4. Сохранить файл
]]

local akt = [[
1-я часть – для водителей:

0.0 Езда без включенных фар.
0.1 За езду без фар дальнего света [/clist 33], нарушителю следует наказание в виде предупреждения и лекции от полиции.
[ По статье не следует задерживать, но если нарушитель проигнорировал/не подчинился требованиям сделанным в доступной для него форме включить фары [Любой /clist, кроме 0],
офицер может произвести задержание по статье "Неподчинение".
Сотрудники гос. структур имеют право выключать фары при необходимости. ]
1.1 Езда по встречной полосе.
1.2 Езда по встречной: штраф в размере [LVL x 500$], в случае же неуплаты штрафа – изъятие водительских прав и задержание по статье за неуплату штрафов.
[ Объезд по встречной полосе не считается нарушением, если он стал следствием из-за действий и нарушения ПДД другим водителем ]
2.0 Превышение скорости.
2.1 Превышение скорости: штраф в размере [LVL x 500$].
3.0 Наезд на пешехода.
3.1 Наезд на пешехода: 2 уровень розыска + изъятие водительских прав.
4.0 Парковка в неположенном месте.
4.1 Парковка в неположенном месте наземным транспортным средством: изъятие водительских прав.
4.2 Парковка в неположенном месте воздушным транспортным средством: изъятие лицензии пилота.  
5.0 ДТП, уход с места ДТП.
5.1 Виновник ДТП: штраф в размере [LVL x 500$], выплата материального ущерба.
5.2 Покидание места ДТП: 3 уровень розыска, штраф в размере [LVL x 500$] + изъятие прав.
6.0 Управление транспортным средством в нетрезвом состоянии.
6.1 Управление ТС в наркотическом или алкогольном опьянении: 1 уровень розыска + изъятие прав.
7.0 Создание аварийной ситуации.
7.1 Создание аварийной ситуации [АФК на дороге будучи водителем авто, намеренная помеха движению, подрезания]: Изъятие прав и штраф [LVL x 500$].
[ Запрещается изымать водительские права, пока человек находится в АФК ]
8.0 Движение в неположенном месте.
8.1 Движение по тротуарам, обочинам и ж/д путям: штраф в размере [LVL x 500$], в случае же неуплаты штрафа – изъятие водительских прав и задержание по статье за неуплату штрафов.

2-я часть – для пешеходов:

10.1 Создание аварийной ситуации [АФК на дороге, ходьба по проезжей части, перегораживание движения и намеренные прыжки под машину]:
[ Для людей проживающих в штате от 1 до 2-х лет : давать предупреждение, при повторном нарушении выписывать штраф.
Для людей проживающих в штате от 3-ех лет: выписывать штраф.
Штраф [LVL x 250]. ]


]]

local fpt = [[
ПРЕАМБУЛА
Вступительная часть.

0.1 Федеральное Постановление - это нормативно-правовой акт, который был призван внести чёткие рамки в работу государственных организаций.
0.2 Федеральное Постановление издаётся Федеральным Бюро Расследований (далее ФБР) для Полицейских Департаментов (далее ПД) и военных частей (Далее Армия).
0.3 Федеральное Постановление может быть изменено Директором ФБР ( при участии следящего Администратора )
в любое время дня и ночи, его вступление в силу происходит через 48 часов после публикации.
0.4 Федеральное Постановление обязано выполняться всеми сотрудниками вышеупомянутых организаций.
0.5 Незнание Федерального Постановления не освобождает обвиняемого от ответственности.

Изображение

ГЛАВА НОМЕР ОДИН
Преступления против общественности.

1.1 Запрещается несанкционированное применение огнестрельного оружия против любого гражданского лица/сотрудника государственных организаций - увольнение.
1.2 Запрещается любое унижение чести и достоинства граждан вне зависимо от его социального или правового статуса - увольнение.
1.3 Запрещается применение насилия в отношении как граждан так и заключенных под стражу лиц - понижение.

Изображение

ГЛАВА НОМЕР ДВА
Постановление в отношении сотрудников Федерального Бюро Расследований и Мэрии.

2.1 Запрещается проникать на территорию FBI без получения официального пропуска от любого из агентов ФБР выше Мл.Агента - предупреждение / понижение.
Примечание: Мэру, Генералам армий, Шерифам разрешение не требуется.
2.2 Запрещается выдавать себя за любого государственного сотрудника - увольнение.
Исключение: Агенты ФБР во время ведения следственных действий под прикрытием.
2.3 Запрещается брать руководство операциями (теракты / похищения) без приказа ФБР - увольнение.
2.4 Запрещается неподчинение агенту ФБР в рамках его законных требований - понижение-увольнение.
Исключение: Агенты ФБР во время ведения следственных действий под прикрытием.
2.5 Запрещается оскорблять/угрожать/шантажировать агента ФБР - увольнение.
2.6 Запрещается оспаривать понижение/увольнение, выданное агентом ФБР/Мэром где-либо, кроме как в специальном разделе жалоб - понижение / увольнение.
2.7 Запрещается раскрывать личность агента ФБР, если тот находится под прикрытием - увольнение.
2.8 Запрещается вносить помехи в работу аттестационной комиссии от высших органов власти, проводящих любого рода проверки в государственных структурах - понижение.
2.9 Запрещается избегать проверки от ФБР - понижение.
Примечание: Агент имеет право вас вызвать в бюро и провести проверку. При отказе последует соответствующее наказание согласно пункту 2.9.

Изображение

ГЛАВА НОМЕР ТРИ
Постановление в отношении Полицейских Департаментов и Армий.

3.1 Запрещаются любые проявления неадекватного поведения и провокации - предупреждение / понижение / увольнение.
3.2 Запрещается нарушать правила строя - предупреждение / понижение.
3.3 Запрещается продажа любого государственного имущества (Ключи от камер/форма/фуры с боеприпасами) - увольнение + ЧС фракции.
3.4 Запрещается давать заведомо ложную информацию государственному сотруднику - увольнение.
3.5 Запрещается необоснованно требовать документы, а так же проводить обыск гражданских лиц - понижение.
3.6 Запрещается лишать права на адвоката (За исключением статьей "Уголовного Кодекса",предусматривающих лишение и наличия у вас доказательств) - понижение.
3.7 Запрещается государственным сотрудникам входить в сговоры с мафией/бандами - увольнение.
Исключение: Спец. операции (обязательный контроль старшего офицера).
3.8 Запрещается без разрешения/пропуска (самовольно) покидать часть/свой город - увольнение.
3.9 Запрещается носить форму не соответствующую занимаемой должности/званию - понижение.
Примечание: Соответствие формы и званий устанавливается руководителем организации.
3.10 Запрещается в рабочее время носить на себе вызывающие аксессуары - предупреждение / понижение.
3.11 Запрещается умышленно удалять с базы данных розыска - понижение / увольнение
Дополнение: Если вы ошиблись и можете доказать свою невиновность, вы должны сообщить об этом в департамент.


Изображение

ГЛАВА НОМЕР ЧЕТЫРЕ
Преступления государственных сотрудников против норм Устава, и других правовых документов.

4.1 Запрещается снимать преступникам розыск без уведомления ФБР - понижение.
Исключение: Если розыск был выдан по ошибке и вы можете это доказать.
4.2 Запрещается выдавать розыск без весомой на то причины, по просьбе. Иными словами - не видя факта нарушения лично - понижение / увольнение.
4.3 Запрещается провоцировать кого-либо, не важно, какого рода провокации - понижение.
4.4 Запрещается использовать нецензурную брань, а также оскорбления - понижение / увольнение.
4.5 Запрещается в рабочее время заниматься своими делами ( игра в казино, участие в гонках, дерби, пейнтболе в рабочее время с 9:00 до 22:00
за исключением перерыв с 13:00 до 14:00 , и случаев, когда вышеупомянутые мероприятия были организованы Администрацией сервера) - предупреждение / понижение / увольнение.
Исключение: Разрешение со стороны руководства организации, выполнение служебных обязанностей (например, охрана авторынка) или тренировок под присмотром старшего офицерского состава.
4.6 Запрещается хранение и употребление наркотических веществ, а также хранение краденых материалов - увольнение.
Исключение: Сотрудники PD, сотрудники ФБР в целях спец. операций (с обязательным контролем старшего офицера).
4.7 Запрещается находиться в опасном районе вне спец. операций - увольнение.
Исключение: Спец. операция, Федеральный патруль,специальные отделы (обязательный контроль со стороны руководства организации).
4.8 Запрещается объявлять в розыск не по уголовному кодексу - предупреждение / понижение.
4.9 Запрещается неподчинение старшему по званию в рамках закона - понижение.
Исключение: Старшие по званию - в рамках одной организации.
4.10 Запрещается употреблять алкоголь в рабочее время - понижение.
4.11 Запрещается брать/давать взятки - увольнение.
4.12 Запрещается нарушать правила волны департамента - предупреждение / понижение.
4.13 Запрещается беспричинно обыскивать государственных сотрудников - понижение.
4.14 Запрещается лишать лицензии без весомых на то причин - компенсация стоимости лицензий за счёт отобравшего офицера + понижение.
Примечание: Если Вы увидели, что государственный сотрудник нарушил правила дорожного движения или в гражданской форме УК
(где предусматривается изъятие лицензии), и у Вас есть доказательства, Вы имеете полное право забрать лицензию.
4.15 Запрещается нарушать субординацию при общении со старшими по званию - предупреждение / понижение.
4.16 Запрещается убийство в наручниках или эффектом электрошокера - понижение / увольнение.
Примечание: Разрешено использовать электрошокер в перестрелке, если она началась в Зелёной Зоне и у вас есть доказательства.
4.17 Запрещается нарушать законы штата, не важно в форме вы или нет - предупреждение / понижение / увольнение.
Исключение: Если у Вас есть доказательства, подтверждающие вашу полную либо частичную невиновность по фактам: самообороны себя и близких;
защиты личного имущества; при выполнении служебного долга, но находясь не при исполнении служебных обязанностей ( не в форме ); приказ старшего по званию в рамках закона.
4.18 Запрещается неподчинение руководящему составу ФБР - увольнение.
4.19 Запрещается неподчинение Мэру в рамках закона Штата Evolve - увольнение.
4.20 Запрещается отдавать приказы Мэру - увольнение.
4.21 Запрещается отдавать приказы сотрудникам ФБР - увольнение.

Изображение

ГЛАВА НОМЕР ПЯТЬ
Дополнительное положение.
5.1 Сотрудник ФБР имеет право сменить наказание на дисциплинарное взыскание в виде предупреждения.
5.2 Cотрудник Армии или ПД обязан сделать выводы о своей вине и постараться более не нарушать ФП.
5.3 Смена наказания осуществляется агентом ФБР, исходя из его здравого смысла и опыта.
Выдача предупреждений за пункты, которые так или иначе способны пошатнуть государственную безопасность - запрещены.
5.4 Сотрудник имеет право получить только одно предупреждение, при последующих нарушениях следуют более тяжкие наказания.
5.5 Пункты, предусматривающие выбор вида наказания, подразумевают применение одного из них по усмотрению выдающего наказание,
в зависимости от тяжести нарушения и наличия активных предупреждений, либо нарушений в прошлом.
]]

local ykt = [[
Уголовный кодекс Штата Evolve

Раздел I

1. Избиение, нанесение телесных повреждений.
1.1 За избиение или нанесение телесных повреждений, преступнику присваивается 2 уровень розыска.
[ Удары ножом, битой, лопатой, кулаком и ногой. ]

2. Вооружённое нападение, использование огнестрельного оружия.
2.1 За вооружённое нападение на гражданских, преступнику присваивается 3 уровень розыска + изъятие лицензии на оружие.
2.2 За вооружённое нападение на гос.сотрудников, преступнику присваивается 6 уровень розыска + изъятие лицензии на оружие + запрет на выход под залог [ООП].
[ Розыск выдаётся за использование огнестрельного оружия с целью нанесения физического вреда или повреждения/уничтожения имущества. ]
В рамках самообороны разрешено использовать оружие, но только при условии наличия соответствующей лицензии. Если лицензии нет,
обороняющийся всё равно задерживается по статье за "Ношение оружия без лицензии". ]

3. Убийство.
3.1 За убийство или заказ убийства, преступнику присваивается 3 уровень розыска.
3.2 За убийство военнослужащего при исполнении, преступнику присваивается 4 уровень розыска.
3.3 За убийство полицейского при исполнении, преступнику присваивается 5 уровень розыска.
3.4 За убийство агента ФБР при исполнении, преступнику присваивается 6 уровень розыска.

4. Хулиганство, попрошайничество.
4.1 За хулиганство и неадекватное поведение в общественных местах, преступнику присваивается 1 уровень розыска.
[ К хулиганству приравнивается любое нарушение общественного порядка: Стояние на крыше автомобиля, нахождение на крыше остановки, ложный вызов на экстренную линию,
флуд в любой чат одним и тем же сообщением.
Если человек толкает пустую машину с проезжей части на обочину, это не считается хулиганством. ]
4.2 За попрошайничество в общественных местах, преступнику присваивается 1 уровень розыска.

5. Оскорбление.
5.1 За оскорбление в любой форме, преступнику присваивается 2 уровень розыска.
[ Оскорбление – это любая попытка перехода на личности в общении, например обращение – "мусор" в отношении представителя силовых структур.
Так же оскорблением можно считать затрагивание расы, национальности [Ниггер, макаронник, узкоглазый и т.п.].
В случае если оскорбления идут в крайне неадекватной форме, при задержании следует ставить запрет на рассмотрение дела о выпуске под залог [Запрет права на адвоката].

6. Угон транспортного средства.
6.1 За угон транспортного средства, преступнику присваивается 2 уровень розыска.
[ Угон считается угоном лишь тогда, когда преступник сдвинулся с места находясь за рулем транспорта – в иных случаях следует задерживать за "Проникновение",
в зависимости от ситуации ограничиваясь предупреждением.
Если угон происходит через взлом авто, так же следует обвинять в порче имущества. ]

7. Неподчинение, попытка скрыться от полиции, побег.
7.1 За неподчинение правоохранительным органам, преступнику присваивается 1 уровень розыска.
[ Неподчинением следует считать отказ или игнорирование законных требований офицера, как пример: Отказ покинуть салон авто или отказ
покинуть место проведения тренировки гос. служащих.
Отказ оплачивать штраф или подписывать протокол о задержании неподчинением не является! ]
7.2 За попытку скрыться от сотрудников правоохранительных органов, преступнику присваивается 2 уровень розыска.
7.3 За побег из тюрьмы при помощи ключей от камер [/escape], преступнику присваивается 6 уровень розыска и запрет на выход под залог [ООП].
[ Ключи подвергаются изъятию из инвентаря лишь при 3 и выше уровне розыска [Общее кол-во зв. по действующим статьям] и за офф от ареста.
При проведении рейдов на ОПГ, у членов ОПГ розыск уже изначально 6+, так как рейд проводится после проведённого расследования против данной ОПГ.
Помните, ключи – как и лицензии, являются предметом ценности, за злоупотребление полномочиями и командами,
будет следовать наказание вплоть до увольнения с занесением в ЧС гос. структур. ]

8. Соучастие в преступлении.
8.1 За соучастие в преступлении, преступнику присваивается тоже же наказание, что и организатору.
[ Пример: Таксист везёт пассажира, если оскорбляет пассажир, а водитель пытается скрыться от погони, заместо того чтобы содействовать задержанию – он соучастник.
Однако если водитель оскорбляет, а невинный пассажир едет рядом, то пассажир соучастником не является, так как он не причастен к преступлению.

Не следует путать с содействием преступлению, если пассажир к примеру подсказывает водителю как/куда ехать или например провоцирует офицеров своими криками,
то это такое же соучастие. ]

9. Оружие.
9.1 За ношение оружия в открытом виде, кроме гос. служащих находящихся при исполнении служебных обязанностей – оружие изымается.
9.2 За ношение оружия без лицензии, преступнику присваивается 1 уровень розыска и штраф в размере 2000$.
9.3 За изготовление оружие нелегальным способом, его приобретение или его продажу, преступнику присваивается 3 уровень розыска с последующим изъятием оружия и/или материалов.
[ Нелегальным способом является изготовление оружия из материалов в гетто. Легальный способ – покупка у NPC в АММО. ]

10. Наркотики и материалы.
10.1 За хранение или перевозку наркотиков, преступнику присваивается 3 уровень розыска с изъятием наркотических веществ.
10.2 За хранение или перевозку материалов, преступнику присваивается 3 уровень розыска с изъятием материалов.
10.3 За употребление наркотиков, преступнику присваивается 3 уровень розыска с последующим изъятием наркотических веществ.
[ Отыгровки навроде – "/me съел конфету", с целью употребить наркотик и избежать наказание – НЕ являются адекватной РП-отыгровкой.
Если вы видите в чате "Nick_Name употребил(а) наркотик", то смело задерживайте преступника, при обязательном условии что это происходит прямо на ваших глазах
и вы напрямую видите персонаж игрока.
При употреблении наркотических веществ, розыск следует так же выдавать и за их хранение. ]
10.4 За употребление наркотических веществ гос. служащим, сотрудник увольняется из организации и получает 3 уровень розыска.
10.5 За рекламу/продажу/покупку наркотиков или материалов, преступнику присваивается 2 уровень розыска и изъятие наркотиков/материалов.
10.6 За изготовление наркотиков/психотропных веществ, присваивается 3 уровень розыска.
[ Относится так же к выращиванию "марихуаны" на фермах. Обвинению подлежат все фермеры, заместители и хозяева фермы. Простые работники обвинению не подлежат. ]


11.
Уничтожение и повреждение имущества.
11.1 За повреждение чужого имущества, преступнику присваивается 1 уровень розыска и штраф в размере 5000$
11.2 За уничтожение чужого имущества, преступнику присваивается 4 уровень розыска, штраф в размере 15000$ и полная выплата компенсации за нанесённый ущерб.
[ Уничтожением является любое действие, после которого предмет взорвался или исчез [Перевернули, утопили, расстреляли и т.д.]


12. Проникновение на запретную территорию.
12.1 За проникновение на охраняемую территорию, преступнику присваивается 2 уровень розыска.
[ Территории воинских частей и формирований, офис ФБР, участки SAPD, второй и выше этажи мэрии, места тренировок -
розыск следует выдавать после повторного нарушения границы. Пробивание блок постов,
проникновение на территории находящиеся под оцеплением силами правопорядка - розыск следует выдавать сразу же, после нарушения границы.
Если преступник совершил правонарушение на территории, то розыск следует выдавать так же и по этой статье (оскорбил и уехал, испортил имущество, угнал т/с и т.д.). ].
12.2 За проникновение на частную территорию, преступнику присваивается 1 уровень розыска.
[ Проникновение в транспорт является незаконным, если оно осуществляется без согласия владельца/арендатора данного транспорта.
Крыша SFN так же является частной территорией ].


13. Бандитизм.
13.1 За ограбление граждан или организаций, преступнику присваивается 3 уровень розыска с последующим изъятием награбленного имущества.
[ При ограблениях на форму, материалы или наркотики, розыск следует выдавать так же и за хранение. ]
13.2 За вымогательство, обвиняемому присваивается 2 уровень розыска.
[ "– Механик, либо ты сейчас отдаёшь нам все свои деньги, либо мы покромсаем твоё корыто до состояния металлолома!",
"– У меня есть док-ва твоего самовола, либо ты сейчас платишь мне 50000$,
либо я на это пожалуюсь и тебя уволят!" – примеры оснований для обвинений в вымогательстве. ]
13.3 За угрозы, обвиняемому присваивается 1 уровень розыска.
[ Угрозы наподобие "Тебя понизят/уволят/занесут в ЧС гос. структур" – наказываются по этой статье,
но если гражданин к примеру говорит "Я буду жаловаться!" – это не является основанием. ]
13.4 За провокации, обвиняемому присваивается 2 уровень розыска.
[ Выкрики подобно "– Давай! Стреляй, или ты боишься?!", оскорбительные жесты вроде "/me показал средний палец",
"/me плюнул в лицо" и т.п. – примеры оснований для обвинений в провокации. ]
13.5 За мошенничество, обвиняемому присваивается 2 уровень розыска.
[ Пример: Таксист на арендованном гос. авто с включенным счётчиком [/fare] вымогает деньги/чаевые наперёд,
а при отказе их дать –
высаживает из авто. Подобное является мошенничеством и за это следует задерживать.
"– Хочешь расскажу, как взламывать банкомат? Заплати деньги и скажу." – NonRP-мошенничество,
в этой ситуации обязательно сообщите в репорт администрации. ]
13.6 За попытку взлома/взлом базы данных полиции, преступнику присваивается 1 уровень розыска.

14. Проституция и изнасилование.
14.1 За предложение интимных услуг, преступнику присваивается 1 уровень розыска.
14.2 За изнасилование преступнику присваивается 3 уровень розыска.

15. Дача ложных показаний, использование фальшивых
документов.
15.1 За укрывательство преступлений/преступников/фактов/улик и прочей важной для следствия информации или за дачу ложных показаний,
преступнику присваивается 2 уровень розыска.
15.2 За использование фальшивых документов или удостоверений, присваивается 1 уровень розыска.


16. Клевета.
16.1 За клевету на гражданское или государственное лицо, присваивается 1 уровень розыска.
16.2 За клевету на государственные и частные организации, присваивается 2 уровень розыска.


17. Покупка, продажа и хранение военной формы.
17.1 За продажу военного имущества, военный подлежит увольнению, занесению в черный список армии, так же ему присваивается 3 уровень розыска.
17.2 За покупку военной формы, преступнику присваивается 2 уровень розыска, форма подлежит изъятию.
17.3 За хранение/ношение купленной или ворованной военной формы, преступнику присваивается 2 уровень розыска, форма подлежит изъятию.
[ Или хранение, или ношение – это одно и тоже преступление и при задержании обвинение следует выдавать лишь по одному виду статьи. ]

18. Покупка, кража и продажа ключей от камер.
18.1 За покупку/продажу/кражу ключей от камеры, преступнику присваивается 6 уровень розыска.

19. Коррупция.
19.1 За предложение взятки, преступнику присваивается 2 уровень розыска.
19.2 За принятие взятки, гос. сотрудник несет наказание в виде присвоения 2 уровня розыска и увольнения.
[ Чтобы офицер понёс наказание за коррупцию, вы должны предоставить руководству РП-доказательства, к примеру:
Запись диктофона или видео с видеорегистратора, с полагающейся РП-отыгровкой.
Полиции запрещается полностью манипулировать ситуацией, не оставляя жертвам ни единого шанса,
за бредовые махинации вроде "/me изъял все предметы для видеосъёмки, диктофон, часы и т.п.",
будет следовать наказание за PowerGaming. ]

20. Терроризм и взятие в заложники.
20.1 За совершение теракта, захват зданий и помещений, преступнику присваивается 6 уровень розыска,
лишение всех лицензий и запрет на выход под залог [ООП].
[ Террористический акт — совершение взрыва, поджога или иных действий, устрашающих население и создающих опасность гибели человека,
посеяв страх и неуверенность в его несокрушимости среди населения.
Стрельба в воздух среди населения, стрельба в людей, взрывы – считается терактом. Вооруженное нападение на одного человека,
террористическим актом не является. ]
20.2 За похищение или взятие в заложники граждан или гос. сотрудников, преступнику присваивается 4 уровень розыска,
изъятие лицензии на оружие и запрет на выход под залог [ООП].

21. Нелегальные мероприятия/организации. Митинги.
21.1 За организацию нелегальных мероприятий/митингов (Без согласия мэра, премьер-министра или шерифа окрестности, которое стало местом проведения),
организаторам присваивается 2 уровень розыска.
21.2 За создание нелегальных организаций (Без согласия мэра или премьер-министра), организаторы и работники получают наказание в виде 3 уровня розыска.

22. Браконьерство.
22.1 За рыбалку без лицензии [Браконьерство], преступнику присваивается 1 уровень розыска.

23. Неуплата штрафа.
23.1 За неуплату штрафа, преступнику присваивается 2 уровень
розыска.

24. Игнорирование спец.сирен.
24.1 За игнорирование специальных сирен при движении государственного транспорта, преступнику присваивается 1 уровень розыска.


Раздел II

1. Неординарные ситуации.
1.1 За уход в "АФК" на 30 с лишним секунд или за офф от ареста, преступнику присваивается 6 уровень розыска с причиной:
"Уход" и запрет на выход под залог [ООП].
1.2 За превышение полномочий адвоката [освобождение ООП], адвокату присваивается 3 уровень розыска и
запрет на выход под залог [Данное деяние приравнивается к соучастию ООП].
[ Освобожденный преступник задерживается по статье за побег с места заключения (статья 7.3) ].
1.3 За агитацию в день выборов – присваивается 6 уровень розыска и запрет на выход под залог [ООП].
[ Запрещена агитация путём подачи объявлений, в эфирах радио, в публичных выступлениях, выкриках и СМС-рассылке. ]


2. Судебные разбирательства.
2.1 За уклонение от участия в судебном разбирательстве, преступнику присваивается 3 уровень розыска и
запрет на выход под залог [ООП], так же происходит понижение/увольнение из организации,
если он там состоит, если это невозможно, то ему присваивается штраф устанавливаемый судом.
2.2 За отказ в выплате денежной компенсации, преступнику присваивается 2 уровень розыска и запрет на выход под залог [ООП],
так же происходит понижение/увольнение из организации, если он там состоит,
если это невозможно, то ему присваивается штраф устанавливаемый судом.
2.3 За уклонение от уголовного наказания [АФК/выход из игры/неоправданный неактив и т.п.],
преступнику присваивается 3 уровень розыска и запрет на выход под залог [ООП],
так же происходит понижение/увольнение из организации, если он там состоит, если же это невозможно,
то ему присваивается штраф устанавливаемый судом.
2.4 За нарушение порядка на судебном заседании [Касается всех участников процесса, включая судебную комиссию],
преступнику присваивается 2 уровень розыска и запрет на выход под залог [ООП],
так же если не удается задержать нарушителя, то добавляется статья 2.3.


3. Получение лицензии нелегальным способом.
3.1 За получение лицензии на бизнес без разрешения Службы Потребительского Надзора преступнику присваивается
1 уровень розыска и штраф в размере 100.000$.


ПРИМЕЧАНИЕ К УГОЛОВНОМУ КОДЕКСУ:


Знание пунктов 2 и 3 второго раздела УК не является обязательным, так как они используются исключительно в судебных процессах.

Так как на нашем проекте нет судов, которые определяют тяжесть преступления – все нарушения законов совмещаются –
по каждому преступлению идёт отдельное обвинение, как примеры:
Человека задержали за употребление наркотиков, при обыске у него нашли ещё наркотики –
следует выдавать розыск как за употребление, так и за хранение.
Человека задержали за угон частного т/с, при задержании следует выдавать розыск как за угон,
так и за проникновение в транспорт.

Так же, при условии что:
1. Преступник адекватен;
2. Идёт на встречу правоохранительным органам;
3. Был задержан не по статьям, за которые следует 10-14.
Задержанному разрешается сбавить срок до минимального, с сохранением лицензий, но не запрещёнки.
Суть: Если задержанный признаёт свою вину, раскаивается и после же вменяемо отыгрывает с офицером полноценный допрос, где даёт пояснение своих мотивов свершения данного преступления –
он получает право на кратчайшее освобождение из СИЗО [/clear –> /su 1 Чистосердечное признание –> /arrest].
]]

function getNameSphere(id)
  local names = 
  {
    [1] = 'АВ',
    [2] = 'АШ',
    [3] = 'СФа',
    [4] = 'В',
    [5] = 'А',
    [6] = 'СФн',
    [7] = 'Тоннель',
    [8] = 'Мэрия',
    [9] = 'Хот-Доги',
    [10] = 'Больница ЛС',
    [11] = 'АВ',
    [12] = 'Мост',
    [13] = 'Патрульный А',
    [14] = 'Патрульный B',
    [15] = 'Постовой В',
    [16] = 'Постовой А',
    [17] = 'Постовой В',
    [18] = 'С',
    [19] = 'КПП',
    [20] = 'Порт ЛС',
    [21] = 'Опасный район'
  }
  return names[id]
end

function shpf()
if not doesFileExist('moonloader/fbitools/shp.txt') then
    local file = io.open("moonloader/fbitools/shp.txt", "w")
    file:write(shpt)
    file:close()
    file = nil
  end
end
function akf()
  if not doesFileExist('moonloader/fbitools/ak.txt') then
    local file = io.open("moonloader/fbitools/ak.txt", "w")
    file:write(akt)
    file:close()
    file = nil
  end
end

function fpf()
  if not doesFileExist('moonloader/fbitools/fp.txt') then
    local file = io.open("moonloader/fbitools/fp.txt", "w")
    file:write(fpt)
    file:close()
    file = nil
  end
end

function ykf()
	if not doesFileExist('moonloader/fbitools/yk.txt') then
		local file = io.open("moonloader/fbitools/yk.txt", "w")
		file:write(ykt)
		file:close()
		file = nil
	end
end

function mcheckf()
  if not doesFileExist('moonloader/fbitools/mcheck.txt') then
		local file = io.open("moonloader/fbitools/mcheck.txt", "w")
		file:close()
		file = nil
  end
end

local file = getWorkingDirectory() .. "\\config\\binds.bind"
local tEditData = {
   id = -1,
   inputActive = false
}
local bMainWindow = imgui.ImBool(false)
local sInputEdit = imgui.ImBuffer(128)
local bIsEnterEdit = imgui.ImBool(false)

local tBindList = {}
if doesFileExist(file) then
   local f = io.open(file, "r")
   if f then
      tBindList = decodeJson(f:read("*a"))
      f:close()
   end
else
   tBindList = {
      [1] = {
         text = "/dkld",
         v = {key.VK_3}
      },
      [2] = {
         text = "/time",
         v = {key.VK_4}
      }
   }
end

local fcmenu =
{
  {
    title = 'Теракты',
    submenu =
    {
      {
        title = '{00BFFF}« Мэрия »'
      },
      {
        title = '{00BFFF}Захват мэрии без заложников — {ff0000}100.000$'
      },
      {
        title = '{00BFFF}Захват мэрии c заложниками — {ff0000}150.000$'
      },
      {
        title = '{9A9593}« Офис ФБР »'
      },
      {
        title = '{9A9593}Захват офиса федерального бюро без заложников — {ff0000}100.000$'
      },
      {
        title = '{9A9593}Захват офиса федерального бюро c заложниками — {ff0000}150.000$'
      },
      {
        title = '{0080FF}« Участок SFPD »'
      },
      {
        title = '{0080FF}Захват участка SAPD без заложников — {ff0000}100.000$'
      },
      {
        title = '{0080FF}Захват участка SAPD c заложниками — {ff0000}150.000$'
      },
      {
        title = '{BF4040}« Больница »'
      },
      {
        title = '{BF4040}Захват больницы без заложников — {ff0000}75.000$'
      },
      {
        title = '{BF4040}Захват больницы с заложниками — {ff0000}100.000$'
      },
      {
        title = '{00BFFF}« Автошкола »'
      },
      {
        title = '{00BFFF}Захват автошколы без заложников — {ff0000}50.000$'
      },
      {
        title = '{00BFFF}Захват автошколы с заложниками — {ff0000}75.000$'
      },
      {
        title = '{40BFBF}« CМИ »'
      },
      {
        title = '{40BFBF}Захват СМИ без заложников — {ff0000}50.000$'
      },
      {
        title = '{40BFBF}Захват СМИ с заложниками — {ff0000}75.000$'
      },
      {
        title = '« Остальное »'
      },
      {
        title = 'Захват развлекательных/рабочих заведений без заложников — {ff0000}50.000$'
      },
      {
        title = 'Захват развлекательных/рабочих заведений с заложниками — {ff0000}75.000$'
      }
    }
  },
  {
    title = 'Похищения',
    submenu =
    {
      {
        title = 'Мэрия',
        submenu =
        {
          {
            title = '{0040BF}Мэр{ffffff} [6] - {ff0000}100.000$'
          },
          {
            title = '{0040BF}Зам.Мэра{ffffff} [5] - {ff0000}80.000$'
          },
          {
            title = '{0040BF}Начальник охраны{ffffff} [4] - {ff0000}60.000$'
          },
          {
            title = '{0040BF}Охранник{ffffff} [3] - {ff0000}40.000$'
          },
          {
            title = '{0040BF}Адвокат{ffffff} [2] - {ff0000}30.000$'
          },
          {
            title = '{0040BF}Секретарь{ffffff} [1] - {ff0000}20.000$'
          }
        }
      },
      {
        title = 'ФБР',
        submenu =
        {
          {
            title = '{9A9593}Директор{ffffff} [10] - {ff0000}100.000$'
          },
          {
            title = '{9A9593}Зам.Директора{FFFFFF} [9] - {ff0000}80.000$'
          },
          {
            title = '{9A9593}Инспектор{ffffff} [8] - {ff0000}70.000$'
          },
          {
            title = '{9A9593}Глава CID{ffffff} [7] - {ff0000}60.000$'
          },
          {
            title = '{9A9593}Глава DEA{ffffff} [6] - {ff0000}50.000$'
          },
          {
            title = '{9A9593}Агент CID{ffffff} [5] - {ff0000}40.000$'
          },
          {
            title = '{9A9593}Агент DEA{ffffff} [4] - {ff0000}30.000$'
          },
          {
            title = '{9A9593}Мл.Агент{ffffff} [3] - {ff0000}25.000$'
          },
          {
            title = '{9A9593}Дежурный{ffffff} [2] - {ff0000}20.000$'
          },
          {
            title = '{9A9593}Стажер{ffffff} [1] - {ff0000}15.000$'
          }
        }
      },
      {
        title = 'Полиция',
        submenu =
        {
          {
            title = '{0000FF}Шериф{ffffff} [14] - {ff0000}80.000$'
          },
          {
            title = '{0000FF}Полковник{ffffff} [13] - {ff0000}70.000$'
          },
          {
            title = '{0000FF}Подполковник{ffffff} [12] - {ff0000}65.000$'
          },
          {
            title = '{0000FF}Майор{ffffff} [11] - {ff0000}60.000$'
          },
          {
            title = '{0000FF}Капитан{ffffff} [10] - {ff0000}55.000$'
          },
          {
            title = '{0000FF}Ст.Лейтенант{ffffff} [9] - {ff0000}50.000$'
          },
          {
            title = '{0000FF}Лейтенант{ffffff} [8] - {ff0000}45.000$'
          },
          {
            title = '{0000FF}Мл.Лейтенант{ffffff} [7] - {ff0000}40.000$'
          },
          {
            title = '{0000FF}Ст.Прапорщик{ffffff} [6] - {ff0000}35.000$'
          },
          {
            title = '{0000FF}Прапорщик{ffffff} [5] - {ff0000}30.000$'
          },
          {
            title = '{0000FF}Сержант{ffffff} [4] - {ff0000}25.000$'
          },
          {
            title = '{0000FF}Мл.Сержант{ffffff} [3] - {ff0000}20.000$'
          },
          {
            title = '{0000FF}Офицер{ffffff} [2] - {ff0000}15.000$'
          },
          {
            title = '{0000FF}Кадет{ffffff} [1] - {ff0000}10.000$'
          }
        }
      },
      {
        title = 'Армия',
        submenu =
        {
          {
            title = '{008040}Генерал{ffffff} [15] - {ff0000}80.000$'
          },
          {
            title = '{008040}Полковник{ffffff} [14] - {ff0000}75.000$'
          },
          {
            title = '{008040}Подполковник{ffffff} [13] - {ff0000}70.000$'
          },
          {
            title = '{008040}Майор{ffffff} [12] - {ff0000}65.000$'
          },
          {
            title = '{008040}Капитан{ffffff} [11] - {ff0000}60.000$'
          },
          {
            title = '{008040}Ст.Лейтенант{ffffff} [10] - {ff0000}55.000$'
          },
          {
            title = '{008040}Лейтенант{ffffff} [9] - {ff0000}50.000$'
          },
          {
            title = '{008040}Мл.Лейтенант{ffffff} [8] - {ff0000}45.000$'
          },
          {
            title = '{008040}Прапорщик{ffffff} [7] - {ff0000}40.000$'
          },
          {
            title = '{008040}Старшина{ffffff} [6] - {ff0000}35.000$'
          },
          {
            title = '{008040}Ст.сержант{ffffff} [5] - {ff0000}30.000$'
          },
          {
            title = '{008040}Сержант{ffffff} [4] - {ff0000}25.000$'
          },
          {
            title = '{008040}Мл.Сержант{ffffff} [3] - {ff0000}20.000$'
          },
          {
            title = '{008040}Ефрейтор{ffffff} [2] - {ff0000}15.000$'
          },
          {
            title = '{008040}Рядовой{ffffff} [1] - {ff0000}10.000$'
          }
        }
      },
      {
        title = 'Медики',
        submenu =
        {
          {
            title = '{BF4040}Глав.Врач{ffffff} [10] - {ff0000}80.000$'
          },
          {
            title = '{BF4040}Зам.Глав.Врача{ffffff} [9] - {ff0000}75.000$'
          },
          {
            title = '{BF4040}Хирург{ffffff} [8] - {ff0000}70.000$'
          },
          {
            title = '{BF4040}Психолог{ffffff} [7] - {ff0000}60.000$'
          },
          {
            title = '{BF4040}Доктор{ffffff} [6] - {ff0000}40.000$'
          },
          {
            title = '{BF4040}Нарколог{ffffff} [5] - {ff0000}35.000$'
          },
          {
            title = '{BF4040}Спасатель{ffffff} [4] - {ff0000}30.000$'
          },
          {
            title = '{BF4040}Мед.Брат{ffffff} [3] - {ff0000}25.000$'
          },
          {
            title = '{BF4040}Санитар{ffffff} [2] - {ff0000}20.000$'
          },
          {
            title = '{BF4040}Интерн{ffffff} [1] - {ff0000}15.000$'
          }
        }
      },
      {
        title = 'Автошкола',
        submenu =
        {
          {
            title = '{40BFFF}Управляющий{ffffff} [10] - {ff0000}80.000$'
          },
          {
            title = '{40BFFF}Директор{ffffff} [9] - {ff0000}75.000$'
          },
          {
            title = '{40BFFF}Ст.Менеджер{ffffff} [8] - {ff0000}70.000$'
          },
          {
            title = '{40BFFF}Мл.Менеджер{ffffff} [7] - {ff0000}60.000$'
          },
          {
            title = '{40BFFF}Координатор{ffffff} [6] - {ff0000}55.000$'
          },
          {
            title = '{40BFFF}Инструктор{FFFFFF} [5] - {ff0000}50.000$'
          },
          {
            title = '{40BFFF}Мл.Инструктор{ffffff} [4] - {ff0000}45.000$'
          },
          {
            title = '{40BFFF}Экзаменатор{ffffff} [3] - {ff0000}30.000$'
          },
          {
            title = '{40BFFF}Консультант{ffffff} [2] - {ff0000}25.000$'
          },
          {
            title = '{40BFFF}Стажер{ffffff} [1] - {ff0000}20.000$'
          }
        }
      },
      {
        title = 'Новости',
        submenu =
        {
          {
            title = '{FFFF80}Генеральный директор{ffffff} [10] - {ff0000}70.000$'
          },
          {
            title = '{FFFF80}Програмный директор{ffffff} [9] - {ff0000}60.000$'
          },
          {
            title = '{FFFF80}Технический директор{ffffff} [8] - {ff0000}55.000$'
          },
          {
            title = '{FFFF80}Главный редактор{ffffff} [7] - {ff0000}50.000$'
          },
          {
            title = '{FFFF80}Редактор{ffffff} [6] - {ff0000}45.000$'
          },
          {
            title = '{FFFF80}Ведущий{ffffff} [5] - {ff0000}40.000$'
          },
          {
            title = '{FFFF80}Репортер{ffffff} [4] - {ff0000}30.000$'
          },
          {
            title = '{FFFF80}Звукорежиссер{ffffff} [3] - {ff0000}25.000$'
          },
          {
            title = '{FFFF80}Звукооператор{ffffff} [2] - {ff0000}20.000$'
          },
          {
            title = '{FFFF80}Стажер{ffffff} [1] - {ff0000}15.000$'
          }
        }
      }
    }
  }
}

local fbitools =
{
  main =
  {
    posX = 1738,
    posY = 974,
    widehud = 320,
    male = true,
    wanted == false,
    clear == false,
    hud = false,
    tar = nil,
		clist = 0,
  },
  commands =
  {
    ticket = true,
    cput = true,
    ceject = true,
    tazer = true,
    deject = true,
    ftazer = true
  },
  keys =
  {
    tazer = key.VK_X,
    fastmenu = key.VK_F2,
    oopda = key.VK_F12,
    oopnet = key.VK_F11
  }
}
cfg = inicfg.load(nil, 'fbitools/config.ini')

function kvadrat()
    local KV = {
        [1] = "А",
        [2] = "Б",
        [3] = "В",
        [4] = "Г",
        [5] = "Д",
        [6] = "Ж",
        [7] = "З",
        [8] = "И",
        [9] = "К",
        [10] = "Л",
        [11] = "М",
        [12] = "Н",
        [13] = "О",
        [14] = "П",
        [15] = "Р",
        [16] = "С",
        [17] = "Т",
        [18] = "У",
        [19] = "Ф",
        [20] = "Х",
        [21] = "Ц",
        [22] = "Ч",
        [23] = "Ш",
        [24] = "Я",
    }
    local X, Y, Z = getCharCoordinates(playerPed)
    X = math.ceil((X + 3000) / 250)
    Y = math.ceil((Y * - 1 + 3000) / 250)
    Y = KV[Y]
    local KVX = (Y.."-"..X)
    return KVX
end

function fthelp()
  lua_thread.create(function()
    submenus_show(fthelpsub, '{9966cc}FBI Tools {ffffff}| Help')
  end)
end

function getCarNamebyModel(model)
  local names = {
    [400] = 'Landstalker',
    [401] = 'Bravura',
    [402] = 'Buffalo',
    [403] = 'Linerunner',
    [404] = 'Perennial',
    [405] = 'Sentinel',
    [406] = 'Dumper',
    [407] = 'Firetruck',
    [408] = 'Trashmaster',
    [409] = 'Stretch',
    [410] = 'Manana',
    [411] = 'Infernus',
    [412] = 'Voodoo',
    [413] = 'Pony',
    [414] = 'Mule',
    [415] = 'Cheetah',
    [416] = 'Ambulance',
    [417] = 'Leviathan',
    [418] = 'Moonbeam',
    [419] = 'Esperanto',
    [420] = 'Taxi',
    [421] = 'Washington',
    [422] = 'Bobcat',
    [423] = 'Mr. Whoopee',
    [424] = 'BF Injection',
    [425] = 'Hunter',
    [426] = 'Premier',
    [427] = 'Enforcer',
    [428] = 'Securicar',
    [429] = 'Banshee',
    [430] = 'Predator',
    [431] = 'Bus',
    [432] = 'Rhino',
    [433] = 'Barracks',
    [434] = 'Hotknife',
    [435] = 'Article Trailer',
    [436] = 'Previon',
    [437] = 'Coach',
    [438] = 'Cabbie',
    [439] = 'Stallion',
    [440] = 'Rumpo',
    [441] = 'RC Bandit',
    [442] = 'Romero',
    [443] = 'Packer',
    [444] = 'Monster',
    [445] = 'Admiral',
    [446] = 'Squallo',
    [447] = 'Seasparrow',
    [448] = 'Pizzaboy',
    [449] = 'Tram',
    [450] = 'Article Trailer 2',
    [451] = 'Turismo',
    [452] = 'Speeder',
    [453] = 'Reefer',
    [454] = 'Tropic',
    [455] = 'Flatbed',
    [456] = 'Yankee',
    [457] = 'Caddy',
    [458] = 'Solair',
    [459] = 'Topfun Van',
    [460] = 'Skimmer',
    [461] = 'PCJ-600',
    [462] = 'Faggio',
    [463] = 'Freeway',
    [464] = 'RC Baron',
    [465] = 'RC Raider',
    [466] = 'Glendale',
    [467] = 'Oceanic',
    [468] = 'Sanchez',
    [469] = 'Sparrow',
    [470] = 'Patriot',
    [471] = 'Quad',
    [472] = 'Coastguard',
    [473] = 'Dinghy',
    [474] = 'Hermes',
    [475] = 'Sabre',
    [476] = 'Rustler',
    [477] = 'ZR-350',
    [478] = 'Walton',
    [479] = 'Regina',
    [480] = 'Comet',
    [481] = 'BMX',
    [482] = 'Burrito',
    [483] = 'Camper',
    [484] = 'Marquis',
    [485] = 'Baggage',
    [486] = 'Dozer',
    [487] = 'Maverick',
    [488] = 'News Maverick',
    [489] = 'Rancher',
    [490] = 'FBI Rancher',
    [491] = 'Virgo',
    [492] = 'Greenwood',
    [493] = 'Jetmax',
    [494] = 'Hotring Racer',
    [495] = 'Sandking',
    [496] = 'Blista Compact',
    [497] = 'Police Maverick',
    [498] = 'Boxville',
    [499] = 'Benson',
    [500] = 'Mesa',
    [501] = 'RC Goblin',
    [502] = 'Hotring Racer A',
    [503] = 'Hotring Racer B',
    [504] = 'Bloodring Banger',
    [505] = 'Rancher',
    [506] = 'Super GT',
    [507] = 'Elegant',
    [508] = 'Journey',
    [509] = 'Bike',
    [510] = 'Mountain Bike',
    [511] = 'Beagle',
    [512] = 'Cropduster',
    [513] = 'Stuntplane',
    [514] = 'Tanker',
    [515] = 'Roadtrain',
    [516] = 'Nebula',
    [517] = 'Majestic',
    [518] = 'Buccaneer',
    [519] = 'Shamal',
    [520] = 'Hydra',
    [521] = 'FCR-900',
    [522] = 'NRG-500',
    [523] = 'HPV1000',
    [524] = 'Cement Truck',
    [525] = 'Towtruck',
    [526] = 'Fortune',
    [527] = 'Cadrona',
    [528] = 'FBI Truck',
    [529] = 'Willard',
    [530] = 'Forklift',
    [531] = 'Tractor',
    [532] = 'Combine',
    [533] = 'Feltzer',
    [534] = 'Remington',
    [535] = 'Slamvan',
    [536] = 'Blade',
    [537] = 'Train',
    [538] = 'Train',
    [539] = 'Vortex',
    [540] = 'Vincent',
    [541] = 'Bullet',
    [542] = 'Clover',
    [543] = 'Sadler',
    [544] = 'Firetruck',
    [545] = 'Hustler',
    [546] = 'Intruder',
    [547] = 'Primo',
    [548] = 'Cargobob',
    [549] = 'Tampa',
    [550] = 'Sunrise',
    [551] = 'Merit',
    [552] = 'Utility Van',
    [553] = 'Nevada',
    [554] = 'Yosemite',
    [555] = 'Windsor',
    [556] = 'Monster A',
    [557] = 'Monster B',
    [558] = 'Uranus',
    [559] = 'Jester',
    [560] = 'Sultan',
    [561] = 'Stratum',
    [562] = 'Elegy',
    [563] = 'Raindance',
    [564] = 'RC Tiger',
    [565] = 'Flash',
    [566] = 'Tahoma',
    [567] = 'Savanna',
    [568] = 'Bandito',
    [569] = 'Train',
    [570] = 'Train',
    [571] = 'Kart',
    [572] = 'Mower',
    [573] = 'Dune',
    [574] = 'Sweeper',
    [575] = 'Broadway',
    [576] = 'Tornado',
    [577] = 'AT400',
    [578] = 'DFT-30',
    [579] = 'Huntley',
    [580] = 'Stafford',
    [581] = 'BF-400',
    [582] = 'Newsvan',
    [583] = 'Tug',
    [584] = 'Petrol Trailer',
    [585] = 'Emperor',
    [586] = 'Wayfarer',
    [587] = 'Euros',
    [588] = 'Hotdog',
    [589] = 'Club',
    [590] = 'Train',
    [591] = 'Article Trailer 3',
    [592] = 'Andromada',
    [593] = 'Dodo',
    [594] = 'RC Cam',
    [595] = 'Launch',
    [596] = 'Police LSPD',
    [597] = 'Police SFPD',
    [598] = 'Police LVPD',
    [599] = 'Police Ranger',
    [600] = 'Picador',
    [601] = 'S.W.A.T.',
    [602] = 'Alpha',
    [603] = 'Phoenix',
    [604] = 'Glendale',
    [605] = 'Sadler',
    [606] = 'Baggage Trailer',
    [607] = 'Baggage Trailer',
    [608] = 'Tug Stairs Trailer',
    [609] = 'Boxville',
    [610] = 'Farm Trailer',
    [611] = 'Utility Traileraw '
  }
  return names[model]
end

function getweaponname(weapon)
  local names = {
  [0] = "Fist",
  [1] = "Brass Knuckles",
  [2] = "Golf Club",
  [3] = "Nightstick",
  [4] = "Knife",
  [5] = "Baseball Bat",
  [6] = "Shovel",
  [7] = "Pool Cue",
  [8] = "Katana",
  [9] = "Chainsaw",
  [10] = "Purple Dildo",
  [11] = "Dildo",
  [12] = "Vibrator",
  [13] = "Silver Vibrator",
  [14] = "Flowers",
  [15] = "Cane",
  [16] = "Grenade",
  [17] = "Tear Gas",
  [18] = "Molotov Cocktail",
  [22] = "9mm",
  [23] = "Silenced 9mm",
  [24] = "Desert Eagle",
  [25] = "Shotgun",
  [26] = "Sawnoff Shotgun",
  [27] = "Combat Shotgun",
  [28] = "Micro SMG/Uzi",
  [29] = "MP5",
  [30] = "AK-47",
  [31] = "M4",
  [32] = "Tec-9",
  [33] = "Country Rifle",
  [34] = "Sniper Rifle",
  [35] = "RPG",
  [36] = "HS Rocket",
  [37] = "Flamethrower",
  [38] = "Minigun",
  [39] = "Satchel Charge",
  [40] = "Detonator",
  [41] = "Spraycan",
  [42] = "Fire Extinguisher",
  [43] = "Camera",
  [44] = "Night Vis Goggles",
  [45] = "Thermal Goggles",
  [46] = "Parachute" }
  return names[weapon]
end

local fthmenu =
{
  {
    title = "Запросить поддержку в текущий квадрат",
    onclick = function()
      sampSendChat("/r Нужна поддержка в квадрат "..kvadrat())
    end
  },
  {
    title = "Запросить эвакуацию в текущий квадрат",
    onclick = function()
      sampShowDialog(1401, '{9966cc}FBI Tools {ffffff}| Evacuation', 'Введите: кол-во мест', 'Отправить', '', 1)
    end
  },
  {
    title = "Запросить старших организации",
    onclick = function()
      sampShowDialog(1403, '{9966cc}FBI Tools {ffffff}| Call', 'Введите: название организации', 'Отправить', '', 1)
    end
  },
  {
    title = 'Цены выкупа',
    onclick = function()
    submenus_show(fcmenu, '{9966cc}FBI Tools {ffffff}| Цены выкупа')
    end
  }
}

local fthmenur =
{
  {
    title = "Запросить поддержку в текущий квадрат",
    onclick = function()
      sampSendChat("/r "..cfg.main.tar.." Нужна поддержка в квадрат "..kvadrat())
    end
  },
  {
    title = "Запросить эвакуацию в текущий квадрат",
    onclick = function()
      sampShowDialog(1402, '{9966cc}FBI Tools {ffffff}| Evacuation', 'Введите: кол-во мест', 'Отправить', '', 1)
    end
  },
  {
    title = "Запросить старших организации",
    onclick = function()
      sampShowDialog(1403, '{9966cc}FBI Tools {ffffff}| Call', 'Введите: название организации', 'Отправить', '', 1)
    end
  },
  {
    title = 'Цены выкупа',
    onclick = function()
    submenus_show(fcmenu, '{9966cc}FBI Tools {ffffff}| Цены выкупа')
    end
  }
}

local osnova =
{
  {
    title = "Лаборатория",
    onclick = function()
      local _, myid = sampGetPlayerIdByCharHandle(PLAYER_PED)
      if cfg.main.male == true then
        sampSendChat("/r Переоделся в сотрудника лаборатории.")
        wait(1200)
        sampSendChat("/rb "..myid)
      end
      if cfg.main.male == false then
        sampSendChat("/r Переоделась в сотрудника лаборатории.")
        wait(1200)
        sampSendChat("/rb "..myid)
      end
    end
  },
  {
    title = 'Гражданский',
    onclick = function()
      sampShowDialog(1385, '{9966cc}FBI Tools {ffffff}| Mask Reason', 'Введите: причину', 'Отправить', '', 1)
    end
  },
  {
    title = 'Полиция',
    onclick = function()
      sampShowDialog(1386, '{9966cc}FBI Tools {ffffff}| Mask Reason', 'Введите: причину', 'Отправить', '', 1)
    end
  },
  {
    title = 'Армия',
    onclick = function()
      sampShowDialog(1387, '{9966cc}FBI Tools {ffffff}| Mask Reason', 'Введите: причину', 'Отправить', '', 1)
    end
  },
  {
    title = 'МЧС',
    onclick = function()
      sampShowDialog(1388, '{9966cc}FBI Tools {ffffff}| Mask Reason', 'Введите: причину', 'Отправить', '', 1)
    end
  },
  {
    title = 'Мэрия',
    onclick = function()
      sampShowDialog(1389, '{9966cc}FBI Tools {ffffff}| Mask Reason', 'Введите: причину', 'Отправить', '', 1)
    end
  },
  {
    title = 'Автошкола',
    onclick = function()
      sampShowDialog(1390, '{9966cc}FBI Tools {ffffff}| Mask Reason', 'Введите: причину', 'Отправить', '', 1)
    end
  },
  {
    title = 'News',
    onclick = function()
      sampShowDialog(1391, '{9966cc}FBI Tools {ffffff}| Mask Reason', 'Введите: причину', 'Отправить', '', 1)
    end
  },
  {
    title = 'LCN',
    onclick = function()
      sampShowDialog(1392, '{9966cc}FBI Tools {ffffff}| Mask Reason', 'Введите: причину', 'Отправить', '', 1)
    end
  },
  {
    title = 'Yakuza',
    onclick = function()
      sampShowDialog(1393, '{9966cc}FBI Tools {ffffff}| Mask Reason', 'Введите: причину', 'Отправить', '', 1)
    end
  },
  {
    title = 'Russian Mafia',
    onclick = function()
      sampShowDialog(1394, '{9966cc}FBI Tools {ffffff}| Mask Reason', 'Введите: причину', 'Отправить', '', 1)
    end
  },
  {
    title = 'Rifa',
    onclick = function()
      sampShowDialog(1395, '{9966cc}FBI Tools {ffffff}| Mask Reason', 'Введите: причину', 'Отправить', '', 1)
    end
  },
  {
    title = 'Grove Street',
    onclick = function()
      sampShowDialog(1396, '{9966cc}FBI Tools {ffffff}| Mask Reason', 'Введите: причину', 'Отправить', '', 1)
    end
  },
  {
    title = 'Ballas',
    onclick = function()
      sampShowDialog(1397, '{9966cc}FBI Tools {ffffff}| Mask Reason', 'Введите: причину', 'Отправить', '', 1)
    end
  },
  {
    title = 'Vagos',
    onclick = function()
      sampShowDialog(1398, '{9966cc}FBI Tools {ffffff}| Mask Reason', 'Введите: причину', 'Отправить', '', 1)
    end
  },
  {
    title = 'Aztec',
    onclick = function()
      sampShowDialog(1399, '{9966cc}FBI Tools {ffffff}| Mask Reason', 'Введите: причину', 'Отправить', '', 1)
    end
  },
  {
    title = "Байкеры",
    onclick = function()
      sampShowDialog(1400, '{9966cc}FBI Tools {ffffff}| Mask Reason', 'Введите: причину', 'Отправить', '', 1)
    end
  }
}

local dfmenu =
{
  {
    title = 'Бомба с часовым механизмом',
    onclick = function()
      if cfg.main.male == true then
        sampSendChat("/me достал саперный набор")
        wait(3500)
        sampSendChat("/me открыл саперный набор")
        wait(3500)
        sampSendChat("/me осмотрел взрывное устройство")
        wait(3500)
        sampSendChat("/do Определил тип взрывного устройства. Бомба с часовым механизмом.")
        wait(3500)
        sampSendChat("/do Увидел три провода выходящих с механизма.")
        wait(3500)
        sampSendChat("/me достал нож из саперного набора")
        wait(3500)
        sampSendChat("/me аккуратно зачистил первый провод")
        wait(3500)
        sampSendChat("/try достал отвертку с индикатором и прислонил край отвертки к оголённом проводу")
      end
      if cfg.main.male == false then
        sampSendChat("/me достала саперный набор")
        wait(3500)
        sampSendChat("/me открыла саперный набор")
        wait(3500)
        sampSendChat("/me осмотрела взрывное устройство")
        wait(3500)
        sampSendChat("/do Определила тип взрывного устройства. Бомба с часовым механизмом.")
        wait(3500)
        sampSendChat("/do Увидела три провода выходящих с механизма.")
        wait(3500)
        sampSendChat("/me достала нож из саперного набора")
        wait(3500)
        sampSendChat("/me аккуратно зачистила первый провод")
        wait(3500)
        sampSendChat("/try достала отвертку с индикатором и прислонила край отвертки к оголённом проводу")
      end
    end
  },
  {
    title = 'Бомба с часовым механизмом если {63c600}[Удачно]',
    onclick = function()
        if cfg.main.male == true then
        sampSendChat("/me перерезал проводок")
        wait(3500)
        sampSendChat("/me прислушался к устройству")
        wait(3500)
        sampSendChat("/do Механизм перестал издавать тикающие звуки.")
        wait(3500)
        sampSendChat("/do Бомба обезврежена.")
        wait(3500)
        sampSendChat("/me сложил инструменты обратно в саперный набор")
        wait(3500)
        sampSendChat("/me достал бронированный кейс и аккуратно сложил туда бомбу")
      end
      if cfg.main.male == false then
        sampSendChat("/me перерезала проводок")
        wait(3500)
        sampSendChat("/me прислушалась к устройству")
        wait(3500)
        sampSendChat("/do Механизм перестал издавать тикающие звуки.")
        wait(3500)
        sampSendChat("/do Бомба обезврежена.")
        wait(3500)
        sampSendChat("/me сложила инструменты обратно в саперный набор")
        wait(3500)
        sampSendChat("/me достала бронированный кейс и аккуратно сложила туда бомбу")
      end
    end
  },
  {
    title = 'Бомба с часовым механизмом если {bf0000}[Неудачно]',
    onclick = function()
      if cfg.main.male == true then
        sampSendChat("/me аккуратно зачистил второй провод")
        wait(3500)
        sampSendChat("/me перерезал проводок")
        wait(3500)
        sampSendChat("/me прислушался к устройству")
        wait(3500)
        sampSendChat("/do Механизм перестал издавать тикающие звуки.")
        wait(3500)
        sampSendChat("/do Бомба обезврежена.")
        wait(3500)
        sampSendChat("/me сложил инструменты обратно в саперный набор")
        wait(3500)
        sampSendChat("/me достал бронированный кейс и аккуратно сложил туда бомбу")
      end
      if cfg.main.male == false then
        sampSendChat("/me аккуратно зачистила второй провод")
        wait(3500)
        sampSendChat("/me перерезала проводок")
        wait(3500)
        sampSendChat("/me прислушалась к устройству")
        wait(3500)
        sampSendChat("/do Механизм перестал издавать тикающие звуки.")
        wait(3500)
        sampSendChat("/do Бомба обезврежена.")
        wait(3500)
        sampSendChat("/me сложила инструменты обратно в саперный набор")
        wait(3500)
        sampSendChat("/me достала бронированный кейс и аккуратно сложила туда бомбу")
      end
    end
  },
  {
    title = 'Бомба с дистанционным управлением',
    onclick = function()
      if cfg.main.male == true then
        sampSendChat("/me достал саперный набор")
        wait(3500)
        sampSendChat("/me открыл саперный набор")
        wait(3500)
        sampSendChat("/me осмотрел взрывное устройство")
        wait(3500)
        sampSendChat("/do Определил тип взрывного устройства. Бомба с дистанционным управлением.")
        wait(3500)
        sampSendChat("/do Увидел два шурупа на блоке с механизмом.")
        wait(3500)
        sampSendChat("/me достал отвертку из саперного набора")
        wait(3500)
        sampSendChat("/me аккуратно выкручивает шуруп")
        wait(3500)
        sampSendChat("/me отодвинул крышку блока и увидел антенну")
        wait(3500)
        sampSendChat("/do Увидел красный мигающий индикатор.")
        wait(3500)
        sampSendChat("/me просмотрел путь микросхемы от антенны к детонатору")
        wait(3500)
        sampSendChat("/me увидел два провода")
        wait(3500)
        sampSendChat("/try перерезал первый провод. Индикатор перестал мигать.")
      end
      if cfg.main.male == false then
        sampSendChat("/me достала саперный набор")
        wait(3500)
        sampSendChat("/me открыла саперный набор")
        wait(3500)
        sampSendChat("/me осмотрела взрывное устройство")
        wait(3500)
        sampSendChat("/do Определила тип взрывного устройства. Бомба с Бомба с дистанционным управлением.")
        wait(3500)
        sampSendChat("/do Увидела два шурупа на блоке с механизмом.")
        wait(3500)
        sampSendChat("/me достала отвертку из саперного набора")
        wait(3500)
        sampSendChat("/me аккуратно выкручивает шуруп")
        wait(3500)
        sampSendChat("/me отодвинула крышку блока и увидел антенну")
        wait(3500)
        sampSendChat("/do Увидел красный мигающий индикатор.")
        wait(3500)
        sampSendChat("/me просмотрела путь микросхемы от антенны к детонатору")
        wait(3500)
        sampSendChat("/me увидела два провода")
        wait(3500)
        sampSendChat("/try перерезала первый провод. Индикатор перестал мигать.")
      end
    end
  },
  {
    title = 'Бомба с дистанционным управлением если {63c600}[Удачно]',
    onclick = function()
      if cfg.main.male == true then
        sampSendChat("/do Бомба обезврежена.")
        wait(3500)
        sampSendChat("/me сложил инструменты обратно в саперный набор")
        wait(3500)
        sampSendChat("/me достал бронированный кейс и аккуратно сложил туда бомбу")
      end
      if cfg.main.male == false then
        sampSendChat("/do Бомба обезврежена.")
        wait(3500)
        sampSendChat("/me сложила инструменты обратно в саперный набор")
        wait(3500)
        sampSendChat("/me достала бронированный кейс и аккуратно сложила туда бомбу")
      end
    end
  },
  {
    title = 'Бомба с дистанционным управлением если {bf0000}[Неудачно]',
    onclick = function()
      if cfg.main.male == true then
        sampSendChat("/me перерезал второй провод")
        wait(3500)
        sampSendChat("/do Индикатор перестал мигать.")
        wait(3500)
        sampSendChat("/do Бомба обезврежена.")
        wait(3500)
        sampSendChat("/me сложил инструменты обратно в саперный набор")
        wait(3500)
        sampSendChat("/me достал бронированный кейс и аккуратно сложил туда бомбу")
      end
      if cfg.main.male == false then
        sampSendChat("/me перерезала второй провод")
        wait(3500)
        sampSendChat("/do Индикатор перестал мигать.")
        wait(3500)
        sampSendChat("/do Бомба обезврежена.")
        wait(3500)
        sampSendChat("/me сложила инструменты обратно в саперный набор")
        wait(3500)
        sampSendChat("/me достала бронированный кейс и аккуратно сложил туда бомбу")
      end
    end
  },
  {
    title = 'Бомба с активационным кодом',
    onclick = function()
      if cfg.main.male == true then
        sampSendChat("/me достал саперный набор")
        wait(3500)
        sampSendChat("/me открыл саперный набор")
        wait(3500)
        sampSendChat("/me осмотрел взрывное устройство")
        wait(3500)
        sampSendChat("/do Определил тип взрывного устройства. Бомба с активационным кодом.")
        wait(3500)
        sampSendChat("/me достал из саперного набора прибор для подбора кода")
        wait(3500)
        sampSendChat("/me подключил прибор к бомбе")
        wait(3500)
        sampSendChat("/do На приборе высветилось: Ожидание получения пароля.")
        wait(3500)
        sampSendChat("/do На приборе высветилось: Пароль 5326.")
        wait(3500)
        sampSendChat("/try ввёл полученный пароль. Экран бомбы выключился")
      end
      if cfg.main.male == false then
        sampSendChat("/me достала саперный набор")
        wait(3500)
        sampSendChat("/me открыла саперный набор")
        wait(3500)
        sampSendChat("/me осмотрела взрывное устройство")
        wait(3500)
        sampSendChat("/do Определила тип взрывного устройства. Бомба с активационным кодом.")
        wait(3500)
        sampSendChat("/me достала из саперного набора прибор для подбора кода")
        wait(3500)
        sampSendChat("/me подключила прибор к бомбе")
        wait(3500)
        sampSendChat("/do На приборе высветилось: Ожидание получения пароля.")
        wait(3500)
        sampSendChat("/do На приборе высветилось: Пароль 5326.")
        wait(3500)
        sampSendChat("/try ввёла полученный пароль. Экран бомбы выключился")
      end
    end
  },
  {
    title = 'Бомба с активационным кодом если {63c600}[Удачно]',
    onclick = function()
      if cfg.main.male == true then
        sampSendChat("/do Бомба обезврежена.")
        wait(3500)
        sampSendChat("/me сложил инструменты обратно в саперный набор")
        wait(3500)
        sampSendChat("/me достал бронированный кейс и аккуратно сложил туда бомбу")
      end
      if cfg.main.male == false then
        sampSendChat("/do Бомба обезврежена.")
        wait(3500)
        sampSendChat("/me сложила инструменты обратно в саперный набор")
        wait(3500)
        sampSendChat("/me достала бронированный кейс и аккуратно сложила туда бомбу")
      end
    end
  },
  {
    title = 'Бомба с активационным кодом если {bf0000}[Неудачно]',
    onclick = function()
      if cfg.main.male == true then
        sampSendChat("/me перезагрузил(а) прибор")
        wait(3500)
        sampSendChat("/do На приборе высветилось: Ожидание получения пароля.")
        wait(3500)
        sampSendChat("/do На приборе высветилось: Пароль 3789.")
        wait(3500)
        sampSendChat("/me ввёл полученный пароль")
        wait(3500)
        sampSendChat("/Экран бомбы выключился")
        wait(3500)
        sampSendChat("/do Бомба обезврежена.")
        wait(3500)
        sampSendChat("/me сложил инструменты обратно в саперный набор")
        wait(3500)
        sampSendChat("/me достал бронированный кейс и аккуратно сложил туда бомбу")
      end
      if cfg.main.male == false then
        sampSendChat("/me перезагрузила прибор")
        wait(3500)
        sampSendChat("/do На приборе высветилось: Ожидание получения пароля.")
        wait(3500)
        sampSendChat("/do На приборе высветилось: Пароль 3789.")
        wait(3500)
        sampSendChat("/me ввёла полученный пароль")
        wait(3500)
        sampSendChat("/Экран бомбы выключился")
        wait(3500)
        sampSendChat("/do Бомба обезврежена.")
        wait(3500)
        sampSendChat("/me сложила инструменты обратно в саперный набор")
        wait(3500)
        sampSendChat("/me достала бронированный кейс и аккуратно сложила туда бомбу")
      end
    end
  }
}

function submenus_show(menu, caption, select_button, close_button, back_button)
    select_button, close_button, back_button = select_button or '»', close_button or 'x', back_button or '«'
    prev_menus = {}
    function display(menu, id, caption)
        local string_list = {}
        for i, v in ipairs(menu) do
            table.insert(string_list, type(v.submenu) == 'table' and v.title .. ' »' or v.title)
        end
        sampShowDialog(id, caption, table.concat(string_list, '\n'), select_button, (#prev_menus > 0) and back_button or close_button, sf.DIALOG_STYLE_LIST)
        repeat
            wait(0)
            local result, button, list = sampHasDialogRespond(id)
            if result then
                if button == 1 and list ~= -1 then
                    local item = menu[list + 1]
                    if type(item.submenu) == 'table' then -- submenu
                        table.insert(prev_menus, {menu = menu, caption = caption})
                        if type(item.onclick) == 'function' then
                            item.onclick(menu, list + 1, item.submenu)
                        end
                        return display(item.submenu, id + 1, item.submenu.title and item.submenu.title or item.title)
                    elseif type(item.onclick) == 'function' then
                        local result = item.onclick(menu, list + 1)
                        if not result then return result end
                        return display(menu, id, caption)
                    end
                else -- if button == 0
                    if #prev_menus > 0 then
                        local prev_menu = prev_menus[#prev_menus]
                        prev_menus[#prev_menus] = nil
                        return display(prev_menu.menu, id - 1, prev_menu.caption)
                    end
                    return false
                end
            end
        until result
    end
    return display(menu, 31337, caption or menu.title)
end

function pkmmenu(id)
  return
  {
    {
      title = "{ffffff}» Надеть наручники",
      onclick = function()
        if cfg.main.male == true then
          sampSendChat("/me заломал руки "..sampGetPlayerNickname(id).." и достал наручники")
          wait(1200)
          sampSendChat("/cuff "..id)
        end
        if cfg.main.male == false then
          sampSendChat("/me заломала руки "..sampGetPlayerNickname(id).." и достала наручники")
          wait(1200)
          sampSendChat("/cuff "..id)
        end
      end
    },
    {
      title = "{ffffff}» Вести за собой",
      onclick = function()
        if cfg.main.male == true then
          sampSendChat("/me пристегнул один из концов наручников к себе, после чего повел за собой "..sampGetPlayerNickname(id))
          wait(1200)
          sampSendChat("/follow "..id)
        end
        if cfg.main.male == false then
          sampSendChat("/me пристегнула один из концов наручников к себе, после чего повела за собой "..sampGetPlayerNickname(id))
          wait(1200)
          sampSendChat("/follow "..id)
        end
      end
    },
    {
      title = "{ffffff}» Произвести обыск",
      onclick = function()
        if cfg.main.male == true then
          sampSendChat("/me надев перчатки, провел руками по торсу")
          wait(1200)
          sampSendChat("/take "..id)
        end
        if cfg.main.male == false then
          sampSendChat("/me надев перчатки, провела руками по торсу")
          wait(1200)
          sampSendChat("/take "..id)
        end
      end
    },
    {
      title = "{ffffff}» Произвести арест",
      onclick = function()
        if cfg.main.male == true then
          sampSendChat("/me достал ключи от камеры, открыв ее")
          wait(1200)
          sampSendChat("/me затолкнул "..sampGetPlayerNickname(id).." в камеру")
          wait(1200)
          sampSendChat("/arrest "..id)
          wait(1200)
          sampSendChat("/me закрыл камеру, убрав ключи в карман")
        end
        if cfg.main.male == false then
          sampSendChat("/me достала ключи от камеры, открыв ее")
          wait(1200)
          sampSendChat("/me затолкнула "..sampGetPlayerNickname(id).." в камеру")
          wait(1200)
          sampSendChat("/arrest "..id)
          wait(1200)
          sampSendChat("/me закрыла камеру, убрав ключи в карман")
        end
      end
    },
    {
      title = '{ffffff}» Снять наручники',
      onclick = function()
        if cfg.main.male == true then
          sampSendChat("/me снял наручники с "..sampGetPlayerNickname(id))
          wait(1200)
          sampSendChat("/uncuff "..id)
        end
        if cfg.main.male == false then
          sampSendChat("/me сняла наручники с "..sampGetPlayerNickname(id))
          wait(1200)
          sampSendChat("/uncuff "..id)
        end
      end
    },
    {
      title = '{ffffff}» Выписать штраф за езду в неположенном месте',
      onclick = function()
        local tlvl = sampGetPlayerScore(id)
        local tlvl500 = tlvl*500
        if cfg.main.male == true then
          sampSendChat("/me достал бланк и ручку")
          wait(1200)
          sampSendChat("/do Бланк и ручка в руках.")
          wait(1200)
          sampSendChat("/me начинает заполнять бланк")
          wait(1200)
          sampSendChat("/do Бланк заполнен.")
          wait(1200)
          sampSendChat("/me передал бланк нарушителю")
          wait(1200)
          sampSendChat("/ticket "..id.." "..tlvl500.." Езда в неположенном месте")
        end
        if cfg.main.male == false then
          sampSendChat("/me достала бланк и ручку")
          wait(1200)
          sampSendChat("/do Бланк и ручка в руках.")
          wait(1200)
          sampSendChat("/me начинает заполнять бланк")
          wait(1200)
          sampSendChat("/do Бланк заполнен.")
          wait(1200)
          sampSendChat("/me передала бланк нарушителю")
          wait(1200)
          sampSendChat("/ticket "..id.." "..tlvl500.." Езда в неположенном месте")
        end
      end
    },
    {
      title = '{ffffff}» Выписать штраф за езду по встречной полосе',
      onclick = function()
        local tlvl = sampGetPlayerScore(id)
        local tlvl500 = tlvl*500
        if cfg.main.male == true then
          sampSendChat("/me достал бланк и ручку")
          wait(1200)
          sampSendChat("/do Бланк и ручка в руках.")
          wait(1200)
          sampSendChat("/me начинает заполнять бланк")
          wait(1200)
          sampSendChat("/do Бланк заполнен.")
          wait(1200)
          sampSendChat("/me передал бланк нарушителю")
          wait(1200)
          sampSendChat("/ticket "..id.." "..tlvl500.." Езда по встречной полосе")
        end
        if cfg.main.male == false then
          sampSendChat("/me достала бланк и ручку")
          wait(1200)
          sampSendChat("/do Бланк и ручка в руках.")
          wait(1200)
          sampSendChat("/me начинает заполнять бланк")
          wait(1200)
          sampSendChat("/do Бланк заполнен.")
          wait(1200)
          sampSendChat("/me передала бланк нарушителю")
          wait(1200)
          sampSendChat("/ticket "..id.." "..tlvl500.." Езда по встречной полосе")
        end
      end
    },
    {
      title = "{ffffff}» Выдать розыск за проникновение",
      onclick = function()
        sampSendChat("/su "..id.." 2 Проникновение на охр. территорию")
      end
    },
    {
      title = "{ffffff}» Выдать розыск за хранение наркотиков",
      onclick = function()
        sampSendChat("/su "..id.." 3 Хранение наркотиков")
      end
    },
    {
      title = "{ffffff}» Выдать розыск за хранение материалов",
      onclick = function()
        sampSendChat("/su "..id.." 3 Хранение материалов")
      end
    },
    {
      title = "{ffffff}» Выдать розыск за продажу наркотиков",
      onclick = function()
        if cfg.main.male == true then
          sampSendChat("/su "..id.." 2 Продажа наркотиков")
          wait(1200)
          sampSendChat("/me заломал руки "..sampGetPlayerNickname(id).." и достал наручники")
          wait(1200)
          sampSendChat("/cuff "..id)
        end
        if cfg.main.male == false then
          sampSendChat("/su "..id.." 2 Продажа наркотиков")
          wait(1200)
          sampSendChat("/me заломала руки "..sampGetPlayerNickname(id).." и достала наручники")
          wait(1200)
          sampSendChat("/cuff "..id)
        end
      end
    },
    {
      title = "{ffffff}» Выдать розыск за продажу ключей от камеры",
      onclick = function()
        sampSendChat("/su "..id.." 6 Продажа ключей от камеры")
      end
    },
    {
      title = "{ffffff}» Выдать розыск за вооруженное нападение на ПО",
      onclick = function()
        sampSendChat("/su "..id.. " 6 Вооруженное нападение на ПО")
      end
    },
    {
      title = "{ffffff}» Выдать розыск",
      onclick = function()
        pID = tonumber(args)
        submenus_show(sumenu(id), "{9966cc}FBI Tools {ffffff}| "..sampGetPlayerNickname(id).."["..id.."] ")
      end
    }
  }
end

function sampGetPlayerIdByNickname(nick)
    if type(nick) == "string" then
        for id = 0, 1000 do
            local _, myid = sampGetPlayerIdByCharHandle(PLAYER_PED)
            if sampIsPlayerConnected(id) or id == myid then
                local name = sampGetPlayerNickname(id)
                if nick == name then
                    return id
                end
            end
        end
    end
end

function main()
  while not isSampAvailable() do wait(1000) end
  if seshsps == 1 then
    sampAddChatMessage("{9966cc}FBI Tools {ffffff}| FBI Tools успешно загружен. Введите: /fthelp что бы получить дополнительную информацию.", -1)
    sampAddChatMessage("{9966cc}FBI Tools {ffffff}| Авторы: Sesh Jefferson, Thomas Lawson", -1)
  end
  if not doesDirectoryExist('moonloader/config/fbitools/') then createDirectory('moonloader/config/fbitools/') end
	if not doesDirectoryExist('moonloader/fbitools') then createDirectory('moonloader/fbitools') end
  if cfg == nil then
    sampAddChatMessage("{9966CC}FBI Tools {ffffff}| Отсутсвует файл конфига, создаем.", -1)
    if inicfg.save(fbitools, 'fbitools/config.ini') then
      sampAddChatMessage("{9966CC}FBI Tools {ffffff}| Файл конфига успешно создан.", -1)
      cfg = inicfg.load(nil, 'fbitools/config.ini')
    end
  end
  while not sampIsLocalPlayerSpawned() do wait(0) end
  wait(500)
  local _, myid = sampGetPlayerIdByCharHandle(playerPed)
  local name, surname = string.match(sampGetPlayerNickname(myid), '(.+)_(.+)')
  sip, sport = sampGetCurrentServerAddress()
  sampSendChat('/stats')
  while not sampIsDialogActive() do wait(0) end
  proverkk = sampGetDialogText()
  local frakc = proverkk:match('.+Организация%:%s+(.+)%s+Ранг')
  local rang = proverkk:match('.+Ранг%:%s+(.+)%s+Работа')
  rank = rang
  frac = frakc
  sampCloseCurrentDialogWithButton(1)
  print(frakc)
  print(rang)
  --[[sip, sport = sampGetCurrentServerAddress()
  if sip == '185.169.134.67' then
    sampAddChatMessage('{9966cc}FBI Tools {ffffff}| Загружены настройки для: '..sampGetCurrentServerName(), -1)
  elseif sip =='185.169.134.68' then
    sampAddChatMessage('{9966cc}FBI Tools {ffffff}| Загружены настройки для: '..sampGetCurrentServerName(), -1)
  elseif sip ~= '185.169.134.68' and sip ~= '185.169.134.68' then
    sampAddChatMessage('{9966cc}FBI Tools {ffffff}| Скрипт FBI Tools предназначен для серверов Evolve RP.', -1)
    thisScript():unload()
  end]]
  local spawned = sampIsLocalPlayerSpawned()
  Sphere.createSphere(-1984.6375732422, 106.85540008545, 27.42943572998, 50.0)-- -1984.6375732422 106.85540008545 27.42943572998 -- АВСФ [1]
  Sphere.createSphere(-2055.283203125, -84.472702026367, 35.064281463623, 50.0)-- -2055.283203125 -84.472702026367 35.064281463623 -- АШ [2]
  Sphere.createSphere(-1521.4412841797, 503.20678710938, 6.7215604782104, 40.0)-- -1521.4412841797 503.20678710938 6.7215604782104 -- СФа [3]
  Sphere.createSphere(-1702.3824462891, 684.79150390625, 25.01790618896, 30.0)-- -1702.3824462891 684.79150390625 25.017906188965 -- Пост В СФПД [4]
  Sphere.createSphere(-1574.4406738281, 662.24047851563, 7.3254537582397, 20.0)-- -1574.4406738281 662.24047851563 7.3254537582397 Пост А СФПД [5]
  Sphere.createSphere(-2013.1629638672, 464.77380371094, 35.313331604004, 30.0)-- -2013.1629638672 464.77380371094 35.313331604004 -- СФн [6]
  Sphere.createSphere(-1749.7822265625, -591.34033203125, 16.62273979187, 100.0)-- -1749.7822265625 -591.34033203125 16.62273979187 -- Тоннель [7]
  Sphere.createSphere(1481.77734375, -1739.9536132813, 13.546875, 70.0)-- 1481.77734375 -1739.9536132813 13.546875 -- Мэрия [8]
  Sphere.createSphere(-2448.3591308594, 725.09326171875, 34.756977081299, 70.0)-- -2448.3591308594 725.09326171875 34.756977081299 -- Хот-Доги [9]
  Sphere.createSphere(1186.5642089844, -1322.2257080078,13.098788261414, 50.0)-- 1186.5642089844 -1322.2257080078 13.098788261414 -- Больница ЛС [10]
  Sphere.createSphere(1195.8181152344, -1741.1024169922, 13.131011962891, 70.0)-- 1195.8181152344 -1741.1024169922 13.131011962891 -- АВ ЛС [11]
  Sphere.createSphere(1667.1462402344, -768.31890869141, 54.092594146729, 70.0)-- 1667.1462402344 -768.31890869141 54.092594146729 -- Мост ЛС-ЛВ [12]
  Sphere.createSphere(1820.5036621094, 816.41632080078, 10.8203125, 70.0)-- 1820.5036621094 816.41632080078 10.8203125 -- Патрульный пост А LVPD [Мост ЛВ-ЛС] [13]
  Sphere.createSphere(1155.6971435547, 831.9443359375, 10.409364700317, 80.0)-- 1155.6971435547 831.9443359375 10.409364700317 Патрульный пост В LVPD [Развертка] [14]
  Sphere.createSphere(2033.3028564453, 1007.163269043, 10.8203125, 50.0)-- 2033.3028564453 1007.163269043 10.8203125 Постовой В LVPD [4 Дракона] [15]
  Sphere.createSphere(2824.7353515625, 1292.9085693359, 10.764576911926, 50.0)-- 2824.7353515625 1292.9085693359 10.764576911926 Постовой А LVPD [АВЛВ] [16]
  Sphere.createSphere(2180.99609375, 1676.2248535156, 11.060985565186, 50.0)-- 2180.99609375 1676.2248535156 11.060985565186 Постовой В LVPD [Каллигула] [17]
  Sphere.createSphere(1727.3302001953, 1618.9171142578, 9.8169927597046, 50.0)-- 1727.3302001953 1618.9171142578 9.8169927597046 -- Пост С LVPD [18]
  Sphere.createSphere(1545.6296386719, -1631.2828369141, 13.3828125, 50.0)-- 1545.6296386719 -1631.2828369141 13.3828125 -- КПП ЛСПД [19]
  Sphere.createSphere(2753.5388183594, -2432.2268066406, 13.64318561554, 80.0)-- 2753.5388183594 -2432.2268066406 13.64318561554 -- Порт ЛС[20]
  Sphere.createSphere(2293.4145507813, -1584.8774414063, 3.5703411102295, 670.0)--  2293.4145507813 -1584.8774414063 3.5703411102295 -- Патруль гетто [21]
  Sphere.createSphere(186.95843505859, 1901.0294189453, 17.640625, 300.0)-- 186.95843505859 1901.0294189453 17.640625 -- Патруль ЛВа [22]
  Sphere.createSphere(-422, -1195, 60, 500.0)-- -422 -1195 60 --Юрисдикция ЛС - СФ [23]
  Sphere.createSphere(1644, -25, 36, 300.0)-- 1644 -25 36 --Юрисдикция ЛС - ЛВ [24]
  Sphere.createSphere(413, 625, 18, 300.0)-- 413 625 18 Юрисдикция ЛС- ЛВ 2 [25]
  Sphere.createSphere(-129, 518, 8, 300.0)-- -129 518 8 Юрисдикция ЛС - ЛВ 3 [26]
  Sphere.createSphere(-1003, 1285, 40, 300.0)-- -1003 1285 40 Юрисдикция СФ - ЛВ [27]
  Sphere.createSphere(-2126, 2654, 53, 300.0)-- -2126 2654 53 Юрисдикция СФ - ЛВ 2 [28]
  Sphere.createSphere(-1006, -442, 36, 300.0)-- -1006 -442 36 Юрисдикция ЛС - СФ 2 [29]
  Sphere.createSphere(-1126, -2574, 72, 300.0)-- -1126 -2574 72 Юрисдикция ЛС - СФ 3 [30]
  Sphere.createSphere(-1248, -2867, 64, 300.0)-- -1248 -2867 64 Юрисдикция ЛС- СФ 4 [31]
  sampRegisterChatCommand('oop', oop)
  sampRegisterChatCommand('tazer', tazer)
  sampRegisterChatCommand('keys', keys)
  sampRegisterChatCommand('pr', pr)
  sampRegisterChatCommand('su', su)
  sampRegisterChatCommand('ssu', ssu)
  sampRegisterChatCommand("fthelp", fthelp)
  sampRegisterChatCommand('cput', cput)
  sampRegisterChatCommand('ceject', ceject)
  sampRegisterChatCommand('tl', tl)
  sampRegisterChatCommand('st', st)
  sampRegisterChatCommand('deject', deject)
  sampRegisterChatCommand("rh", rh)
  sampRegisterChatCommand('gr', gr)
  sampRegisterChatCommand('warn', warn)
  sampRegisterChatCommand('df', df)
  sampRegisterChatCommand('ms', ms)
  sampRegisterChatCommand('ar', ar)
  sampRegisterChatCommand('kmdc', kmdc)
  sampRegisterChatCommand('ftazer', ftazer)
  sampRegisterChatCommand('ftreload', ftreload)
  sampRegisterChatCommand('hrt', hrt)
  sampRegisterChatCommand('nwanted', nwanted)
  sampRegisterChatCommand('nclear', nclear)
  sampRegisterChatCommand('fvz', fvz)
  sampRegisterChatCommand('gpc', gc)
  sampRegisterChatCommand('fbd', fbd)
  sampRegisterChatCommand('fstate', fstate)
  sampRegisterChatCommand('fhud', fhud)
  sampRegisterChatCommand('ticket', ticket)
  sampRegisterChatCommand('blg', blg)
  sampRegisterChatCommand('ft', ft)
  if sampIsChatCommandDefined('r') then sampUnregisterChatCommand('r') end
  if sampIsChatCommandDefined('f') then sampUnregisterChatCommand('f') end
  if sampIsChatCommandDefined('ask') then sampUnregisterChatCommand('ask') end
  sampRegisterChatCommand('r', r)
  sampRegisterChatCommand('f', f)
	sampRegisterChatCommand('yk', yk)
  sampRegisterChatCommand('fp', fp)
  sampRegisterChatCommand('ak', ak)
  sampRegisterChatCommand('shp', shp)
  sampRegisterChatCommand('fyk', fyk)
  sampRegisterChatCommand('ffp', ffp)
  sampRegisterChatCommand('fak', fak)
  sampRegisterChatCommand('fshp', fshp)
  sampRegisterChatCommand("fst", fst)
  sampRegisterChatCommand("fsw", fsw)
  sampRegisterChatCommand('cc', cc)
  sampRegisterChatCommand('dkld', dkld)
  sampRegisterChatCommand('mcheck', mcheck)
  sampRegisterChatCommand('ftinfo', ftinfo)
  sampRegisterChatCommand('hudpos', hudpos)
  sampfuncsRegisterConsoleCommand('gppc', gppc)
  sampfuncsRegisterConsoleCommand('did', did)
  local font = renderCreateFont("Tahoma", 14, 5)
	ykf()
  fpf()
  akf()
  shpf()
  mcheckf()
  update()
	for k, v in pairs(tBindList) do
		 rkeys.registerHotKey(v.v, true, onHotKey)
	end
  while true do wait(0)
    imgui.Process = first_window.v or second_window.v or third_window.v or command_window.v or bMainWindow.v or ykwindow.v or fpwindow.v or akwindow.v or shpwindow.v or ftthelp.v
    local myskin = getCharModel(PLAYER_PED)
    if myskin == 280 or myskin == 265 or myskin == 266 or myskin == 267 or myskin == 281 or myskin == 282 or myskin == 288 or myskin == 284 or myskin == 285 or myskin == 304 or myskin == 305 or myskin == 306 or myskin == 307 or myskin == 309 or myskin == 283 or myskin == 286 or myskin == 287 or myskin == 252 or myskin == 279 or myskin == 163 or myskin == 164 or myskin == 165 or myskin == 166 then
      rabden = true
    end
    if nikk == nil then
      if aroop == true then aroop = false end
      if zaproop == true then zaproop = false end
      if dmoop == true then dmoop = false end
    end
    if changetextpos then
      sampToggleCursor(true)
      local CPX, CPY = getCursorPos()
      cfg.main.posX = CPX
      cfg.main.posY = CPY
    end
    if isKeyJustPressed(key.VK_LBUTTON) and changetextpos then
      sampToggleCursor(false)
      changetextpos = false
    end
    local myhp = getCharHealth(PLAYER_PED)
    if myhp == 0 then
      if rabden == true then
        if cfg.main.clist ~= nil then
          wait(3000)
          sampSendChat('/clist '..cfg.main.clist)
        end
      end
    end
    if cfg == nil then
      sampAddChatMessage("{9966CC}FBI Tools {ffffff}| Отсутсвует файл конфига, создаем.", -1)
      if inicfg.save(fbitools, 'fbitools/config.ini') then
        sampAddChatMessage("{9966CC}FBI Tools {ffffff}| Файл конфига успешно создан.", -1)
        cfg = inicfg.load(nil, 'fbitools/config.ini')
      end
    end
    if cfg.main.hud == true then
      first_window.v = true
      imgui.ShowCursor = false
    end
    if cfg.main.hud == false then
      first_window.v = false
      imgui.ShowCursor = false
    end
    if second_window.v == true then
      imgui.ShowCursor = true
    end
    if third_window.v == true then
      imgui.LockPlayer = true
      imgui.ShowCursor = true
    end
    if command_window.v == true then
      imgui.LockPlayer = true
      imgui.ShowCursor = true
    end
		if ykwindow.v == true then
			imgui.ShowCursor = true
		end
    if fpwindow.v == true then
      imgui.ShowCursor = true
    end
    if akwindow.v == true then
      imgui.ShowCursor = true
    end
    if shpwindow.v == true then
      imgui.ShowCursor = true
    end
    if wasKeyPressed(cfg.keys.fastmenu) and not sampIsDialogActive() and not sampIsChatInputActive() then
      if cfg.main.tar == nil then
        lua_thread.create(function()
          submenus_show(fthmenu, "{9966CC}FBI Tools {ffffff}| Fast Menu")
        end)
      elseif cfg.main.tar ~= nil then
        lua_thread.create(function()
          submenus_show(fthmenur, "{9966CC}FBI Tools {ffffff}| Fast Menu")
        end)
      end
    end
    if wasKeyPressed(cfg.keys.tazer) and not sampIsChatInputActive() and not sampIsDialogActive() then
      sampSendChat("/tazer")
      wait(1200)
    end
    if wasKeyPressed(cfg.keys.oopda) then
      if zaproop == true then
        sampSendChat('/d Mayor, дело на имя '..nikk..' рассмотрению не подлежит, ООП.')
        nikk = nil
        zaproop = false
      end
      if dmoop == true then
        if frac == 'FBI' or frac == 'LSPD' or frac == 'SFPD' or frac == 'LVPD' then
          if rank == 'Кадет' or rank == 'Офицер' or rank == 'Мл.Сержант' or  rank == 'Сержант' or  rank == 'Прапорщик' then
            if cfg.main.tar == nil then
              sampSendChat('/r Дело на имя '..nikk:gsub('_', ' ')..' рассмотрению не подлежит, ООП, объявите.')
              dmoop = false
              nikk = false
            else
              sampSendChat('/r '..cfg.main.tar..' Дело на имя '..nikk:gsub('_', ' ')..' рассмотрению не подлежит, ООП, объявите.')
              dmoop = false
              nikk = false
            end
          else
            sampSendChat('/d Mayor, дело на имя '..nikk:gsub('_', ' ')..' рассмотрению не подлежит, ООП КПЗ LSPD.')
            dmoop = false
            nikk = false
          end
        end
      end
      if aroop == true then
        if frac == 'FBI' or frac == 'LSPD' or frac == 'SFPD' or frac == 'LVPD' then
          if rank == 'Кадет' or rank == 'Офицер' or rank == 'Мл.Сержант' or  rank == 'Сержант' or  rank == 'Прапорщик' then
            if cfg.main.tar == nil then
              sampSendChat('/r Дело на имя '..nikk:gsub('_', ' ')..' рассмотрению не подлежит, ООП, объявите.')
              aroop = false
              nikk = false
            else
              sampSendChat('/r '..cfg.main.tar..' Дело на имя '..nikk:gsub('_', ' ')..' рассмотрению не подлежит, ООП, объявите.')
              aroop = false
              nikk = false
            end
          else
            gint = getActiveInterior()
            if gint == 21 then
              sampSendChat("/d Mayor, дело на имя "..nikk:gsub('_', ' ').." рассмотрению не подлежит, ООП КПЗ LSPD.")
              aroop = false
              nikk = false
            elseif gint == 10 then
              sampSendChat("/d Mayor, дело на имя "..nikk:gsub('_', ' ').." рассмотрению не подлежит, ООП КПЗ SFPD.")
              aroop = false
              nikk = false
            elseif gint == 3 then
              sampSendChat("/d Mayor, дело на имя "..nikk:gsub('_', ' ').." рассмотрению не подлежит, ООП КПЗ LVPD.")
              aroop = false
              nikk = false
            elseif gint ~= 21 and gint ~= 10 and gint ~= 3 then
              sampSendChat("/d Mayor, дело на имя "..nikk:gsub('_', ' ').." рассмотрению не подлежит, ООП.")
              aroop = false
              nikk = false
            end
          end
        end
      end
    end
    if wasKeyPressed(cfg.keys.oopnet) then
      if dmoop == true then
        dmoop = false
        nikk = nil
        sampAddChatMessage("{9966cc}FBI Tools {ffffff}| Рассмотр дела отменен.", -1)
      end
      if zaproop == true then
        zaproop = false
        nikk = nil
        sampAddChatMessage("{9966cc}FBI Tools {ffffff}| Рассмотр дела отменен.", -1)
      end
      if aroop == true then
        aroop = false
        nikk = nil
        sampAddChatMessage("{9966cc}FBI Tools {ffffff}| Рассмотр дела отменен.", -1)
      end
    end
    local valid, ped = getCharPlayerIsTargeting(PLAYER_HANDLE)
    if valid and doesCharExist(ped) then
      local result, id = sampGetPlayerIdByCharHandle(ped)
      if result and wasKeyPressed(key.VK_Z) then
        submenus_show(pkmmenu(id), "{9966cc}FBI Tools {ffffff}| "..sampGetPlayerNickname(id).."["..id.."] ")
      end
    end
      local result, button, list, input = sampHasDialogRespond(1385)
      local result1, button, list, input = sampHasDialogRespond(1386)
      local result2, button, list, input = sampHasDialogRespond(1387)
      local result3, button, list, input = sampHasDialogRespond(1388)
      local result4, button, list, input = sampHasDialogRespond(1389)
      local result5, button, list, input = sampHasDialogRespond(1390)
      local result6, button, list, input = sampHasDialogRespond(1391)
      local result7, button, list, input = sampHasDialogRespond(1392)
      local result8, button, list, input = sampHasDialogRespond(1393)
      local result9, button, list, input = sampHasDialogRespond(1394)
      local result10, button, list, input = sampHasDialogRespond(1395)
      local result11, button, list, input = sampHasDialogRespond(1396)
      local result12, button, list, input = sampHasDialogRespond(1397)
      local result13, button, list, input = sampHasDialogRespond(1398)
      local result14, button, list, input = sampHasDialogRespond(1399)
      local result15, button, list, input = sampHasDialogRespond(1400)
      local result16, button, list, input = sampHasDialogRespond(1401)
      local result17, button, list, input = sampHasDialogRespond(1402)
      local result18, button, list, input = sampHasDialogRespond(1403)
      local result19, button, list, input = sampHasDialogRespond(1404)
      local result20, button, list, input = sampHasDialogRespond(1405)
      local result21, button, list, input = sampHasDialogRespond(1406)
      local _, myid = sampGetPlayerIdByCharHandle(PLAYER_PED)
      if result19 then
        if button == 1 then
          sampSendChat('/d LSPD, пересекаю вашу юрисдикцию, погоня.')
        else
          sampSendChat('/d SFPD, пересекаю вашу юрисдикцию, погоня.')
        end
      end
      if result20 then
        if button == 1 then
          sampSendChat('/d LSPD, пересекаю вашу юрисдикцию, погоня.')
        else
          sampSendChat('/d LVPD, пересекаю вашу юрисдикцию, погоня.')
        end
      end
      if result21 then
        if button == 1 then
          sampSendChat('/d SFPD, пересекаю вашу юрисдикцию, погоня.')
        else
          sampSendChat('/d LVPD, пересекаю вашу юрисдикцию, погоня.')
        end
      end
      if result then
        if button == 1 then
          if cfg.main.male == true then
            sampSendChat("/r Переоделся в одежду гражданского. Причина: "..input)
            wait(1200)
            sampSendChat("/rb "..myid)
          end
          if cfg.main.male == false then
            sampSendChat("/r Переоделась в одежду гражданского. Причина: "..input)
            wait(1200)
            sampSendChat("/rb "..myid)
          end
        end
      end
      if result1 then
        if button == 1 then
          if cfg.main.male == true then
            sampSendChat("/r Переоделся в форму полицейского. Причина: "..input)
            wait(1200)
            sampSendChat("/rb "..myid)
          end
          if cfg.main.male == false then
            sampSendChat("/r Переоделась в форму полицейского. Причина: "..input)
            wait(1200)
            sampSendChat("/rb "..myid)
          end
        end
      end
      if result2 then
        if button == 1 then
          if cfg.main.male == true then
            sampSendChat("/r Переоделся в форму армейского. Причина: "..input)
            wait(1200)
            sampSendChat("/rb "..myid)
          end
          if cfg.main.male == false then
            sampSendChat("/r Переоделась в форму армейского. Причина: "..input)
            wait(1200)
            sampSendChat("/rb "..myid)
          end
        end
      end
      if result3 then
        if button == 1 then
          if cfg.main.male == true then
            sampSendChat("/r Переоделся в форму медика. Причина: "..input)
            wait(1200)
            sampSendChat("/rb "..myid)
          end
          if cfg.main.male == false then
             sampSendChat("/r Переоделась в форму медика. Причина: "..input)
            wait(1200)
            sampSendChat("/rb "..myid)
          end
        end
      end
      if result4 then
        if button == 1 then
          if cfg.main.male == true then
            sampSendChat("/r Переоделся в форму работника мэрии. Причина: "..input)
            wait(1200)
            sampSendChat("/rb "..myid)
          end
          if cfg.main.male == false then
              sampSendChat("/r Переоделась в форму работника мэрии. Причина: "..input)
            wait(1200)
            sampSendChat("/rb "..myid)
          end
        end
      end
      if result5 then
        if button == 1 then
          if cfg.main.male == true then
            sampSendChat("/r Переоделся в форму работника автошколы. Причина: "..input)
            wait(1200)
            sampSendChat("/rb "..myid)
          end
          if cfg.main.male == false then
              sampSendChat("/r Переоделась в форму работника автошколы. Причина: "..input)
            wait(1200)
            sampSendChat("/rb "..myid)
          end
        end
      end
      if result6 then
        if button == 1 then
          if cfg.main.male == true then
            sampSendChat("/r Переоделся в форму работника новостей. Причина: "..input)
            wait(1200)
            sampSendChat("/rb "..myid)
          end
          if cfg.main.male == false then
            sampSendChat("/r Переоделась в форму работника новостей. Причина: "..input)
            wait(1200)
            sampSendChat("/rb "..myid)
          end
        end
      end
      if result7 then
        if button == 1 then
          if cfg.main.male == true then
            sampSendChat("/r Переоделся в форму ЧОП LCN. Причина: "..input)
            wait(1200)
            sampSendChat("/rb "..myid)
          end
          if cfg.main.male == false then
              sampSendChat("/r Переоделась в форму ЧОП LCN. Причина: "..input)
            wait(1200)
            sampSendChat("/rb "..myid)
          end
        end
      end
      if result8 then
        if button == 1 then
          if cfg.main.male == true then
            sampSendChat("/r Переоделся в форму ЧОП Yakuza. Причина: "..input)
            wait(1200)
            sampSendChat("/rb "..myid)
          end
          if cfg.main.male == false then
            sampSendChat("/r Переоделась в форму ЧОП Yakuza. Причина: "..input)
            wait(1200)
            sampSendChat("/rb "..myid)
          end
        end
      end
      if result9 then
        if button == 1 then
          if cfg.main.male == true then
            sampSendChat("/r Переоделся в форму ЧОП РМ. Причина: "..input)
            wait(1200)
            sampSendChat("/rb "..myid)
          end
          if cfg.main.male == false then
            sampSendChat("/r Переоделась в форму ЧОП РМ. Причина: "..input)
            wait(1200)
            sampSendChat("/rb "..myid)
          end
        end
      end
      if result10 then
        if button == 1 then
          if cfg.main.male == true then
            sampSendChat("/r Переоделся в форму БК Rifa. Причина: "..input)
            wait(1200)
            sampSendChat("/rb "..myid)
          end
          if cfg.main.male == false then
              sampSendChat("/r Переоделась в форму БК Rifa. Причина: "..input)
            wait(1200)
            sampSendChat("/rb "..myid)
          end
        end
      end
      if result11 then
        if button == 1 then
          if cfg.main.male == true then
            sampSendChat("/r Переоделся в форму БК Grove. Причина: "..input)
            wait(1200)
            sampSendChat("/rb "..myid)
          end
          if cfg.main.male == false then
             sampSendChat("/r Переоделась в форму БК Grove. Причина: "..input)
            wait(1200)
            sampSendChat("/rb "..myid)
          end
        end
      end
      if result12 then
        if button == 1 then
          if cfg.main.male == true then
            sampSendChat("/r Переоделся в форму БК Ballas. Причина: "..input)
            wait(1200)
            sampSendChat("/rb "..myid)
          end
          if cfg.main.male == false then
              sampSendChat("/r Переоделась в форму БК Ballas. Причина: "..input)
            wait(1200)
            sampSendChat("/rb "..myid)
          end
        end
      end
      if result13 then
        if button == 1 then
          if cfg.main.male == true then
            sampSendChat("/r Переоделся в форму БК Vagos. Причина: "..input)
            wait(1200)
            sampSendChat("/rb "..myid)
          end
          if cfg.main.male == false then
             sampSendChat("/r Переоделась в форму БК Vagos. Причина: "..input)
            wait(1200)
            sampSendChat("/rb "..myid)
          end
        end
      end
      if result14 then
        if button == 1 then
          if cfg.main.male == true then
            sampSendChat("/r Переоделся в форму БК Aztec. Причина: "..input)
            wait(1200)
            sampSendChat("/rb "..myid)
          end
          if cfg.main.male == false then
             sampSendChat("/r Переоделся в форму БК Aztec. Причина: "..input)
            wait(1200)
            sampSendChat("/rb "..myid)
          end
        end
      end
      if result15 then
        if button == 1 then
          if cfg.main.male == true then
            sampSendChat("/r Переоделся в одежду байкеров. Причина: "..input)
            wait(1200)
            sampSendChat("/rb "..myid)
          end
          if cfg.main.male == false then
             sampSendChat("/r Переоделась в одежду байкеров. Причина: "..input)
            wait(1200)
            sampSendChat("/rb "..myid)
          end
        end
      end
      if result16 then
        if button == 1 then
          sampSendChat("/r Нужна эвакуация в квадрате "..kvadrat().." на "..input)
        end
      end
      if result17 then
        if button == 1 then
          sampSendChat("/r "..cfg.main.tar.." Нужна эвакуация в квадрате "..kvadrat().." на "..input)
        end
      end
      if result18 then
        if button == 1 then
          sampSendChat("/d "..input..", старшие отпишите пожалуйста на п."..myid)
        end
      end
  end
end

function update()
	local fpath = os.getenv('TEMP') .. '\\ftulsupd.json'
	downloadUrlToFile('https://raw.githubusercontent.com/WhackerH/kirya/master/ftulsupd.json', fpath, function(id, status, p1, p2)
		if status == dlstatus.STATUS_ENDDOWNLOADDATA then
		local f = io.open(fpath, 'r')
		if f then
			local info = decodeJson(f:read('*a'))
			updatelink = info.updateurl
			if info and info.latest then
				version = tonumber(info.latest)
				if version > tonumber(thisScript().version) then
					lua_thread.create(goupdate)
        else
          sampAddChatMessage('{9966CC}FBI Tools{ffffff} | Обновлений скрипта не обнаружено. Приятной игры.', -1)
          update = false
				end
			end
		end
	end
end)
end
--скачивание актуальной версии
function goupdate()
sampAddChatMessage('{9966CC}FBI Tools{ffffff} | Обнаружено обновление. Обновляюсь..', -1)
sampAddChatMessage('{9966CC}FBI Tools{ffffff} | Текущая версия: {9966cc}'..thisScript().version.."{ffffff}. Новая версия: {9966cc}"..version, -1)
wait(300)
downloadUrlToFile(updatelink, thisScript().path, function(id3, status1, p13, p23)
	if status1 == dlstatus.STATUS_ENDDOWNLOADDATA then
	sampAddChatMessage('{9966CC}FBI Tools{ffffff} | Обновление завершено! Подробнее об обновлении - {9966cc}/ftinfo.', -1)
	thisScript():reload()
end
end)
end

function apply_custom_style()
  imgui.SwitchContext()
  local style = imgui.GetStyle()
  local colors = style.Colors
  local clr = imgui.Col
  local ImVec4 = imgui.ImVec4

  style.WindowRounding = 2.0
  style.WindowTitleAlign = imgui.ImVec2(0.5, 0.84)
  style.ChildWindowRounding = 2.0
  style.FrameRounding = 2.0
  style.ItemSpacing = imgui.ImVec2(5.0, 4.0)
  style.ScrollbarSize = 13.0
  style.ScrollbarRounding = 0
  style.GrabMinSize = 8.0
  style.GrabRounding = 1.0

  colors[clr.Text]                   = ImVec4(1.00, 1.00, 1.00, 1.00)
  colors[clr.TextDisabled]           = ImVec4(0.50, 0.50, 0.50, 1.00)
  colors[clr.WindowBg]               = ImVec4(0.06, 0.06, 0.06, 0.94)
  colors[clr.ChildWindowBg]          = ImVec4(1.00, 1.00, 1.00, 0.00)
  colors[clr.PopupBg]                = ImVec4(0.08, 0.08, 0.08, 0.94)
  colors[clr.ComboBg]                = colors[clr.PopupBg]
  colors[clr.Border]                 = ImVec4(0.43, 0.43, 0.50, 0.50)
  colors[clr.BorderShadow]           = ImVec4(0.00, 0.00, 0.00, 0.00)
  colors[clr.FrameBg]                = ImVec4(0.16, 0.29, 0.48, 0.54)
  colors[clr.FrameBgHovered]         = ImVec4(0.26, 0.59, 0.98, 0.40)
  colors[clr.FrameBgActive]          = ImVec4(0.26, 0.59, 0.98, 0.67)
  colors[clr.TitleBg]                = ImVec4(0.04, 0.04, 0.04, 1.00)
  colors[clr.TitleBgActive]          = ImVec4(0.16, 0.29, 0.48, 1.00)
  colors[clr.TitleBgCollapsed]       = ImVec4(0.00, 0.00, 0.00, 0.51)
  colors[clr.MenuBarBg]              = ImVec4(0.14, 0.14, 0.14, 1.00)
  colors[clr.ScrollbarBg]            = ImVec4(0.02, 0.02, 0.02, 0.53)
  colors[clr.ScrollbarGrab]          = ImVec4(0.31, 0.31, 0.31, 1.00)
  colors[clr.ScrollbarGrabHovered]   = ImVec4(0.41, 0.41, 0.41, 1.00)
  colors[clr.ScrollbarGrabActive]    = ImVec4(0.51, 0.51, 0.51, 1.00)
  colors[clr.CheckMark]              = ImVec4(0.26, 0.59, 0.98, 1.00)
  colors[clr.SliderGrab]             = ImVec4(0.24, 0.52, 0.88, 1.00)
  colors[clr.SliderGrabActive]       = ImVec4(0.26, 0.59, 0.98, 1.00)
  colors[clr.Button]                 = ImVec4(0.26, 0.59, 0.98, 0.40)
  colors[clr.ButtonHovered]          = ImVec4(0.26, 0.59, 0.98, 1.00)
  colors[clr.ButtonActive]           = ImVec4(0.06, 0.53, 0.98, 1.00)
  colors[clr.Header]                 = ImVec4(0.26, 0.59, 0.98, 0.31)
  colors[clr.HeaderHovered]          = ImVec4(0.26, 0.59, 0.98, 0.80)
  colors[clr.HeaderActive]           = ImVec4(0.26, 0.59, 0.98, 1.00)
  colors[clr.Separator]              = colors[clr.Border]
  colors[clr.SeparatorHovered]       = ImVec4(0.26, 0.59, 0.98, 0.78)
  colors[clr.SeparatorActive]        = ImVec4(0.26, 0.59, 0.98, 1.00)
  colors[clr.ResizeGrip]             = ImVec4(0.26, 0.59, 0.98, 0.25)
  colors[clr.ResizeGripHovered]      = ImVec4(0.26, 0.59, 0.98, 0.67)
  colors[clr.ResizeGripActive]       = ImVec4(0.26, 0.59, 0.98, 0.95)
  colors[clr.CloseButton]            = ImVec4(0.41, 0.41, 0.41, 0.50)
  colors[clr.CloseButtonHovered]     = ImVec4(0.98, 0.39, 0.36, 1.00)
  colors[clr.CloseButtonActive]      = ImVec4(0.98, 0.39, 0.36, 1.00)
  colors[clr.PlotLines]              = ImVec4(0.61, 0.61, 0.61, 1.00)
  colors[clr.PlotLinesHovered]       = ImVec4(1.00, 0.43, 0.35, 1.00)
  colors[clr.PlotHistogram]          = ImVec4(0.90, 0.70, 0.00, 1.00)
  colors[clr.PlotHistogramHovered]   = ImVec4(1.00, 0.60, 0.00, 1.00)
  colors[clr.TextSelectedBg]         = ImVec4(0.26, 0.59, 0.98, 0.35)
  colors[clr.ModalWindowDarkening]   = ImVec4(0.80, 0.80, 0.80, 0.35)
end
apply_custom_style()

do

function imgui.OnDrawFrame()
	local tLastKeys = {}
  if shpwindow.v then
    local iScreenWidth, iScreenHeight = getScreenResolution()
    imgui.SetNextWindowPos(imgui.ImVec2(iScreenWidth / 2, iScreenHeight / 2), imgui.Cond.FirstUseEver, imgui.ImVec2(0.5, 0.5))
    imgui.SetNextWindowSize(imgui.ImVec2(1250, 600), imgui.Cond.FirstUseEver)
    imgui.Begin(u8('FBI Tools | Шпора'), shpwindow)
    newTexture = imgui.CreateTextureFromFile(getWorkingDirectory()..'\\fbitools\\salo.png')
    imgui.Image(newTexture, imgui.ImVec2(300, 211))
    for line in io.lines('moonloader\\fbitools\\shp.txt') do
      imgui.Text(u8(line))
    end
    imgui.End()
  end
  if akwindow.v then
    local iScreenWidth, iScreenHeight = getScreenResolution()
    imgui.SetNextWindowPos(imgui.ImVec2(iScreenWidth / 2, iScreenHeight / 2), imgui.Cond.FirstUseEver, imgui.ImVec2(0.5, 0.5))
    imgui.SetNextWindowSize(imgui.ImVec2(1250, 600), imgui.Cond.FirstUseEver)
    imgui.Begin(u8('FBI Tools | Административный кодекс'), akwindow)
    for line in io.lines('moonloader\\fbitools\\ak.txt') do
      imgui.Text(u8(line))
    end
    imgui.End()
  end
  if fpwindow.v then
    local iScreenWidth, iScreenHeight = getScreenResolution()
    imgui.SetNextWindowPos(imgui.ImVec2(iScreenWidth / 2, iScreenHeight / 2), imgui.Cond.FirstUseEver, imgui.ImVec2(0.5, 0.5))
    imgui.SetNextWindowSize(imgui.ImVec2(1250, 600), imgui.Cond.FirstUseEver)
    imgui.Begin(u8('FBI Tools | Федеральное постановление'), fpwindow)
    for line in io.lines('moonloader\\fbitools\\fp.txt') do
      imgui.Text(u8(line))
    end
    imgui.End()
  end
	if ykwindow.v then
		local iScreenWidth, iScreenHeight = getScreenResolution()
		imgui.SetNextWindowPos(imgui.ImVec2(iScreenWidth / 2, iScreenHeight / 2), imgui.Cond.FirstUseEver, imgui.ImVec2(0.5, 0.5))
		imgui.SetNextWindowSize(imgui.ImVec2(1250, 600), imgui.Cond.FirstUseEver)
		imgui.Begin(u8('FBI Tools | Уголовный кодекс'), ykwindow)
		for line in io.lines('moonloader\\fbitools\\yk.txt') do
  		imgui.Text(u8(line))
		end
		imgui.End()
	end
	if bMainWindow.v then
		local iScreenWidth, iScreenHeight = getScreenResolution()
		imgui.SetNextWindowPos(imgui.ImVec2(iScreenWidth / 2, iScreenHeight / 2), imgui.Cond.FirstUseEver, imgui.ImVec2(0.5, 0.5))
		imgui.SetNextWindowSize(imgui.ImVec2(800, 525), imgui.Cond.FirstUseEver)
		imgui.Begin(u8("FBI Tools | Биндер##main"), bMainWindow, imgui.WindowFlags.NoCollapse + imgui.WindowFlags.NoResize)
		imgui.Text(u8'Для корректной работы биндера рекомендуется перезагрузить скрипт после изменения настроек биндера.')
		imgui.Separator()
		   imgui.BeginChild("##bindlist", imgui.ImVec2(795, 442))
		   for k, v in ipairs(tBindList) do
		      if hk.HotKey("##HK" .. k, v, tLastKeys, 100) then
		         if not rkeys.isHotKeyDefined(v.v) then
		            if rkeys.isHotKeyDefined(tLastKeys.v) then
		               rkeys.unRegisterHotKey(tLastKeys.v)
		            end
		            rkeys.registerHotKey(v.v, true, onHotKey)
		         end
		      end
		      imgui.SameLine()
		      if tEditData.id ~= k then
		         local sText = v.text:gsub("%[enter%]$", "")
		         imgui.BeginChild("##cliclzone" .. k, imgui.ImVec2(500, 21))
		         imgui.AlignTextToFramePadding()
		         if sText:len() > 0 then
		            imgui.Text(u8(sText))
		         else
		            imgui.TextDisabled(u8("Пустое сообщение ..."))
		         end
		         imgui.EndChild()
		         if imgui.IsItemClicked() then
		            sInputEdit.v = sText:len() > 0 and u8(sText) or ""
		            bIsEnterEdit.v = string.match(v.text, "(.)%[enter%]$") ~= nil
		            tEditData.id = k
		            tEditData.inputActve = true
		         end
		      else
		         imgui.PushAllowKeyboardFocus(false)
		         imgui.PushItemWidth(500)
		         local save = imgui.InputText("##Edit" .. k, sInputEdit, imgui.InputTextFlags.EnterReturnsTrue)
		         imgui.PopItemWidth()
		         imgui.PopAllowKeyboardFocus()
		         imgui.SameLine()
		         imgui.Checkbox(u8("Ввод") .. "##editCH" .. k, bIsEnterEdit)
		         if save then
		            tBindList[tEditData.id].text = u8:decode(sInputEdit.v) .. (bIsEnterEdit.v and "[enter]" or "")
		            tEditData.id = -1
		         end
		         if tEditData.inputActve then
		            tEditData.inputActve = false
		            imgui.SetKeyboardFocusHere(-1)
		         end
		      end
		   end
		   imgui.EndChild()
		   imgui.Separator()
		   if imgui.Button(u8"Добавить клавишу") then
		      tBindList[#tBindList + 1] = {text = "", v = {}}
		   end
		   imgui.SameLine()
		   if imgui.Button(u8"Перезагрузить скрипт") then
		    	showCursor(false)
      		thisScript():reload()
       end
		imgui.End()
	end
  if command_window.v then
    local ticket = imgui.ImBool(cfg.commands.ticket)
    local cput =  imgui.ImBool(cfg.commands.cput)
    local ceject = imgui.ImBool(cfg.commands.ceject)
    local ftazer = imgui.ImBool(cfg.commands.ftazer)
    local deject = imgui.ImBool(cfg.commands.deject)
    local tazer = imgui.ImBool(cfg.commands.tazer)
    local x, y = getScreenResolution()
    imgui.SetNextWindowPos(imgui.ImVec2(x/2, y/2), imgui.Cond.FirstUseEver, imgui.ImVec2(0.5, 0.5))
    imgui.SetNextWindowSize(imgui.ImVec2(230, 200), imgui.Cond.FirstUseEver)
    imgui.Begin(u8'FBI Tools | Настройка комманд', command_window, imgui.WindowFlags.NoResize)
    if imgui.Checkbox(u8('Отыгровка /ticket'), ticket) then
      if cfg.commands.ticket == false then
        cfg.commands.ticket = true
      else
        cfg.commands.ticket = false
      end
    end
    if imgui.Checkbox(u8('Отыгровка /cput'), cput) then
      if cfg.commands.cput == false then
        cfg.commands.cput = true
      else
        cfg.commands.cput = false
      end
    end
    if imgui.Checkbox(u8('Отыгровка /ceject'), ceject) then
      if cfg.commands.ceject == false then
        cfg.commands.ceject = true
      else
        cfg.commands.ceject = false
      end
    end
    if imgui.Checkbox(u8('Отыгровка /ftazer'), ftazer) then
      if cfg.commands.ftazer == false then
        cfg.commands.ftazer = true
      else
        cfg.commands.ftazer = false
      end
    end
    if imgui.Checkbox(u8('Отыгровка /deject'), deject) then
      if cfg.commands.deject == false then
        cfg.commands.deject = true
      else
        cfg.commands.deject = false
      end
    end
    if imgui.Checkbox(u8('Отыгровка /tazer'), tazer) then
      if cfg.commands.tazer == false then
        cfg.commands.tazer = true
      else
        cfg.commands.tazer = false
      end
    end
    if imgui.Button(u8'Сохранить настройки') then
      sampAddChatMessage('{9966CC}FBI Tools {ffffff}| Настройки успешно сохранены.', -1)
      inicfg.save(cfg, 'fbitools/config.ini') -- сохраняем все новые значения в конфиге
    end
    imgui.End()
  end
  if third_window.v then
    local test_text_buffer = imgui.ImBuffer(128)
    local xcord = imgui.ImInt(cfg.main.posX)
    local ycord = imgui.ImInt(cfg.main.posY)
    local xtazer = imgui.ImInt(cfg.keys.tazer)
    local xfast = imgui.ImInt(cfg.keys.fastmenu)
    local xoopda = imgui.ImInt(cfg.keys.oopda)
    local xoopnet = imgui.ImInt(cfg.keys.oopnet)
    local clistbuffer = imgui.ImInt(cfg.main.clist)
    local x, y = getScreenResolution()
    local btn_size = imgui.ImVec2(-0.1, 0)
    imgui.SetNextWindowPos(imgui.ImVec2(x/2, y/2), imgui.Cond.FirstUseEver, imgui.ImVec2(0.5, 0.5))
    imgui.SetNextWindowSize(imgui.ImVec2(380, 320), imgui.Cond.FirstUseEver)
    imgui.Begin('FBI Tools | Configuration', third_window, imgui.WindowFlags.NoResize)
    imgui.PushItemWidth(100)
    if imgui.InputText(u8'Введите ваш Тег.', test_text_buffer) then
     cfg.main.tar = u8:decode(test_text_buffer.v)
    end
    if cfg.main.tar ~= nil then
      imgui.Text(u8'Текущий тег: '..u8(cfg.main.tar))
    end
    if imgui.Button(u8'Удалить тег') then
      cfg.main.tar = nil
    end
    if imgui.SliderInt(u8"Выберите значение клиста", clistbuffer, 0, 33) then
      cfg.main.clist = clistbuffer.v
    end
    if imgui.InputInt(u8'Введите: значение X', xcord)  then
      cfg.main.posX = xcord.v
    end
    if imgui.InputInt(u8'Введите: значение Y', ycord)  then
      cfg.main.posY = ycord.v
    end
    if imgui.InputInt(u8'Введите ид клавиши тазера', xtazer) then
      cfg.keys.tazer = xtazer.v
    end
    if cfg.keys.tazer ~= nil and key.id_to_name(cfg.keys.tazer) ~= nil then
      imgui.Text(u8'Текущая клавиша: '..u8(key.id_to_name(cfg.keys.tazer)))
    end
    if imgui.InputInt(u8'Введите ид клавиши быстрого меню', xfast) then
      cfg.keys.fastmenu = xfast.v
    end
    if cfg.keys.fastmenu ~= nil and key.id_to_name(cfg.keys.fastmenu) ~= nil then
      imgui.Text(u8'Текущая клавиша: '..u8(key.id_to_name(cfg.keys.fastmenu)))
    end
    if imgui.InputInt(u8'Введите ид клавиши подтверждения ООП', xoopda) then
      cfg.keys.oopda = xoopda.v
    end
    if cfg.keys.oopda ~= nil and key.id_to_name(cfg.keys.oopda) ~= nil then
      imgui.Text(u8'Текущая клавиша: '..u8(key.id_to_name(cfg.keys.oopda)))
    end
    if imgui.InputInt(u8'Введите ид клавиши отмены ООП', xoopnet) then
      cfg.keys.oopnet = xoopnet.v
    end
    if cfg.keys.oopnet ~= nil and key.id_to_name(cfg.keys.oopnet) ~= nil then
      imgui.Text(u8'Текущая клавиша: '..u8(key.id_to_name(cfg.keys.oopnet)))
    end
    if imgui.Button(u8'Гайд по смене клавиши') then
      os.execute('explorer "https://docs.google.com/document/d/1R2o0hm9RYWNZNK38EBOyEgqPeiCeDDqWP4HlpUFGLzQ/edit?usp=sharing"')
    end
    if imgui.Button(u8'Сохранить настройки') then
      sampAddChatMessage('{9966CC}FBI Tools {ffffff}| Настройки успешно сохранены.', -1)
      inicfg.save(cfg, 'fbitools/config.ini') -- сохраняем все новые значения в конфиге
    end
    imgui.End()
  end
  if first_window.v then
    _, myid = sampGetPlayerIdByCharHandle(PLAYER_PED)
    local myname = sampGetPlayerNickname(myid)
    local myping = sampGetPlayerPing(myid)
    local myweapon = getCurrentCharWeapon(PLAYER_PED)
    local myweaponammo = getAmmoInCharWeapon(PLAYER_PED, myweapon)
    local valid, ped = getCharPlayerIsTargeting(PLAYER_HANDLE) -- получить хендл персонажа, в которого целится игрок
    local myweaponname = getweaponname(myweapon)
    imgui.SetNextWindowPos(imgui.ImVec2(cfg.main.posX, cfg.main.posY), imgui.ImVec2(0.5, 0.5)) -- в центре будет выводиться твое окно
    imgui.SetNextWindowSize(imgui.ImVec2(cfg.main.widehud, 180), imgui.Cond.FirstUseEver)
    imgui.Begin('FBI Tools', first_window, imgui.WindowFlags.NoResize + imgui.WindowFlags.NoCollapse + imgui.WindowFlags.NoTitleBar)
    imgui.SetCursorPosX((275- imgui.CalcTextSize(u8('FBI Tools')).x)/2) -- ШИРИНА - это ширина окна.
    imgui.Text('FBI Tools')
    imgui.Separator()
    imgui.Text('Information: '..myname..'['..myid..'] | Ping: '..myping) -- простой текст внутри этого окна
    imgui.Text('Current weapon: '..myweaponname..'['..myweaponammo..']')
    if isCharInAnyCar(playerPed) then
      local vHandle = storeCarCharIsInNoSave(playerPed)
      local result, vID = sampGetVehicleIdByCarHandle(vHandle)
      local vHP = getCarHealth(vHandle)
      local carspeed = getCarSpeed(vHandle)
      local speed = math.floor(carspeed)
      local vehName = getCarNamebyModel(getCarModel(storeCarCharIsInNoSave(playerPed)))
      imgui.Text('Vehicle: '..vehName..'['..vID..'] | HP: '..vHP..' | Speed: '..speed*2)
    else
      imgui.Text('Vehicle: No')
    end
    if valid and doesCharExist(ped) then -- если цель есть и персонаж существует
      local result, id = sampGetPlayerIdByCharHandle(ped) -- получить samp-ид игрока по хендлу персонажа
      if result then
        local targetname = sampGetPlayerNickname(id) -- проверить, прошло ли получение ида успешно
        local targetscore = sampGetPlayerScore(id)
        imgui.Text('Target: '..targetname..'['..id..'] | LVL: '..targetscore)
      end
    else
      imgui.Text('Target: No')
    end
    imgui.Text('Location: '..u8(kvadrat()))
    imgui.Text('Current Time: '..os.date('%H:%M:%S'))
    if cfg.main.male == true then
      imgui.Text('State: Male')
    end
    if cfg.main.male == false then
      imgui.Text('State: Female')
    end
    if tazer == true then
      imgui.Text('Tazer: ON')
    else
      imgui.Text('Tazer: OFF')
    end
    imgui.End() -- конец окна
  end
  if second_window.v then
    local x, y = getScreenResolution()
    local btn_size = imgui.ImVec2(-0.1, 0)
    imgui.SetNextWindowPos(imgui.ImVec2(x/2, y/2), imgui.Cond.FirstUseEver, imgui.ImVec2(0.5, 0.5))
    imgui.SetNextWindowSize(imgui.ImVec2(300, 300), imgui.Cond.FirstUseEver)
    imgui.Begin('FBI Tools | Main Menu | Version: '..thisScript().version, second_window, imgui.WindowFlags.NoResize)
		if imgui.Button(u8'Биндер', btn_size) then
			bMainWindow.v = not bMainWindow.v
		end
    if cfg.main.hud == true then
      if imgui.Button(u8'Выключить инфо-бар', btn_size) then
        lua_thread.create(function()
          cfg.main.hud = false
          wait(100)
          inicfg.save(cfg, 'fbitools/config.ini')
          sampAddChatMessage('{9966CC}FBI Tools {ffffff}| Инфо-бар выключен.', -1)
        end)
      end
    elseif cfg.main.hud == false then
      if imgui.Button(u8'Включить инфо-бар', btn_size) then
        lua_thread.create(function()
          cfg.main.hud = true
          wait(100)
          inicfg.save(cfg, 'fbitools/config.ini')
          sampAddChatMessage('{9966CC}FBI Tools {ffffff}| Инфо-бар включен.', -1)
        end)
      end
    end
    if cfg.main.nwanted == true then
      if imgui.Button(u8'Выключить обновленный Wanted', btn_size) then
        lua_thread.create(function()
          cfg.main.nwanted = false
          wait(100)
          inicfg.save(cfg, 'fbitools/config.ini')
          sampAddChatMessage("{9966cc}FBI Tools {ffffff}| New Wanted colors disabled", -1)
        end)
      end
    else
      if imgui.Button(u8'Включить обновленный Wanted', btn_size) then
        lua_thread.create(function()
          cfg.main.nwanted = true
          wait(100)
          inicfg.save(cfg, 'fbitools/config.ini')
          sampAddChatMessage("{9966cc}FBI Tools {ffffff}| New Wanted colors enabled", -1)
        end)
      end
    end
    if cfg.main.nclear == true then
      if imgui.Button(u8'Выключить дополненый Clear', btn_size) then
        cfg.main.nclear = false
        sampAddChatMessage("{9966cc}FBI Tools {ffffff}| Advanced clear disabled", -1)
        inicfg.save(cfg, 'fbitools/config.ini')
      end
    else
      if imgui.Button(u8'Включить дополненый Clear', btn_size) then
        cfg.main.nclear = true
        sampAddChatMessage("{9966cc}FBI Tools {ffffff}| Advanced clear enabled", -1)
        inicfg.save(cfg, 'fbitools/config.ini')
      end
    end
    if imgui.Button(u8'Настройки скрипта', btn_size) then
      third_window.v = not third_window.v
    end
    if imgui.Button(u8'Настройки комманд', btn_size) then
      command_window.v = not command_window.v
    end
    if imgui.Button(u8'Перезагрузить скрипт', btn_size) then
      showCursor(false)
      thisScript():reload()
    end
    imgui.End()
  end
end

end

function sumenu(args)
  return
  {
    {
      title = '{5b83c2}« Раздел №1 »',
      onclick = function()
      end
    },
    {
      title = '{ffffff}» Избиение - {ff0000}2 уровень розыска.',
      onclick = function()
        sampSendChat("/su "..args.." 2 Избиение")
      end
    },
    {
      title = '{ffffff}» Вооруженное нападение на гражданского - {ff0000}3 уровень розыска.',
      onclick = function()
        sampSendChat("/su "..args.." 3 Вооруженное нападение на гражданского")
      end
    },
    {
      title = '{ffffff}» Вооруженное нападение на гос.служащего - {ff0000}6 уровень розыска.',
      onclick = function()
        sampSendChat("/su "..args.." 6 Вооруженное нападение на ПО")
      end
    },
    {
      title = '{ffffff}» Убийство человека - {ff0000}3 уровень розыска.',
      onclick = function()
        sampSendChat("/su "..args.." 3 Убийство человека")
      end
    },
    {
      title = '{ffffff}» Хулиганство - {ff0000}1 уровень розыска.',
      onclick = function()
        sampSendChat("/su "..args.." 1 Хулиганство")
      end
    },
    {
      title = '{ffffff}» Неадекватное поведение - {ff0000}1 уровень розыска.',
      onclick = function()
        sampSendChat("/su "..args.." 1 Неадекватное поведение")
      end
    },
    {
      title = '{ffffff}» Попрошайничество - {ff0000}1 уровень розыска.',
      onclick = function()
        sampSendChat("/su "..args.." 1 Попрошайничество")
      end
    },
    {
      title = '{ffffff}» Оскорбление - {ff0000}2 уровень розыска.',
      onclick = function()
        sampSendChat("/su "..args.." 2 Оскорбление")
      end
    },
    {
      title = '{ffffff}» Наезд на пешехода - {ff0000}2 уровень розыска.',
      onclick = function()
        sampSendChat("/su "..args.." 2 Наезд на пешехода")
      end
    },
    {
      title = '{ffffff}» Игнорирование спец.сигнала - {ff0000}1 уровень розыска.',
      onclick = function()
        sampSendChat("/su "..args.." 1 Игнорирование спец.сигнала")
      end
    },
    {
      title = '{ffffff}» Угон транспортного средства - {ff0000}2 уровень розыска.',
      onclick = function()
        sampSendChat("/su "..args.." 2 Угон транспортного средства")
      end
    },
    {
      title = '{ffffff}» Порча чужого имущества - {ff0000}1 уровень розыска.',
      onclick = function()
        sampSendChat("/su "..args.. " 1 Порча чужого имущества")
      end
    },
    {
      title = '{ffffff}» Уничтожение чужого имущества - {ff0000}4 уровень розыска.',
      onclick = function()
        sampSendChat("/su "..args.." 4 Уничтожение чужого имущества")
      end
    },
    {
      title = '{ffffff}» Неподчинение сотруднику ПО - {ff0000}1 уровень розыска.',
      onclick = function()
        sampSendChat("/su "..args.." 1 Неподчинение сотруднику ПО")
      end
    },
    {
      title = '{ffffff}» Уход от сотрудника ПО - {ff0000}2 уровень розыска',
      onclick = function()
        sampSendChat("/su "..args.." 2 Уход от сотрудника ПО")
      end
    },
    {
      title = '{ffffff}» Побег из места заключения - {ff0000}6 уровень розыска.',
      onclick = function()
        sampSendChat("/su "..args.." 6 Побег из места заключения")
      end
    },
    {
      title = '{ffffff}» Проникновение на охраняемую территорию - {ff0000}2 уровень розыска.',
      onclick = function()
        sampSendChat("/su "..args.." 2 Проникновение на охр. территорию")
      end
    },
    {
      title = '{ffffff}» Провокация - {ff0000}2 уровень розыска.',
      onclick = function()
        sampSendChat("/su "..args.." 2 Провокация")
      end
    },
    {
      title = '{ffffff}» Угрозы - {ff0000}1 уровень розыска.',
      onclick = function()
        sampSendChat("/su "..args.." 1 Угрозы")
      end
    },
    {
      title = '{ffffff}» Предложение интим. услуг - {ff0000}1 уровень розыска',
      onclick = function()
        sampSendChat('/su '..args..' 1 Предложение интимных услуг')
      end
    },
    {
      title = '{ffffff}» Изнасилование - {ff0000}3 уровень розыска',
      onclick = function()
        sampSendChat('/su '..args..' 3 Изнасилование')
      end
    },
    {
      title = '{ffffff}» Чистосердечное признание - {ff0000}1 уровень розыска.',
      onclick = function()
        local result = isCharInAnyCar(PLAYER_PED)
        if result then
          sampSendChat("/clear "..args)
          wait(1200)
          sampSendChat("/su "..args.." 1 Чистосердечное признание")
        else
          sampAddChatMessage("{9966CC}FBI Tools {FFFFFF}| You have to be in the car", -1)
        end
      end
    },
    {
      title = '{ffbc54}« Раздел №2 »',
      onclick = function()
      end
    },
    {
      title = '{ffffff}» Хранение материалов - {ff0000}3 уровень розыска.',
      onclick = function()
        sampSendChat("/su "..args.." 3 Хранение материалов")
      end
    },
    {
      title = '{ffffff}» Хранение наркотиков - {ff0000}3 уровень розыска.',
      onclick = function()
        sampSendChat("/su "..args.." 3 Хранение наркотиков")
      end
    },
    {
      title = '{ffffff}» Продажа ключей от камеры - {ff0000}6 уровень розыска',
      onclick = function()
        sampSendChat("/su "..args.." 6 Продажа ключей от камеры")
      end
    },
    {
      title = '{ffffff}» Употребление наркотиков - {ff0000}3 уровень розыска',
      onclick = function()
        sampSendChat("/su "..args.." 3 Употребление наркотиков")
      end
    },
    {
      title = '{ffffff}» Продажа наркотиков - {ff0000}2 уровень розыска',
      onclick = function()
        sampSendChat("/su "..args.." 2 Продажа наркотиков")
      end
    },
    {
      title = '{ffffff}» Покупка военной формы - {ff0000}2 уровень розыска',
      onclick = function()
        sampSendChat("/su "..args.." 2 Покупка военной формы")
      end
    },
    {
      title = '{ffffff}» Предложение взятки гос.служащему - {ff0000}2 уровень розыска.',
      onclick = function()
        sampSendChat("/su "..args.." 2 Предложение взятки гос.служащему")
      end
    },
    {
      title = '{ae0620}« Раздел №3 »',
      onclick = function()
      end
    },
    {
      title = '{ffffff}» Уход в AFK от ареста - {ff0000}6 уровень розыска.',
      onclick = function()
        sampSendChat("/su "..args.." 6 Уход")
      end
    },
    {
      title = '{ffffff}» Совершение терракта - {ff0000}6 уровень розыска.',
      onclick = function()
        sampSendChat("/su "..args.." 6 Совершение теракта")
      end
    },
    {
      title = '{ffffff}» Неуплата штрафа - {ff0000}2 уровень розыска.',
      onclick = function()
        sampSendChat("/su "..args.." 2 Неуплата штрафа")
      end
    },
    {
      title = '{ffffff}» Превышение полномочий адвоката - {ff0000}3 уровень розыска.',
      onclick = function()
        sampSendChat("/su "..args.." 3 Превышение полномочий адвоката")
      end
    },
    {
      title = '{ffffff}» Похищение гражданского/гос.служащего - {ff0000}4 уровень розыска',
      onclick = function()
        sampSendChat("/su "..args.." 4 Похищение")
      end
    },
    {
      title = '{ffffff}» Статус ООП - {ff0000}6 уровень розыска',
      onclick = function()
        sampSendChat("/su "..args.." 6 ООП")
      end
    }
  }
end

function oop(args)
  pID = tonumber(args)
  if frac == 'FBI' or frac == 'LSPD' or frac == 'SFPD' or frac == 'LVPD' then
    if rank == 'Кадет' or rank == 'Офицер' or rank == 'Мл.Сержант' or  rank == 'Сержант' or  rank == 'Прапорщик' then
      if pID == nil then
        sampAddChatMessage("{9966CC}FBI Tools {FFFFFF}| Введите: /oop ID", -1)
      end
      if pID ~= nil and sampIsPlayerConnected(pID) then
        if cfg.main.tar == nil then
          sampSendChat("/r Дело на имя "..sampGetPlayerNickname(pID):gsub('_', ' ').." ("..pID..") рассмотрению не подлежит, ООП, объявите.")
        else
          sampSendChat("/r "..cfg.main.tar.." Дело на имя "..sampGetPlayerNickname(pID):gsub('_', ' ').." ("..pID..") рассмотрению не подлежит, ООП, объявите.")
        end
      end
      if pID ~= nil and not sampIsPlayerConnected(pID) then
        sampAddChatMessage("{9966CC}FBI Tools {FFFFFF}| Игрок с ID: "..args.." не подключен к серверу", -1)
      end
    else
      if pID == nil then
        sampAddChatMessage("{9966CC}FBI Tools {FFFFFF}| Введите: /oop ID", -1)
      end
      gint = getActiveInterior()
      if pID ~= nil and sampIsPlayerConnected(pID) then
        if gint == 21 then
          sampSendChat("/d Mayor, дело на имя "..sampGetPlayerNickname(pID):gsub('_', ' ').." рассмотрению не подлежит, ООП КПЗ LSPD.", -1)
        elseif gint == 10 then
          sampSendChat("/d Mayor, дело на имя "..sampGetPlayerNickname(pID):gsub('_', ' ').." рассмотрению не подлежит, ООП КПЗ SFPD.", -1)
        elseif gint == 3 then
          sampSendChat("/d Mayor, дело на имя "..sampGetPlayerNickname(pID):gsub('_', ' ').." рассмотрению не подлежит, ООП КПЗ LVPD.", -1)
        elseif gint ~= 10 and gint ~= 21 and gint ~= 3 then
          sampSendChat("/d Mayor, дело на имя "..sampGetPlayerNickname(pID):gsub('_', ' ').." рассмотрению не подлежит, ООП.", -1)
        end
      else
        sampAddChatMessage("{9966CC}FBI Tools {FFFFFF}| Игрок с ID: "..args.." не подключен к серверу", -1)
      end
    end
  else
      sampAddChatMessage("{9966CC}FBI Tools {FFFFFF}| Вы не сотрудник ПД/FBI", -1)
  end
end

function tazer()
  if cfg.commands.tazer == true then
    if cfg.main.male == true then
      lua_thread.create(
      function()
        sampSendChat("/tazer")
        wait(1200)
        sampSendChat("/me сменил тип патронов")
      end)
    end
    if cfg.main.male == false then
      lua_thread.create(
      function()
        sampSendChat("/tazer")
        wait(1200)
        sampSendChat("/me сменила тип патронов")
      end)
    end
  else
    sampSendChat('/tazer')
  end
end

function keys()
  if cfg.main.male == true then
    lua_thread.create(
    function()
      sampSendChat("/me взял ключ")
      wait(1200)
      sampSendChat("/me сравнивает ключ с ключом от КПЗ")
      wait(1200)
      sampSendChat("/try обнаружил, что ключи идентичны")
      wait(1200)
    end)
  end
  if cfg.main.male == false then
    lua_thread.create(
      function()
       sampSendChat("/me взяла ключ")
      wait(1200)
      sampSendChat("/me сравнивает ключ с ключом от КПЗ")
      wait(1200)
      sampSendChat("/try обнаружила, что ключи идентичны")
      end)
  end
end

function pr()
  lua_thread.create(
  function()
    sampSendChat("Вы арестованы, у вас есть право хранить молчание. Всё, что вы скажете, может и будет использовано против вас в суде.")
    wait(4000)
    sampSendChat("У вас есть право на адвоката и на один телефонный звонок. Вам понятны ваши права?")
    wait(1200)
  end)
end

function su(args)
    pID = tonumber(args)
    if pID ~= nil then
        if sampIsPlayerConnected(pID) then
          lua_thread.create(function()
            submenus_show(sumenu(pID), "{9966cc}FBI Tools {ffffff}| "..sampGetPlayerNickname(pID).."["..args.."] ")
          end)
        else
            sampAddChatMessage("{9966CC}FBI Tools {FFFFFF}| Игрок с ID: "..args.." не подключен к серверу", -1)
        end
    else
        sampAddChatMessage("{9966CC}FBI Tools {FFFFFF}| Введите: /su ID", -1)
    end
  end

function ssu(args)
  sampSendChat("/su "..args)
end

function cput(par)
  local id, seat = string.match(par, '(%d+)%s*(%d*)')
  if cfg.commands.cput == true then
    if cfg.main.male == true then
          if id == nil or seat == nil then
        sampAddChatMessage("{9966CC}FBI Tools {FFFFFF}| Введите: /cput ID SEAT", -1)
          end
        if id ~= nil and sampIsPlayerConnected(id) then
        if seat == "" or seat < "1" or seat > "3" then
          sampAddChatMessage("{9966CC}FBI Tools {FFFFFF}| Введите: /cput ID SEAT", -1)
        elseif seat == "1" then
          if isCharOnAnyBike(playerPed) then
            lua_thread.create(function()
              sampSendChat("/me посадил "..sampGetPlayerNickname(id).." на сиденье мотоцикла")
              wait(1200)
              sampSendChat("/cput "..id.." 1", -1)
            end)
          else
            lua_thread.create(function()
              sampSendChat("/me открыл дверь автомобиля и затолкнул туда "..sampGetPlayerNickname(id))
              wait(1200)
              sampSendChat("/cput "..id.." 1", -1)
            end)
          end
        elseif seat =="2" then
          if isCharOnAnyBike(playerPed) then
            lua_thread.create(function()
              sampSendChat("/me посадил "..sampGetPlayerNickname(id).." на сиденье мотоцикла")
              wait(1200)
              sampSendChat("/cput "..id.." 1", -1)
            end)
          else
            lua_thread.create(function()
              sampSendChat("/me открыл дверь автомобиля и затолкнул туда "..sampGetPlayerNickname(id))
              wait(1200)
              sampSendChat("/cput "..id.." 2", -1)
            end)
          end
        elseif seat == "3" then
          if isCharOnAnyBike(playerPed) then
            lua_thread.create(function()
              sampSendChat("/me посадил "..sampGetPlayerNickname(id).." на сиденье мотоцикла")
              wait(1200)
              sampSendChat("/cput "..id.." 1", -1)
            end)
          else
            lua_thread.create(function()
              sampSendChat("/me открыл дверь автомобиля и затолкнул туда "..sampGetPlayerNickname(id))
              wait(1200)
              sampSendChat("/cput "..id.." 3", -1)
            end)
          end
        end
      end
    end
  end
  if cfg.main.male == false then
    if id == nil or seat == nil then
      sampAddChatMessage("{9966CC}FBI Tools {FFFFFF}| Введите: /cput ID SEAT", -1)
    end
    if id ~= nil and sampIsPlayerConnected(id) then
      if seat == "" or seat < "1" or seat > "3" then
        sampAddChatMessage("{9966CC}FBI Tools {FFFFFF}| Enter: /cput ID SEAT", -1)
      elseif seat == "1" then
        if isCharOnAnyBike(playerPed) then
          lua_thread.create(function()
            sampSendChat("/me посадила "..sampGetPlayerNickname(id).." на сиденье мотоцикла")
            wait(1200)
            sampSendChat("/cput "..id.." 1", -1)
          end)
        else
          lua_thread.create(function()
            sampSendChat("/me открыла дверь автомобиля и затолкнула туда "..sampGetPlayerNickname(id))
            wait(1200)
            sampSendChat("/cput "..id.." 1", -1)
          end)
        end
      elseif seat =="2" then
        if isCharOnAnyBike(playerPed) then
          lua_thread.create(function()
            sampSendChat("/me посадила "..sampGetPlayerNickname(id).." на сиденье мотоцикла")
            wait(1200)
            sampSendChat("/cput "..id.." 1", -1)
          end)
        else
          lua_thread.create(function()
            sampSendChat("/me открыла дверь автомобиля и затолкнула туда "..sampGetPlayerNickname(id))
            wait(1200)
            sampSendChat("/cput "..id.." 2", -1)
          end)
        end
      elseif seat == "3" then
        if isCharOnAnyBike(playerPed) then
          lua_thread.create(function()
            sampSendChat("/me посадила "..sampGetPlayerNickname(id).." на сиденье мотоцикла")
            wait(1200)
            sampSendChat("/cput "..id.." 1", -1)
          end)
        else
          lua_thread.create(function()
            sampSendChat("/me открыла дверь автомобиля и затолкнула туда "..sampGetPlayerNickname(id))
            wait(1200)
            sampSendChat("/cput "..id.." 3", -1)
          end)
        end
      end
    end
  end
end

function ceject(par)
  id = tonumber(par)
  if cfg.commands.ceject == true then
    if cfg.main.male == true then
      if id == nil then
      sampAddChatMessage("{9966CC}FBI Tools {FFFFFF}| Введите: /ceject ID", -1)
      end
      if id ~= nil and sampIsPlayerConnected(id) then
        if isCharOnAnyBike(playerPed) then
          lua_thread.create(function()
            sampSendChat("/me высадил "..sampGetPlayerNickname(id).." из мотоцикла")
            wait(1200)
            sampSendChat("/ceject "..par, -1)
          end)
        else
          lua_thread.create(function()
            sampSendChat("/me открыл дверь автомобиля и высадил "..sampGetPlayerNickname(id))
            wait(1200)
            sampSendChat("/ceject "..par)
          end)
        end
      end
    end
    if cfg.main.male == false then
      if id == nil then
      sampAddChatMessage("{9966CC}FBI Tools {FFFFFF}| Введите: /ceject ID", -1)
      end
      if id ~= nil and sampIsPlayerConnected(id) then
        if isCharOnAnyBike(playerPed) then
          lua_thread.create(function()
            sampSendChat("/me высадила "..sampGetPlayerNickname(id).." из мотоцикла")
            wait(1200)
            sampSendChat("/ceject "..par, -1)
          end)
        else
          lua_thread.create(function()
            sampSendChat("/me открыла дверь автомобиля и высадила "..sampGetPlayerNickname(id))
            wait(1200)
            sampSendChat("/ceject "..par)
          end)
        end
      end
    end
  end
end

function tl(par)
  local id, tl = string.match(par, '(%d+)%s*(%d*)')
  if #par == 0 then
    sampAddChatMessage("{9966CC}FBI Tools {FFFFFF}| Введите: /tl ID Тип", -1)
    sampAddChatMessage("{9966CC}FBI Tools {FFFFFF}| 1 - Водительское удостоверение | 2 - Лицензия на оружие | 3 - Лицензия на воздушный транспорт", -1)
  else
    if cfg.main.male == true then
      if id ~= nil and sampIsPlayerConnected(id) then
        if tl == "" or tl < "1" or tl > "3" or id == nil or tl == nil then
          sampAddChatMessage("{9966CC}FBI Tools {FFFFFF}| Введите: /tl ID Тип", -1)
          sampAddChatMessage("{9966CC}FBI Tools {FFFFFF}| 1 - Водительское удостоверение | 2 - Лицензия на оружие | 3 - Лицензия на воздушный транспорт", -1)
        elseif tl == "1" then
          lua_thread.create(function()
           sampSendChat("/do В кармане находится КПК.")
            wait(1200)
            sampSendChat("/me достал КПК, после чего зашел в базу данных")
            wait(1200)
            sampSendChat("/me аннулировал водительские права")
            wait(1200)
            sampSendChat("/take "..id)
          end)
        elseif tl == "2" then
          lua_thread.create(function()
            sampSendChat("/do В кармане находится КПК.")
            wait(1200)
            sampSendChat("/me достал КПК, после чего зашел в базу данных")
            wait(1200)
            sampSendChat("/me аннулировал лицензию на оружие")
            wait(1200)
            sampSendChat("/take "..id)
          end)
        elseif tl == "3" then
          lua_thread.create(function()
            sampSendChat("/do В кармане находится КПК.")
            wait(1200)
            sampSendChat("/me достал КПК, после чего зашел в базу данных")
            wait(1200)
            sampSendChat("/me аннулировал лицензию на лётный транспорт")
            wait(1200)
            sampSendChat("/take "..id)
          end)
        end
      end
    end
    if cfg.main.male == false then
      if id ~= nil and sampIsPlayerConnected(id) then
        if tl == "" or tl < "1" or tl > "3" or id == nil or tl == nil then
          sampAddChatMessage("{9966CC}FBI Tools {FFFFFF}| Введите: /tl ID TYPE", -1)
          sampAddChatMessage("{9966CC}FBI Tools {FFFFFF}| 1 - Водительское удостоверение | 2 - Лицензия на оружие | 3 - Лицензия на воздушный транспорт", -1)
        elseif tl == "1" then
          lua_thread.create(function()
            sampSendChat("/do В кармане находится КПК.")
            wait(1200)
            sampSendChat("/me достала КПК, после чего зашла в базу данных")
            wait(1200)
            sampSendChat("/me аннулировала водительские права")
            wait(1200)
            sampSendChat("/take "..id)
          end)
        elseif tl == "2" then
          lua_thread.create(function()
            sampSendChat("/do В кармане находится КПК.")
            wait(1200)
            sampSendChat("/me достала КПК, после чего зашла в базу данных")
            wait(1200)
            sampSendChat("/me аннулировала лицензию на оружие")
            wait(1200)
            sampSendChat("/take "..id)
          end)
        elseif tl == "3" then
          lua_thread.create(function()
            sampSendChat("/do В кармане находится КПК.")
            wait(1200)
            sampSendChat("/me достала КПК, после чего зашла в базу данных")
            wait(1200)
            sampSendChat("/me аннулировала лицензию на лётный транспорт")
            wait(1200)
            sampSendChat("/take "..id)
          end)
        end
      end
    end
  end
end

function getVehicleNameByPlayerInCar(id)
    local id = tonumber(id, 10)
    local _, myid = sampGetPlayerIdByCharHandle(playerPed)
    if sampIsPlayerConnected(id) or id == myid then
        local res, ped = sampGetCharHandleBySampPlayerId(id)
        if res and doesCharExist(ped) and isCharInAnyCar(ped) then
            local car = storeCarCharIsInNoSave(ped)
            return getNameOfVehicleModel(getCarModel(car))
        end
    end
end

function st(pam)
  id = tonumber(pam)
  local result, ped = sampGetCharHandleBySampPlayerId(id)
  if id == nil then
    sampSendChat('/m ['..frac..'] Водитель, снизьте скорость и прижмитесь к обочине или мы откроем огонь!')
  end
  if id ~= nil and not sampIsPlayerConnected(id) then
    sampAddChatMessage(string.format('{9966CC}FBI Tools {FFFFFF}| Игрок с ID: %s не подключен к серверу', id), -1)
  end
  if result and not doesCharExist(ped) then
    local stname = sampGetPlayerNickname(id)
    sampAddChatMessage(string.format('{9966CC}FBI Tools {FFFFFF}| Игрок %s[%s] не доступен', stname, id), -1)
  end
  if result and doesCharExist(ped) and not isCharInAnyCar(ped) then
    local stnaame = sampGetPlayerNickname(id)
    sampAddChatMessage(string.format('{9966CC}FBI Tools {FFFFFF}| Игрок %s[%s] не в транспорте', stnaame, id), -1)
  end
  if result and doesCharExist(ped) and isCharInAnyCar(ped) then
    local vehName = getCarNamebyModel(getCarModel(storeCarCharIsInNoSave(ped)))
    sampSendChat("/m Водитель Т/C "..vehName.." с гос.номером [EVL"..pam.."X], прижмитесь к обочине и остановите своё Т/С")
  end
end

function deject(par)
  id = tonumber(par)
  if cfg.commands.deject == true then
    if cfg.main.male == true then
      if id == nil then
        sampAddChatMessage("{9966CC}FBI Tools {FFFFFF}| Введите: /deject ID", -1)
      end
      if id ~= nil and sampIsPlayerConnected(id) then
        local result, ped = sampGetCharHandleBySampPlayerId(id)
        if result then
          if isCharInFlyingVehicle(ped) then
            lua_thread.create(function()
              sampSendChat("/me открыл дверь вертолёта и вытащил "..sampGetPlayerNickname(id))
              wait(1200)
              sampSendChat("/deject "..par)
            end)
          elseif isCharInModel(ped, 481) or isCharInModel(ped, 510) then
            lua_thread.create(function()
              sampSendChat("/me скинул "..sampGetPlayerNickname(id).." с велосипеда")
              wait(1200)
              sampSendChat("/deject "..par)
            end)
          elseif isCharInModel(ped, 462) then
            lua_thread.create(function()
              sampSendChat("/me скинул "..sampGetPlayerNickname(id).." со скутера")
              wait(1200)
              sampSendChat("/deject "..par)
            end)
          elseif isCharOnAnyBike(ped) then
            lua_thread.create(function()
              sampSendChat("/me скинул "..sampGetPlayerNickname(id).." с мотоцикла")
              wait(1200)
              sampSendChat("/deject "..par)
            end)
          elseif isCharInAnyCar(ped) then
            lua_thread.create(function()
              sampSendChat("/me разбил окно и вытолкнул "..sampGetPlayerNickname(id).." из машины")
              wait(1200)
              sampSendChat("/deject "..par)
            end)
          end
        end
      end
    end
    if cfg.main.male == false then
        if id == nil then
        sampAddChatMessage("{9966CC}FBI Tools {FFFFFF}| Введите: /deject ID", -1)
      end
      if id ~= nil and sampIsPlayerConnected(id) then
        local result, ped = sampGetCharHandleBySampPlayerId(id)
        if result then
          if isCharInFlyingVehicle(ped) then
            lua_thread.create(function()
              sampSendChat("/me открыла дверь вертолёта и вытащила "..sampGetPlayerNickname(id))
              wait(1200)
              sampSendChat("/deject "..par)
            end)
          elseif isCharInModel(ped, 481) or isCharInModel(ped, 510) then
            lua_thread.create(function()
              sampSendChat("/me скинула "..sampGetPlayerNickname(id).." с велосипеда")
              wait(1200)
              sampSendChat("/deject "..par)
            end)
          elseif isCharInModel(ped, 462) then
            lua_thread.create(function()
              sampSendChat("/me скинула "..sampGetPlayerNickname(id).." со скутера")
              wait(1200)
              sampSendChat("/deject "..par)
            end)
          elseif isCharOnAnyBike(ped) then
            lua_thread.create(function()
              sampSendChat("/me скинула "..sampGetPlayerNickname(id).." с мотоцикла")
              wait(1200)
              sampSendChat("/deject "..par)
            end)
          elseif isCharInAnyCar(ped) then
            lua_thread.create(function()
              sampSendChat("/me разбила окно и вытолкнула "..sampGetPlayerNickname(id).." из машины")
              wait(1200)
              sampSendChat("/deject "..par)
            end)
          end
        end
      end
    end
  end
end

function rh(id)
  local _, myid = sampGetPlayerIdByCharHandle(PLAYER_PED)
  if id == "" or id < "1" or id > "3" or id == nil then
    sampAddChatMessage("{9966CC}FBI Tools {FFFFFF}| Введите: /rh Департамент", -1)
    sampAddChatMessage("{9966CC}FBI Tools {FFFFFF}| 1 - LSPD | 2 - SFPD | 3 - LVPD", -1)
  elseif id == "1" then
    sampSendChat("/d LSPD, запрашиваю патрульный экипаж в "..kvadrat()..", как приняли? Ответ на пдж."..myid)
  elseif id == "2" then
    sampSendChat("/d SFPD, запрашиваю патрульный экипаж в "..kvadrat()..", как приняли? Ответ на пдж."..myid)
  elseif id == "3" then
    sampSendChat("/d LVPD, запрашиваю патрульный экипаж в "..kvadrat()..", как приняли? Ответ на пдж."..myid)
  end
end

function gr(pam)
  local dep, reason = pam:match('(%d+)%s+(.+)')
  if dep == nil or reason == nil then
    sampAddChatMessage("{9966CC}FBI Tools {FFFFFF}| Введите: /gr [1-3] Причина", -1)
    sampAddChatMessage("{9966CC}FBI Tools {FFFFFF}| 1 - LSPD | 2 - SFPD | 3 - LVPD", -1)
  end
  if dep ~= nil then
    if dep == "" or dep < "1" or dep > "3" then
      sampAddChatMessage("{9966CC}FBI Tools {FFFFFF}| Введите: /gr [1-3] Причина", -1)
      sampAddChatMessage("{9966CC}FBI Tools {FFFFFF}| 1 - LSPD | 2 - SFPD | 3 - LVPD", -1)
    elseif dep == "1" then
      sampSendChat("/d LSPD, пересекаю вашу юрисдикцию, "..reason)
    elseif dep == "2" then
      sampSendChat("/d SFPD, пересекаю вашу юрисдикцию, "..reason)
    elseif dep == "3" then
      sampSendChat("/d LVPD, пересекаю вашу юрисдикцию, "..reason)
    end
  end
end

function warn(pam)
  local id, dep = string.match(pam, '(%d+)%s*(%d*)')
  if frac == 'FBI' then
    if dep == nil or id == nil then
      sampAddChatMessage("{9966CC}FBI Tools {FFFFFF}| Введите: /warn ID Департамент", -1)
      sampAddChatMessage("{9966CC}FBI Tools {FFFFFF}| 1 - LSPD | 2 - SFPD | 3 - LVPD",-1)
    end
    if id ~= nil and sampIsPlayerConnected(id) then
      if dep == "" or dep < "1" or dep > "3" then
        sampAddChatMessage("{9966CC}FBI Tools {FFFFFF}| Введите: /warn ID Департамент", -1)
        sampAddChatMessage("{9966CC}FBI Tools {FFFFFF}| 1 - LSPD | 2 - SFPD | 3 - LVPD",-1)
      elseif dep == "1" then
        sampSendChat("/d LSPD, "..sampGetPlayerNickname(id):gsub('_', ' ')..", получает предупреждение за неправильную подачу в розыск.")
      elseif dep == '2' then
        sampSendChat("/d SFPD, "..sampGetPlayerNickname(id):gsub('_', ' ')..", получает предупреждение за неправильную подачу в розыск.")
      elseif dep == '3' then
        sampSendChat("/d LVPD, "..sampGetPlayerNickname(id):gsub('_', ' ')..", получает предупреждение за неправильную подачу в розыск.")
      end
    end
  else
    sampAddChatMessage("{9966CC}FBI Tools {ffffff}| Вы не сотрудник ФБР", -1)
  end
end

function df()
  lua_thread.create(function()
    submenus_show(dfmenu, "{9966cc}FBI Tools {ffffff}| Bomb Menu")
  end)
end

function ms(par)
  local _, myid = sampGetPlayerIdByCharHandle(PLAYER_PED)
  if frac == 'FBI' then
    if cfg.main.male == true then
      if par == "" or par < "0" or par > "3" or par == nil then
        sampAddChatMessage("{9966CC}FBI Tools {FFFFFF}| Введите: /ms Тип", -1)
        sampAddChatMessage("{9966CC}FBI Tools {FFFFFF}| 0 - Снять маскировку | 1 - Офис | 2 - Багажник | 3 - Сумка", -1)
      elseif par == "1" then
        lua_thread.create(function()
          sampSendChat("/me снял с себя костюм агента и повесил на вешалку")
          wait(1200)
          sampSendChat("/me открыл ящик, после чего достал комплект маскировки")
          wait(1200)
          sampSendChat("/me надел на себя маскировку и закрыл ящик")
          wait(1200)
          sampSendChat("/do Агент в маскировке.")
          wait(100)
          submenus_show(osnova, "{9966cc}FBI Tools {ffffff}| Mask")
        end)
      elseif par == "2" then
        lua_thread.create(function()
          sampSendChat("/me открыл багажник автомобиля")
          wait(1200)
          sampSendChat("/me снял с себя костюм агента и убрал в багажник")
          wait(1200)
          sampSendChat("/me достал из багажника комплект маскировки и надел на себя")
          wait(1200)
          sampSendChat("/me закрыл багажник")
          wait(1200)
          sampSendChat("/do Агент в маскировке.")
          wait(100)
          submenus_show(osnova, "{9966cc}FBI Tools {ffffff}| Mask")
        end)
      elseif par == "3" then
        lua_thread.create(function()
          sampSendChat("/do на плече агента висит сумка")
          wait(1200)
          sampSendChat("/me открыв сумку, снял костюм агента и убрал туда")
          wait(1200)
          sampSendChat("/me достал из сумки комплект маскировки и надел на себя")
          wait(1200)
          sampSendChat("/me закрыл сумку")
          wait(1200)
          sampSendChat("/do Агент в маскировке.")
          wait(100)
          submenus_show(osnova, "{9966cc}FBI Tools {ffffff}| Mask")
        end)
      elseif par == "0" then
        lua_thread.create(function()
          sampSendChat("/me снял с себя маскировку")
          wait(1200)
          sampSendChat("/me надел на себя костюм агента")
          wait(1200)
          sampSendChat("/r Переоделся в костюм агента")
          wait(1200)
          sampSendChat("/rb "..myid)
        end)
      end
    end
    if cfg.main.male == false then
        if par == "" or par < "0" or par > "3" or par == nil then
        sampAddChatMessage("{9966CC}FBI Tools {FFFFFF}| Введите: /ms Тип", -1)
        sampAddChatMessage("{9966CC}FBI Tools {FFFFFF}| 0 - Снять маскировку | 1 - Офис | 2 - Багажник | 3 - Сумка", -1)
      elseif par == "1" then
        lua_thread.create(function()
          sampSendChat("/me сняла с себя костюм агента и повесила на вешалку")
          wait(1200)
          sampSendChat("/me открыла ящик, после чего достала комплект маскировки")
          wait(1200)
          sampSendChat("/me надела на себя маскировку и закрыла ящик")
          wait(1200)
          sampSendChat("/do Агент в маскировке.")
          wait(100)
          submenus_show(osnova, "{9966cc}FBI Tools {ffffff}| Mask")
        end)
      elseif par == "2" then
        lua_thread.create(function()
          sampSendChat("/me открыла багажник автомобиля")
          wait(1200)
          sampSendChat("/me сняла с себя костюм агента и убрала в багажник")
          wait(1200)
          sampSendChat("/me достала из багажника комплект маскировки и надела на себя")
          wait(1200)
          sampSendChat("/me закрыла багажник")
          wait(1200)
          sampSendChat("/do Агент в маскировке.")
          wait(100)
          submenus_show(osnova, "{9966cc}FBI Tools {ffffff}| Mask")
        end)
      elseif par == "3" then
        lua_thread.create(function()
          sampSendChat("/do на плече агента висит сумка")
          wait(1200)
          sampSendChat("/me открыв сумку, сняла костюм агента и убрала туда")
          wait(1200)
          sampSendChat("/me достала из сумки комплект маскировки и надела на себя")
          wait(1200)
          sampSendChat("/me закрыла сумку")
          wait(1200)
          sampSendChat("/do Агент в маскировке.")
          wait(100)
          submenus_show(osnova, "{9966cc}FBI Tools {ffffff}| Mask")
        end)
      elseif par == "0" then
        lua_thread.create(function()
          sampSendChat("/me сняла с себя маскировку")
          wait(1200)
          sampSendChat("/me надела на себя костюм агента")
          wait(1200)
          sampSendChat("/r Переоделась в костюм агента")
          wait(1200)
          sampSendChat("/rb "..myid)
        end)
      end
    end
  else
    sampAddChatMessage("{9966CC}FBI Tools {ffffff}| Вы не сотрудник ФБР", -1)
  end
end

function ar(id)
  if id == "" or id < "1" or id > "2" or id == nil then
    sampAddChatMessage("{9966cc}FBI Tools {ffffff}| Введите: /ar [1-2]", -1)
    sampAddChatMessage("{9966cc}FBI Tools {ffffff}| 1 - LVa | 2 - SFa", -1)
  elseif id == "1" then
    sampSendChat("/d LVa, разрешите въезд на вашу территорию, поимка преступника.")
  elseif id == "2" then
    sampSendChat("/d SFa, разрешите въезд на вашу территорию, поимка преступника.")
  end
end

function kmdc(args)
 pID = tonumber(args)
 if cfg.main.male == true then
    if pID ~= nil then
      if sampIsPlayerConnected(pID) then
        lua_thread.create(function()
          sampSendChat("/me достал КПК и сделал фотографию человека")
          wait(1200)
          sampSendChat("/do КПК дал информацию: Имя: "..sampGetPlayerNickname(pID):gsub('_', ' ')..".")
          wait(1200)
          sampSendChat("/mdc "..args)
          wait(1200)
          sampSendChat("/time")
          wait(500)
          setVirtualKeyDown(key.VK_F8, true)
          wait(150)
          setVirtualKeyDown(key.VK_F8, false)
        end)
      else
        sampAddChatMessage("{9966CC}FBI Tools {FFFFFF}| Игрок с ID: "..args.." не подключен к серверу", -1)
      end
    else
          sampAddChatMessage("{9966CC}FBI Tools {FFFFFF}| Введите: /kmdc ID", -1)
    end
  end
  if cfg.main.male == false then
    if pID ~= nil then
        if sampIsPlayerConnected(pID) then
            lua_thread.create(function()
              sampSendChat("/me достала КПК и сделала фотографию человека")
              wait(1200)
              sampSendChat("/do КПК дал информацию: Имя: "..sampGetPlayerNickname(pID):gsub('_', ' ')..".")
              wait(1200)
              sampSendChat("/mdc "..args)
              wait(1200)
              sampSendChat("/time")
              wait(500)
              setVirtualKeyDown(key.VK_F8, true)
              wait(150)
              setVirtualKeyDown(key.VK_F8, false)
            end)
        else
            sampAddChatMessage("{9966CC}FBI Tools {FFFFFF}| Игрок с ID: "..args.." не подключен к серверу", -1)
        end
    else
        sampAddChatMessage("{9966CC}FBI Tools {FFFFFF}| Введите: /kmdc ID", -1)
    end
  end
end

function ftazer(id)
  if cfg.commands.ftazer == true then
    if cfg.main.male == true then
      if id == "" or id < "1" or id > "4" or id == nil then
        sampAddChatMessage("{9966CC}FBI Tools {ffffff}| Введите: /ftazer [1-3]", -1)
        sampAddChatMessage("{9966CC}FBI Tools {ffffff}| 1 - Всех | 2 - Гос.Сотрудников | 3 - Гражданских | 4 - Кейс", -1)
      elseif id == "1" then
        lua_thread.create(function()
          sampSendChat("/me достал из внутреннего кармана беруши")
          wait(1200)
          sampSendChat("/me надел беруши и зажмурился")
          wait(1200)
          sampSendChat("/me бросил светошумовую гранату")
          wait(1200)
          sampSendChat("/ftazer 1", -1)
        end)
      elseif id == "2" then
        lua_thread.create(function()
          sampSendChat("/me достал из внутреннего кармана беруши")
          wait(1200)
          sampSendChat("/me надел беруши и зажмурился")
          wait(1200)
          sampSendChat("/me бросил светошумовую гранату")
          wait(1200)
          sampSendChat("/ftazer 2", -1)
        end)
      elseif id == "3" then
        lua_thread.create(function()
          sampSendChat("/me достал из внутреннего кармана беруши")
          wait(1200)
          sampSendChat("/me надел беруши и зажмурился")
          wait(1200)
          sampSendChat("/me бросил светошумовую гранату")
          wait(1200)
          sampSendChat("/ftazer 3", -1)
        end)
      elseif id == "4" then
        lua_thread.create(function()
          sampSendChat('/me медленно ложит кейс на землю')
          wait(1500)
          sampSendChat('/me развернул кейс от себя')
          wait(1500)
          sampSendChat('/me ввёл пароль')
          wait(1500)
          sampSendChat('/me резко открыл кейс')
          wait(1500)
          sampSendChat('/do При взрыве кейса зворвалась светошумовая граната.')
          wait(1500)
          sampSendChat('/ftazer 3')
        end)
      end
    end
    if cfg.main.male == false then
      if id == "" or id < "1" or id > "3" or id == nil then
        sampAddChatMessage("{9966CC}FBI Tools {ffffff}| Введите: /ftzer [1-3]", -1)
        sampAddChatMessage("{9966CC}FBI Tools {ffffff}| 1 - Всех | 2 - Гос.Сотрудников | 3 - Гражданских", -1)
      elseif id == "1" then
        lua_thread.create(function()
          sampSendChat("/me достала из внутреннего кармана беруши")
          wait(1200)
          sampSendChat("/me надела беруши и зажмурилась")
          wait(1200)
          sampSendChat("/me бросила светошумовую гранату")
          wait(1200)
          sampSendChat("/ftazer 1", -1)
        end)
      elseif id == "2" then
        lua_thread.create(function()
          sampSendChat("/me достала из внутреннего кармана беруши")
          wait(1200)
          sampSendChat("/me надела беруши и зажмурилась")
          wait(1200)
          sampSendChat("/me бросила светошумовую гранату")
          wait(1200)
          sampSendChat("/ftazer 2", -1)
        end)
      elseif id == "3" then
        lua_thread.create(function()
          sampSendChat("/me достала из внутреннего кармана беруши")
          wait(1200)
          sampSendChat("/me надела беруши и зажмурилась")
          wait(1200)
          sampSendChat("/me бросила светошумовую гранату")
          wait(1200)
          sampSendChat("/ftazer 3", -1)
        end)
      elseif id == "4" then
        lua_thread.create(function()
          sampSendChat('/me медленно ложит кейс на землю')
          wait(1500)
          sampSendChat('/me развернула кейс от себя')
          wait(1500)
          sampSendChat('/me ввела пароль')
          wait(1500)
          sampSendChat('/me резко открыла кейс')
          wait(1500)
          sampSendChat('/do При взрыве кейса зворвалась светошумовая граната.')
          wait(1500)
          sampSendChat('/ftazer 3')
        end)
      end
    end
  else
    if id == "" or id < "1" or id > "3" or id == nil then
      sampAddChatMessage("{9966CC}FBI Tools {ffffff}| Введите: /ftazer [1-3]", -1)
      sampAddChatMessage("{9966CC}FBI Tools {ffffff}| 1 - Всех | 2 - Гос.Сотрудников | 3 - Гражданских", -1)
    elseif id == '1' then
      sampSendChat('/ftazer 1')
    elseif id == '2' then
      sampSendChat('/fatzer 2')
    elseif id == '3' then
      sampSendChat('/ftazer 3')
    end
  end
end

function ftreload()
  thisScript():reload()
end

function hrt(pam)
  local _, myid = sampGetPlayerIdByCharHandle(PLAYER_PED)
  sampSendChat('/d FBI HRT, code 1 п.'..myid)
end

function nclear()
  if cfg.main.nclear == false then
    lua_thread.create(function()
      cfg.main.nclear = true
      wait(100)
      inicfg.save(cfg, 'fbitools/config.ini')
      sampAddChatMessage("{9966CC}FBI Tools {ffffff}| Advanced clear enabled.", -1)
    end)
  else
    lua_thread.create(function()
      cfg.main.nclear = false
      wait(100)
      inicfg.save(cfg, 'fbitools/config.ini')
      sampAddChatMessage("{9966cc}FBI Tools {ffffff}| Advanced clear disabled", -1)
    end)
  end
end

function nwanted()
  if cfg.main.nwanted == false then
    lua_thread.create(function()
      cfg.main.nwanted = true
      wait(100)
      inicfg.save(cfg, 'fbitools/config.ini')
      sampAddChatMessage("{9966CC}FBI Tools {ffffff}| New Wanted colors enabled.", -1)
    end)
  else
    lua_thread.create(function()
      cfg.main.nwanted = false
      wait(100)
      inicfg.save(cfg, 'fbitools/config.ini')
      sampAddChatMessage("{9966cc}FBI Tools {ffffff}| New Wanted colors disabled", -1)
    end)
  end
end

function sampev.onServerMessage(color, text)
  if mcheckb then
    if text:find('---======== МОБИЛЬНЫЙ КОМПЬЮТЕР ДАННЫХ ========---') then
      local open = io.open("moonloader/fbitools/mcheck.txt", 'a')
      open:write(string.format('%s\n', text))
      open:close()
    end
    if text:find('Имя:') then
      local open = io.open("moonloader/fbitools/mcheck.txt", 'a')
      open:write(string.format('%s\n', text))
      open:close()
    end
    if text:find('Организация:') then
      local open = io.open("moonloader/fbitools/mcheck.txt", 'a')
      open:write(string.format('%s\n', text))
      open:close()
    end
    if text:find('Преступление:') then
      local open = io.open("moonloader/fbitools/mcheck.txt", 'a')
      open:write(string.format('%s\n', text))
      open:close()
    end
    if text:find('Сообщил:') then
      local open = io.open("moonloader/fbitools/mcheck.txt", 'a')
      open:write(string.format('%s\n', text))
      open:close()
    end
    if text:find('Уровень розыска:') then
      local open = io.open("moonloader/fbitools/mcheck.txt", 'a')
      open:write(string.format('%s\n', text))
      open:close()
    end
    if text:find('---============================================---') then
      local open = io.open("moonloader/fbitools/mcheck.txt", 'a')
      open:write(string.format('%s\n', text))
      open:write(' \n')
      open:close()
    end
  end
  if zaproop then
    if nikk ~= nil then
      if text:find(nikk) and color == -8224086 then
        local _, myid = sampGetPlayerIdByCharHandle(PLAYER_PED)
        local myname = sampGetPlayerNickname(myid)
        if text:find(myname) then
        else
          lua_thread.create(function()
            zaproop = false
            nikk = nil
            wait(100)
            sampAddChatMessage('{9966cc}FBI Tools {ffffff}| Команду выполнил другой сотрудник.', -1)
          end)
        end
      end
    end
  end
  if text:find('Рабочий день начат') then
    if cfg.main.clist == nil then end
    if cfg.main.clist ~= nil then
      lua_thread.create(function ()
        wait(100)
        sampSendChat('/clist '..cfg.main.clist)
        rabden = true
      end)
    end
  end
  if text:find('Рабочий день окончен') then
    rabden = false
  end
  if text:find('Вы посадили в тюрьму') then
    local nik, sek = text:match('Вы посадили в тюрьму (.+) на (.+) секунд')
    if sek == '3600' or sek == '3000'  then
      lua_thread.create(function()
        nikk = nik:gsub('_', ' ')
        aroop = true
        wait(3000)
        sampAddChatMessage("{9966cc}FBI Tools {ffffff}| Запретить рассмотр дела на имя "..nikk:gsub('_', ' '), -1)
        sampAddChatMessage('{9966cc}FBI Tools {ffffff}| Подтвердить: {9966cc}'..key.id_to_name(cfg.keys.oopda)..'{ffffff} | Отменить: {9966cc}'..key.id_to_name(cfg.keys.oopnet), -1)
      end)
    end
  end
  if text:find('Вы посадили преступника на') then
    local sekk = text:match('Вы посадили преступника на (.+) секунд!')
    if sekk == '3000' or sekk == '3600' then
      lua_thread.create(function()
        local nickk = sampGetPlayerNickname(tdmg)
        nikk = nickk
        dmoop = true
        wait(50)
        sampAddChatMessage("{9966cc}FBI Tools {ffffff}| Запретить рассмотр дела на имя "..nikk:gsub('_', ' '), -1)
        sampAddChatMessage('{9966cc}FBI Tools {ffffff}| Подтвердить: {9966cc}'..key.id_to_name(cfg.keys.oopda)..'{ffffff} | Отменить: {9966cc}'..key.id_to_name(cfg.keys.oopnet), -1)
      end)
    end
  end
  if cfg.main.nclear == true then
    if text:find('удалил из розыскиваемых') then
      local chist, jertva = text:match('%[Clear%] (.+) удалил из розыскиваемых (.+)')
      printStringNow(chist..' cleared '..jertva..' from BD', 3000)
    end
  end
  if cfg.main.nwanted == true then
    if text:find('Wanted') and text:find('Сообщает') then
      local id, prestp, police, prichin = text:match('%[Wanted (%d+): (.+)%] %[Сообщает: (.+)%] %[(.+)%]')
      return {0xFFFFFFFF, ' {9966CC}[{ffffff}Wanted '..id..': '..prestp..'{9966cc}] [{ffffff}Сообщает: '..police..'{9966cc}] [{ffffff}'..prichin..'{9966cc}]'}
    end
    if text:find('удалил из розыскиваемых') then
      local chist, jertva = text:match('%[Clear%] (.+) удалил из розыскиваемых (.+)')
      return {0xFFFFFFFF, ' {9966CC}[{ffffff}Clear{9966cc}] '..chist..'{ffffff} удалил из розыскиваемых {9966cc}'..jertva}
    end
        if text:find('начал преследование за преступником') then
            local polic, prest, yrvn = text:match('Полицейский (.+) начал преследование за преступником (.+) %(Уровень розыска: (.+)%)')
            return {0xFFFFFFFF, ' Полицейский {9966cc}'..polic..' {ffffff}начал преследование за {9966cc}'..prest..' {ffffff}(Уровень розыска: {9966cc}'..yrvn..'{ffffff})'}
        end
        if text:find('<<') and text:find('Офицер') and text:find('арестовал') and text:find('>>') then
          local arr, arre = text:match('<< Офицер (.+) арестовал (.+) >>')
          return {0xFFFFFFFF, '« Офицер {9966CC}'..arr..' {ffffff}арестовал {9966cc}'..arre..' {ffffff}»'}
        end
        if text:find('<<') and text:find('Агент FBI') and text:find('арестовал') and text:find('>>') then
          local arrr, arrre = text:match('<< Агент FBI (.+) арестовал (.+) >>')
          return {0xFFFFFFFF, '« Агент FBI {9966CC}'..arrr..' {ffffff}арестовал {9966cc}'..arrre..' {ffffff}»'}
        end
        if text:find('Вы посадили преступника на') then
          local sekund = text:match('Вы посадили преступника на (%d+) секунд!')
          return {0xFFFFFFFF, ' Вы посадили преступника на {9966cc}'..sekund..' {ffffff}секунд!'}
        end
    end
    if text:find('Вы поменяли пули на резиновые') then
      tazer = true
    end
  if text:find('Вы поменяли пули на обычные') then
    tazer = false
  end
  if rank ~= 'Кадет' or rank ~= 'Офицер' or rank ~= 'Мл.Сержант' or  rank ~= 'Сержант' or  rank ~= 'Прапорщик' then
    if text:match('Дело .+ рассмотрению не подлежит - ООП.') and color == -1920073984 then
      local name = text:match('Дело (.+) рассмотрению не подлежит - ООП.')
      zaproop = true
      nikk = name
      lua_thread.create(function()
        wait(50)
        sampAddChatMessage("{9966CC}FBI Tools {FFFFFF}| Поступил запрос на объявление ООП игрока {9966cc}"..nikk, -1)
        sampAddChatMessage('{9966cc}FBI Tools {ffffff}| Подтвердить: {9966cc}'..key.id_to_name(cfg.keys.oopda)..'{ffffff} | Отменить: {9966cc}'..key.id_to_name(cfg.keys.oopnet), -1)
      end)
    end
    if text:match('Дело на имя .+ %(%d+%) рассмотрению не подлежит, ООП, объявите.') and color == -1920073984 then
      local name, id = text:match('Дело на имя (.+) %((%d+)%) рассмотрению не подлежит, ООП, объявите.')
      zaproop = true
      nikk = name
      lua_thread.create(function()
        wait(50)
        sampAddChatMessage("{9966CC}FBI Tools {FFFFFF}| Поступил запрос на объявление ООП игрока {9966cc}"..nikk, -1)
        sampAddChatMessage('{9966cc}FBI Tools {ffffff}| Подтвердить: {9966cc}'..key.id_to_name(cfg.keys.oopda)..'{ffffff} | Отменить: {9966cc}'..key.id_to_name(cfg.keys.oopnet), -1)
      end)
    end
    if text:match('Дело №%d+ на имя .+ рассмотрению не подлежит, ООП, объявите.') and color == -1920073984 then 
      local id, name = text:match('Дело №(%d+) на имя (.+) рассмотрению не подлежит, ООП, объявите.')
      zaproop = true
      nikk = name
      lua_thread.create(function()
        wait(50)
        sampAddChatMessage("{9966CC}FBI Tools {FFFFFF}| Поступил запрос на объявление ООП игрока {9966cc}"..nikk, -1)
        sampAddChatMessage('{9966cc}FBI Tools {ffffff}| Подтвердить: {9966cc}'..key.id_to_name(cfg.keys.oopda)..'{ffffff} | Отменить: {9966cc}'..key.id_to_name(cfg.keys.oopnet), -1)
      end)
    end
  end
end

function fvz(pam)
  local id, dep = string.match(pam, '(%d+)%s*(%d*)')
  local _, myid = sampGetPlayerIdByCharHandle(playerPed)
  if frac == 'FBI' then
    if dep == nil or id == nil then
      sampAddChatMessage("{9966CC}FBI Tools {FFFFFF}| Введите: /fvz ID Организация", -1)
      sampAddChatMessage("{9966CC}FBI Tools {FFFFFF}| 1 - LSPD | 2 - SFPD | 3 - LVPD | 4 - LVa | 5 - SFa",-1)
    end
    if id ~= nil and sampIsPlayerConnected(id) then
      if dep == "" or dep < "1" or dep > "5" then
        sampAddChatMessage("{9966CC}FBI Tools {FFFFFF}| Введите: /fvz ID Организация", -1)
        sampAddChatMessage("{9966CC}FBI Tools {FFFFFF}| 1 - LSPD | 2 - SFPD | 3 - LVPD",-1)
      elseif dep == "1" then
        sampSendChat("/d LSPD, "..sampGetPlayerNickname(id):gsub('_', ' ')..", явитесь в офис ФБР со старшими. Как приняли? Ответ на пдж."..myid)
      elseif dep == '2' then
        sampSendChat("/d SFPD, "..sampGetPlayerNickname(id):gsub('_', ' ')..", явитесь в офис ФБР со старшими. Как приняли? Ответ на пдж."..myid)
      elseif dep == '3' then
        sampSendChat("/d LVPD, "..sampGetPlayerNickname(id):gsub('_', ' ')..", явитесь в офис ФБР со старшими. Как приняли? Ответ на пдж."..myid)
      elseif dep == '4' then
        sampSendChat("/d LVa, "..sampGetPlayerNickname(id):gsub('_', ' ')..", явитесь в офис ФБР со старшими. Как приняли? Ответ на пдж."..myid)
      elseif dep == '5' then
        sampSendChat("/d SFa, "..sampGetPlayerNickname(id):gsub('_', ' ')..", явитесь в офис ФБР со старшими. Как приняли? Ответ на пдж."..myid)
      end
    end
  else
    sampAddChatMessage("{9966CC}FBI Tools {ffffff}| Вы не сотрудник ФБР", -1)
  end
end

function gc()
  local posX, posY = getCursorPos()
  sampAddChatMessage(string.format("%s %s", posX, posY), -1)
end

function fbd(pam)
  local id, dep = string.match(pam, '(%d+)%s*(%d*)')
  local _, myid = sampGetPlayerIdByCharHandle(playerPed)
  if frac == 'FBI' then
    if dep == nil or id == nil then
      sampAddChatMessage("{9966CC}FBI Tools {FFFFFF}| Введите: /fbd ID Департамент", -1)
      sampAddChatMessage("{9966CC}FBI Tools {FFFFFF}| 1 - LSPD | 2 - SFPD | 3 - LVPD",-1)
    end
    if id ~= nil and sampIsPlayerConnected(id) then
      if dep == "" or dep < "1" or dep > "3" then
        sampAddChatMessage("{9966CC}FBI Tools {FFFFFF}| Enter: /fbd ID DEPARTAMENT", -1)
        sampAddChatMessage("{9966CC}FBI Tools {FFFFFF}| 1 - LSPD | 2 - SFPD | 3 - LVPD",-1)
      elseif dep == "1" then
        sampSendChat("/d LSPD, "..sampGetPlayerNickname(id):gsub('_', ' ')..", Причина изменения БД на п."..myid)
      elseif dep == '2' then
        sampSendChat("/d SFPD, "..sampGetPlayerNickname(id):gsub('_', ' ')..", Причина изменения БД на п."..myid)
      elseif dep == '3' then
        sampSendChat("/d LVPD, "..sampGetPlayerNickname(id):gsub('_', ' ')..", Причина изменения БД на п."..myid)
      end
    end
  else
    sampAddChatMessage("{9966CC}FBI Tools {ffffff}| Вы не сотрудник ФБР", -1)
  end
end

function fstate()
  if cfg.main.male == true then
    lua_thread.create(function()
      cfg.main.male = false
      wait(100)
      inicfg.save(cfg, 'fbitools/config.ini')
      sampAddChatMessage('{9966CC}FBI Tools {ffffff}| Вы изменили отыгровки на женские.', -1)
    end)
  else
    lua_thread.create(function()
      cfg.main.male = true
      wait(100)
      inicfg.save(cfg, 'fbitools/config.ini')
      sampAddChatMessage('{9966CC}FBI Tools {ffffff}| Вы изменили отыгровки на мужские.', -1)
    end)
  end
end

function fhud()
  if cfg.main.hud == false then
    lua_thread.create(function()
      cfg.main.hud = true
      wait(100)
      inicfg.save(cfg, 'fbitools/config.ini')
      sampAddChatMessage('{9966CC}FBI Tools {ffffff}| Инфо-бар включен.', -1)
    end)
  else
    lua_thread.create(function()
      cfg.main.hud = false
      wait(100)
      inicfg.save(cfg, 'fbitools/config.ini')
      sampAddChatMessage('{9966CC}FBI Tools {ffffff}| Инфо-бар выключен.', -1)
    end)
  end
end

function ticket(pam)
  local id, sum, prich = string.match(pam, '(%d+)%s+(%d+)%s+(.+)')
  if id == nil then
    sampAddChatMessage("{9966cc}FBI Tools {ffffff}| Введите: /ticket ID Сумма Причина", -1)
  end
  if id ~= nil and not sampIsPlayerConnected(id) then
    sampAddChatMessage("{9966CC}FBI Tools {ffffff}| Игрок с ID: "..id.." не подключен к серверу.", -1)
  end
  if id ~= nil and sampIsPlayerConnected(id) then
    if sum == nil then
      sampAddChatMessage("{9966cc}FBI Tools {ffffff}| Введите: /ticket ID Сумма Причина", -1)
    end
    if sum ~= nil then
      if prich == nil then
        sampAddChatMessage("{9966cc}FBI Tools {ffffff}| Введите: /ticket ID Сумма Причина", -1)
      end
      if prich ~= nil then
        if cfg.commands.ticket == true then
          if cfg.main.male == true then
            lua_thread.create(function()
              sampSendChat("/me достал бланк и ручку")
              wait(1200)
              sampSendChat("/do Бланк и ручка в руках.")
              wait(1200)
              sampSendChat("/me начинает заполнять бланк")
              wait(1200)
              sampSendChat("/do Бланк заполнен.")
              wait(1200)
              sampSendChat("/me передал бланк нарушителю")
              wait(1200)
              sampSendChat(string.format("/ticket %s %s %s", id, sum, prich))
            end)
          end
          if cfg.main.male == false then
            lua_thread.create(function()
              sampSendChat("/me достала бланк и ручку")
              wait(1200)
              sampSendChat("/do Бланк и ручка в руках.")
              wait(1200)
              sampSendChat("/me начинает заполнять бланк")
              wait(1200)
              sampSendChat("/do Бланк заполнен.")
              wait(1200)
              sampSendChat("/me передала бланк нарушителю")
              wait(1200)
              sampSendChat(string.format("/ticket %s %s %s", id, sum, prich))
            end)
          end
        else
          sampSendChat(string.format("/ticket %s %s %s", id, sum, prich))
        end
      end
    end
  end
end

function blg(pam)
  local id, frak, pric = string.match(pam, '(%d+)%s+(%a+)%s+(.+)')
  if id == nil then
    sampAddChatMessage("{9966cc}FBI Tools {ffffff}| Введите: /blg ID Фракция Причина", -1)
  end
  if id ~=nil and not sampIsPlayerConnected(id) then
    sampAddChatMessage("{9966CC}FBI Tools {ffffff}| Игрок с ID: "..id.." не подключен к серверу.", -1)
  end
  if id ~= nil and sampIsPlayerConnected(id) then
    if frak == nil then
      sampAddChatMessage("{9966cc}FBI Tools {ffffff}| Введите: /blg ID Фракция Причина", -1)
    end
    if frak ~= nil then
      if pric == nil then
        sampAddChatMessage("{9966cc}FBI Tools {ffffff}| Введите: /blg ID Фракция Причина", -1)
      end
      if pric ~= nil then
        name = sampGetPlayerNickname(id)
        rpname = name:gsub('_', ' ')
        sampSendChat(string.format("/d %s, благодарю %s за %s. Цените", frak, rpname, pric))
      end
    end
  end
end

function ft()
  second_window.v = not second_window.v
end

function sampev.onSendGiveDamage(playerId, damage, weapon, bodypart)
  tdmg = playerId
end

function r(pam)
  if #pam == 0 then
    sampAddChatMessage("{9966cc}FBI Tools {ffffff}| Введите: /r Текст.", -1)
  end
  if #pam ~= 0 then
    if cfg.main.tar == nil then
      sampSendChat(string.format('/r %s', pam))
    end
    if cfg.main.tar ~= nil then
      sampSendChat(string.format('/r %s %s', cfg.main.tar, pam))
    end
  end
end

function f(pam)
  if #pam == 0 then
    sampAddChatMessage("{9966cc}FBI Tools {ffffff}| Введите: /f Текст.", -1)
  end
  if #pam ~= 0 then
    if cfg.main.tar == nil then
      sampSendChat(string.format('/f %s', pam))
    end
    if cfg.main.tar ~= nil then
      sampSendChat(string.format('/f %s %s', cfg.main.tar, pam))
    end
  end
end

function rkeys.onHotKey(id, keys)
   if sampIsChatInputActive() or sampIsDialogActive() or isSampfuncsConsoleActive() then
      return false
   end
end

function onHotKey(id, keys)
   local sKeys = tostring(table.concat(keys, " "))
   for k, v in pairs(tBindList) do
      if sKeys == tostring(table.concat(v.v, " ")) then
         if tostring(v.text):len() > 0 then
            local bIsEnter = string.match(v.text, "(.)%[enter%]$") ~= nil
            if bIsEnter then
               sampProcessChatInput(v.text:gsub("%[enter%]$", ""))
            else
               sampSetChatInputText(v.text)
               sampSetChatInputEnabled(true)
            end
         end
      end
   end
end

function onScriptTerminate(scr)
   if scr == script.this then
      if doesFileExist(file) then
         os.remove(file)
      end
      local f = io.open(file, "w")
      if f then
         f:write(encodeJson(tBindList))
         f:close()
      end
   end
end

addEventHandler("onWindowMessage", function (msg, wparam, lparam)
   if msg == wm.WM_KEYDOWN or msg == wm.WM_SYSKEYDOWN then
      if tEditData.id > -1 then
         if wparam == key.VK_ESCAPE then
            tEditData.id = -1
            consumeWindowMessage(true, true)
         elseif wparam == key.VK_TAB then
            bIsEnterEdit.v = not bIsEnterEdit.v
            consumeWindowMessage(true, true)
         end
      end
   end
end)

function yk()
	ykwindow.v = not ykwindow.v
end

function fp()
  fpwindow.v = not fpwindow.v
end

function ak()
  akwindow.v = not akwindow.v
end

function shp()
  shpwindow.v = not shpwindow.v
end

function fyk(pam)
  local f = io.open('moonloader\\fbitools\\yk.txt')
  for line in f:lines() do
    if string.find(line, pam) then
      sampAddChatMessage(line, -1)
    end
  end
  f:close()
end

function ffp(pam)
  local f = io.open('moonloader\\fbitools\\fp.txt')
  for line in f:lines() do
    if string.find(line, pam) then
      sampAddChatMessage(line, -1)
    end
  end
  f:close()
end

function fak(pam)
  local f = io.open('moonloader\\fbitools\\ak.txt')
  for line in f:lines() do
    if string.find(line, pam) then
      sampAddChatMessage(line, -1)
    end
  end
  f:close()
end

function fshp(pam)
  local f = io.open('moonloader\\fbitools\\shp.txt')
  for line in f:lines() do
    if string.find(line, pam) then
      sampAddChatMessage(line, -1)
    end
  end
  f:close()
end

function gi()
  gint = getActiveInterior()
  sampAddChatMessage(gint, -1)
end

function isCharInCarDriver(ped)
    return isCharInAnyCar(ped) and getDriverOfCar(storeCarCharIsInNoSave(ped)) == ped
end

function fst(param)
  local hour = tonumber(param)
  if hour ~= nil and hour >= 0 and hour <= 23 then
    time = hour
    patch_samp_time_set(true)
    if time then
      setTimeOfDay(time, 0)
      sampAddChatMessage('{9966CC}FBI Tools {ffffff}| Время изменено на: '..time, -1)
    end
  else
  	sampAddChatMessage('{9966CC}FBI Tools {ffffff}| Значение времени должно быть в диапазоне от 0 до 23.', -1)
    patch_samp_time_set(false)
    time = nil
  end
end

function fsw(param)
  local weather = tonumber(param)
  if weather ~= nil and weather >= 0 and weather <= 45 then
    forceWeatherNow(weather)
    sampAddChatMessage('{9966CC}FBI Tools {ffffff}| Погода изменена на: '..weather, -1)
  else
  	sampAddChatMessage('{9966CC}FBI Tools {ffffff}| Значение погоды должно быть в диапазоне от 0 до 45.', -1)
  end
end

function patch_samp_time_set(enable)
  if enable and default == nil then
    default = readMemory(sampGetBase() + 0x9C0A0, 4, true)
    writeMemory(sampGetBase() + 0x9C0A0, 4, 0x000008C2, true)
  elseif enable == false and default ~= nil then
    writeMemory(sampGetBase() + 0x9C0A0, 4, default, true)
    default = nil
  end
end

function cc()
  local memory = require "memory"
  memory.fill(sampGetChatInfoPtr() + 306, 0x0, 25200)
  memory.write(sampGetChatInfoPtr() + 306, 25562, 4, 0x0)
  memory.write(sampGetChatInfoPtr() + 0x63DA, 1, 1)
end

function dkld()
  local tn = {}
  if isCharInAnyCar(PLAYER_PED) then
    if post ~= 7 and post ~= 12 and post ~= 13 and post ~= 14 and post ~= 18 and post ~= 21 and post ~= 22 and post ~= 23 and post ~= 24 and post ~= 25 and post ~= 26 and post ~= 27 and post ~= 28 and post ~= 29 and post ~= 30 and post ~= 31 then
      for id = 0, sampGetMaxPlayerId(true) do
        local result, ped = sampGetCharHandleBySampPlayerId(id)
        if result then
          local myPosX, myPosY, myPosZ = getCharCoordinates(PLAYER_PED)
          local posX, posY, posZ = getCharCoordinates(ped)
          local distance = getDistanceBetweenCoords3d(myPosX, myPosY, myPosZ, posX, posY, posZ)
          if distance <= 5.0 then
            local nskin = getCharModel(ped)
            if nskin ==280 or nskin == 265 or nskin == 266 or nskin == 267 or nskin == 281 or nskin == 282 or nskin == 288 or nskin == 284 or nskin == 285 or nskin == 304 or nskin == 305 or nskin == 306 or nskin == 307 or nskin == 309 or nskin == 283 then
              rpnp = sampGetPlayerNickname(id):gsub('_', ' ')
              table.insert(tn, rpnp)
            end
          end
        end
      end
      if frac == 'LSPD' then
        if cfg.main.tar == nil then
          if #tn == 0 then
            sampSendChat('/r Патруль г. Лос-Сантос. Напарников нету.')
          elseif #tn == 1 then
            sampSendChat('/r Патруль г. Лос-Сантос. Напарник: '..table.concat(tn, ", ")..'.')
          elseif #tn > 1 then
            sampSendChat('/r Патруль г. Лос-Сантос. Напарники: '..table.concat(tn, ", ")..'.')
          end
        else
          if #tn == 0 then
            sampSendChat('/r '..cfg.main.tar..' Патруль г. Лос-Сантос. Напарников нету.')
          elseif #tn == 1 then
            sampSendChat('/r '..cfg.main.tar..' Патруль г. Лос-Сантос. Напарник: '..table.concat(tn, ", ")..'.')
          elseif #tn > 1 then
            sampSendChat('/r '..cfg.main.tar..' Патруль г. Лос-Сантос. Напарники: '..table.concat(tn, ", ")..'.')
          end
        end
      elseif frac == 'SFPD' then
        if cfg.main.tar == nil then
          if #tn == 0 then
            sampSendChat('/r Патруль г. Сан-Фиерро. Напарников нету.')
          elseif #tn == 1 then
            sampSendChat('/r Патруль г. Сан-Фиерро. Напарник: '..table.concat(tn, ", ")..'.')
          elseif #tn > 1 then
            sampSendChat('/r Патруль г. Сан-Фиерро. Напарники: '..table.concat(tn, ", ")..'.')
          end
        else
          if #tn == 0 then
            sampSendChat('/r '..cfg.main.tar..' Патруль г. Сан-Фиерро. Напарников нету.')
          elseif #tn == 1 then
            sampSendChat('/r '..cfg.main.tar..' Патруль г. Сан-Фиерро. Напарник: '..table.concat(tn, ", ")..'.')
          elseif #tn > 1 then
            sampSendChat('/r '..cfg.main.tar..' Патруль г. Сан-Фиерро. Напарники: '..table.concat(tn, ", ")..'.')
          end
        end
      elseif frac == 'LVPD' then
        if cfg.main.tar == nil then
          if #tn == 0 then
            sampSendChat('/r Патруль г. Лас-Вентурас. Напарников нету.')
          elseif #tn == 1 then
            sampSendChat('/r Патруль г. Лас-Вентурас. Напарник: '..table.concat(tn, ", ")..'.')
          elseif #tn > 1 then
            sampSendChat('/r Патруль г. Лас-Вентурас. Напарники: '..table.concat(tn, ", ")..'.')
          end
        else
          if #tn == 0 then
            sampSendChat('/r '..cfg.main.tar..' Патруль г. Лас-Вентурас. Напарников нету.')
          elseif #tn == 1 then
            sampSendChat('/r '..cfg.main.tar..' Патруль г. Лас-Вентурас. Напарник: '..table.concat(tn, ", ")..'.')
          elseif #tn > 1 then
            sampSendChat('/r '..cfg.main.tar..' Патруль г. Лас-Вентурас. Напарники: '..table.concat(tn, ", ")..'.')
          end
        end
      end
    end
    if post == 7 or post == 12 or post == 13 or post == 14 or post == 18 then
      local tn = {}
      for id = 0, sampGetMaxPlayerId(true) do
        local result, ped = sampGetCharHandleBySampPlayerId(id)
        if result then
          local myPosX, myPosY, myPosZ = getCharCoordinates(PLAYER_PED)
          local posX, posY, posZ = getCharCoordinates(ped)
          local distance = getDistanceBetweenCoords3d(myPosX, myPosY, myPosZ, posX, posY, posZ)
          if distance <= 5.0 then
            local nskin = getCharModel(ped)
            if nskin ==280 or nskin == 265 or nskin == 266 or nskin == 267 or nskin == 281 or nskin == 282 or nskin == 288 or nskin == 284 or nskin == 285 or nskin == 304 or nskin == 305 or nskin == 306 or nskin == 307 or nskin == 309 or nskin == 283 then
              rpnp = sampGetPlayerNickname(id):gsub('_', ' ')
              table.insert(tn, rpnp)
            end
          end
        end
      end
      if cfg.main.tar == nil then
        if #tn == 0 then
          sampSendChat('/r Пост: '..getNameSphere(post)..'. Напарников нету.')
        elseif #tn == 1 then
          sampSendChat('/r Пост: '..getNameSphere(post)..'. Напарник: '..table.concat(tn, ", ")..'.')
        elseif #tn > 1 then
          sampSendChat('/r Пост: '..getNameSphere(post)..'. Напарники: '..table.concat(tn, ", ")..'.')
        end
      else
        if #tn == 0 then
          sampSendChat('/r '..cfg.main.tar..' Пост: '..getNameSphere(post)..'. Напарников нету.')
        elseif #tn == 1 then
          sampSendChat('/r '..cfg.main.tar..' Пост: '..getNameSphere(post)..'. Напарник: '..table.concat(tn, ", ")..'.')
        elseif #tn > 1 then
          sampSendChat('/r '..cfg.main.tar..' Пост: '..getNameSphere(post)..'. Напарники: '..table.concat(tn, ", ")..'.')
        end
      end
    end
    if post == 21 then
    	local tn = {}
      	for id = 0, sampGetMaxPlayerId(true) do
        local result, ped = sampGetCharHandleBySampPlayerId(id)
        if result then
          local myPosX, myPosY, myPosZ = getCharCoordinates(PLAYER_PED)
          local posX, posY, posZ = getCharCoordinates(ped)
          local distance = getDistanceBetweenCoords3d(myPosX, myPosY, myPosZ, posX, posY, posZ)
          if distance <= 5.0 then
            local nskin = getCharModel(ped)
            if nskin ==280 or nskin == 265 or nskin == 266 or nskin == 267 or nskin == 281 or nskin == 282 or nskin == 288 or nskin == 284 or nskin == 285 or nskin == 304 or nskin == 305 or nskin == 306 or nskin == 307 or nskin == 309 or nskin == 283 then
              rpnp = sampGetPlayerNickname(id):gsub('_', ' ')
              table.insert(tn, rpnp)
            end
          end
        end
      end
      if cfg.main.tar == nil then
      	if #tn == 0 then
      		sampSendChat('/r Патруль опасного района. Напарников нету.')
      	elseif #tn == 1 then
      		sampSendChat('/r Патруль опасного района. Напарник:'..table.concat(tn, ", ")..'.')
      	elseif #tn > 1 then
      		sampSendChat('/r Патруль опасного района. Напарники:'..table.concat(tn, ", ")..'.')
      	end
      else
      	if #tn == 0 then
      		sampSendChat('/r '..cfg.main.tar..' Патруль опасного района. Напарников нету.')
      	elseif #tn == 1 then
      		sampSendChat('/r '..cfg.main.tar..' Патруль опасного района. Напарник:'..table.concat(tn, ", ")..'.')
      	elseif #tn > 1 then
      		sampSendChat('/r '..cfg.main.tar..' Патруль опасного района. Напарники:'..table.concat(tn, ", ")..'.')
      	end
      end
    end
    if post == 22 then
      local tn = {}
      for id = 0, sampGetMaxPlayerId(true) do
        local result, ped = sampGetCharHandleBySampPlayerId(id)
        if result then
          local myPosX, myPosY, myPosZ = getCharCoordinates(PLAYER_PED)
          local posX, posY, posZ = getCharCoordinates(ped)
          local distance = getDistanceBetweenCoords3d(myPosX, myPosY, myPosZ, posX, posY, posZ)
          if distance <= 5.0 then
            local nskin = getCharModel(ped)
            if nskin ==280 or nskin == 265 or nskin == 266 or nskin == 267 or nskin == 281 or nskin == 282 or nskin == 288 or nskin == 284 or nskin == 285 or nskin == 304 or nskin == 305 or nskin == 306 or nskin == 307 or nskin == 309 or nskin == 283 then
              rpnp = sampGetPlayerNickname(id):gsub('_', ' ')
              table.insert(tn, rpnp)
            end
          end
        end
      end
      if cfg.main.tar == nil then
      	if #tn == 0 then
      		sampSendChat('/r Патруль ЛВа. Напарников нету.')
      	elseif #tn == 1 then
      		sampSendChat('/r Патруль ЛВа. Напарник: '..table.concat(tn, ", ")..'.')
      	elseif #tn > 1 then
      		sampSendChat('/r Патруль ЛВа. Напарники: '..table.concat(tn, ", ")..'.')
      	end
      else
      	if #tn == 0 then
      		sampSendChat('/r '..cfg.main.tar..' Патруль ЛВа. Напарников нету.')
      	elseif #tn == 1 then
      		sampSendChat('/r '..cfg.main.tar..' Патруль ЛВа. Напарник: '..table.concat(tn, ", ")..'.')
      	elseif #tn > 1 then
      		sampSendChat('/r '..cfg.main.tar..' Патруль ЛВа. Напарники: '..table.concat(tn, ", ")..'.')
      	end
      end
    end
    if post == 23 then
      if frac == 'LSPD' then
        sampSendChat('/d SFPD, пересекаю вашу юрисдикцию, погоня.')
      elseif frac == 'SFPD' then
        sampSendChat('/d LSPD, пересекаю вашу юрисдикцию, погоня.')
      elseif frac == 'LVPD' then
        sampShowDialog(1404, '{9966CC}FBI Tools{ffffff} | Пересечение юрисдикции', '{ffffff}Выберите юрисдикцию для пересечения', '{ffffff}LSPD', '{ffffff}SFPD', 0)
      end
    end
    if post == 24 then
      if frac == 'LSPD' then
        sampSendChat('/d LVPD, пересекаю вашу юрисдикцию, погоня.')
      elseif frac == 'LVPD' then
        sampSendChat('/d LSPD, пересекаю вашу юрисдикцию, погоня.')
      elseif frac == 'SFPD' then
        sampShowDialog(1405, '{9966CC}FBI Tools{ffffff} | Пересечение юрисдикции', '{ffffff}Выберите юрисдикцию для пересечения', '{ffffff}LSPD', '{ffffff}LVPD', 0)
      end
    end
    if post == 25 then
      if frac == 'LSPD' then
        sampSendChat('/d LVPD, пересекаю вашу юрисдикцию, погоня.')
      elseif frac == 'LVPD' then
        sampSendChat('/d LSPD, пересекаю вашу юрисдикцию, погоня.')
      elseif frac == 'SFPD' then
        sampShowDialog(1405, '{9966CC}FBI Tools{ffffff} | Пересечение юрисдикции', '{ffffff}Выберите юрисдикцию для пересечения', '{ffffff}LSPD', '{ffffff}LVPD', 0)
      end
    end
    if post == 26 then
      if frac == 'LSPD' then
        sampSendChat('/d LVPD, пересекаю вашу юрисдикцию, погоня.')
      elseif frac == 'LVPD' then
        sampSendChat('/d LSPD, пересекаю вашу юрисдикцию, погоня.')
      elseif frac == 'SFPD' then
        sampShowDialog(1405, '{9966CC}FBI Tools{ffffff} | Пересечение юрисдикции', '{ffffff}Выберите юрисдикцию для пересечения', '{ffffff}LSPD', '{ffffff}LVPD', 0)
      end
    end
    if post == 27 then
      if frac == 'LVPD' then
        sampSendChat('/d SFPD, пересекаю вашу юрисдикцию, погоня.')
      elseif frac == 'SFPD' then
        sampSendChat('/d LVPD, пересекаю вашу юрисдикцию, погоня.')
      elseif frac == 'LSPD' then
        sampShowDialog(1406, '{9966CC}FBI Tools{ffffff} | Пересечение юрисдикции', '{ffffff}Выберите юрисдикцию для пересечения', '{ffffff}SFPD', '{ffffff}LVPD', 0)
      end
    end
    if post == 28 then 
      if frac == 'LVPD' then
        sampSendChat('/d SFPD, пересекаю вашу юрисдикцию, погоня.')
      elseif frac == 'SFPD' then
        sampSendChat('/d LVPD, пересекаю вашу юрисдикцию, погоня.')
      elseif frac == 'LSPD' then
        sampShowDialog(1406, '{9966CC}FBI Tools{ffffff} | Пересечение юрисдикции', '{ffffff}Выберите юрисдикцию для пересечения', '{ffffff}SFPD', '{ffffff}LVPD', 0)
      end
    end
    if post == 29 then
      if frac == 'LSPD' then
        sampSendChat('/d SFPD, пересекаю вашу юрисдикцию, погоня.')
      elseif frac == 'SFPD' then
        sampSendChat('/d LSPD, пересекаю вашу юрисдикцию, погоня.')
      elseif frac == 'LVPD' then
        sampShowDialog(1404, '{9966CC}FBI Tools{ffffff} | Пересечение юрисдикции', '{ffffff}Выберите юрисдикцию для пересечения', '{ffffff}LSPD', '{ffffff}SFPD', 0)
      end
    end
    if post == 30 then
      if frac == 'LSPD' then
        sampSendChat('/d SFPD, пересекаю вашу юрисдикцию, погоня.')
      elseif frac == 'SFPD' then
        sampSendChat('/d LSPD, пересекаю вашу юрисдикцию, погоня.')
      elseif frac == 'LVPD' then
        sampShowDialog(1404, '{9966CC}FBI Tools{ffffff} | Пересечение юрисдикции', '{ffffff}Выберите юрисдикцию для пересечения', '{ffffff}LSPD', '{ffffff}SFPD', 0)
      end
    end
    if post == 31 then
      if frac == 'LSPD' then
        sampSendChat('/d SFPD, пересекаю вашу юрисдикцию, погоня.')
      elseif frac == 'SFPD' then
        sampSendChat('/d LSPD, пересекаю вашу юрисдикцию, погоня.')
      elseif frac == 'LVPD' then
        sampShowDialog(1404, '{9966CC}FBI Tools{ffffff} | Пересечение юрисдикции', '{ffffff}Выберите юрисдикцию для пересечения', '{ffffff}LSPD', '{ffffff}SFPD', 0)
      end
    end
  end
  if not isCharInAnyCar(PLAYER_PED) then
    if post ~= nil then
      local pn = {}
      for id = 0, sampGetMaxPlayerId(true) do
        local result, ped = sampGetCharHandleBySampPlayerId(id)
        if result then
          local myPosX, myPosY, myPosZ = getCharCoordinates(PLAYER_PED)
          local posX, posY, posZ = getCharCoordinates(ped)
          local distance = getDistanceBetweenCoords3d(myPosX, myPosY, myPosZ, posX, posY, posZ)
          if distance <= 50.0 then
            local nskin = getCharModel(ped)
            if nskin ==280 or nskin == 265 or nskin == 266 or nskin == 267 or nskin == 281 or nskin == 282 or nskin == 288 or nskin == 284 or nskin == 285 or nskin == 304 or nskin == 305 or nskin == 306 or nskin == 307 or nskin == 309 or nskin == 283 then
              rpnp = sampGetPlayerNickname(id):gsub('_', ' ')
              table.insert(pn, rpnp)
            end
          end
        end
      end
      if cfg.main.tar == nil then
        if #pn == 0 then
          sampSendChat('/r Пост: '..getNameSphere(post)..'. Напарников нету.')
        elseif #pn == 1 then
          sampSendChat('/r Пост: '..getNameSphere(post)..'. Напарник: '..table.concat(pn, ", ")..'.')
        elseif #pn > 1 then
          sampSendChat('/r Пост: '..getNameSphere(post)..'. Напарники: '..table.concat(pn, ", ")..'.')
        end
      else
        if #pn == 0 then
          sampSendChat('/r '..cfg.main.tar..' Пост: '..getNameSphere(post)..'. Напарников нету.')
        elseif #pn == 1 then
          sampSendChat('/r '..cfg.main.tar..' Пост: '..getNameSphere(post)..'. Напарник: '..table.concat(pn, ", ")..'.')
        elseif #pn > 1 then
          sampSendChat('/r '..cfg.main.tar..' Пост: '..getNameSphere(post)..'. Напарники: '..table.concat(pn, ", ")..'.')
        end
      end
    end
  end
end

function mcheck()
  peds = getAllChars()
  if peds ~= nil then
    lua_thread.create(function()
      for _, hm in pairs(peds) do
        _ , id = sampGetPlayerIdByCharHandle(hm)
        _ , m = sampGetPlayerIdByCharHandle(PLAYER_PED)
        if id ~= -1 and id ~= m and doesCharExist(hm) and sampIsPlayerConnected(id) then
          local x, y, z = getCharCoordinates(hm)
          local mx, my, mz = getCharCoordinates(PLAYER_PED)
          local dist = getDistanceBetweenCoords3d(mx, my, mz, x, y, z)
          if dist <= 200 then
            mcheckb = true
            _ , idofplayercar = sampGetPlayerIdByCharHandle(hm)
            sampSendChat('/mdc '..idofplayercar)
            wait(1200)
            mcheckb = false
          end
        end
      end
    end)
  end
end

function gppc()
  local x, y, z = getCharCoordinates(playerPed)
  sampAddChatMessage(string.format('%d %d %d', x, y, z), -1)
  print(string.format('%d %d %d', x, y, z))
end

function ftinfo()
  local ftinfoone = [[
  {9966cc}1 {ffffff}- Автообновление скрипта
  {9966cc}2 {Ffffff}- Автодоклады (команда /dkld)
  {9966cc}3 {ffffff}- Автодоклады о пересечении юрисдикции (команда /dkld)
  {9966cc}4 {ffffff}- Полностью переписан /fthelp
  {9966cc}5 {ffffff}- Команды /fst и /fsw для изменения погоды и времени
  {9966cc}6 {ffffff}- Команды /yk /ak /fp /shp для открытия шпор
  {9966cc}7 {ffffff}- Команды /fyk /fak /fp /fshp для поиска по шпоре
  {9966cc}8 {ffffff}- Добавлен внутриигровой биндер
  {9966cc}9 {ffffff}- Добавлен автоклист при смерти
  {9966cc}10 {ffffff}- При использовании /st без ввода ID отправляет просто просьбу остановиться с тэгом вашей фракции
  {9966cc}11 {ffffff}- Команда /cc для очистки чата
  {9966cc}12 {ffffff}- Теперь названия автомобилей в /st всегда отображаются корректно
  {9966cc}13 {ffffff}- Команда /mcheck которая пробивает всех игроков по /mdc, которые находятся в 200 метров от вас
  ]]
  sampShowDialog(346253, "{9966cc}FBI Tools {ffffff}| Обновление", ftinfoone, "»", "x", 0)
end

function hudpos()
  changetextpos = not changetextpos
end

function did()
  sampAddChatMessage(sampGetCurrentDialogId(), -1)
end