script_name('FBI Tools')
script_version('2.5')
script_author('Sesh Jefferson and Thomas Lawson') -- код биндера от DonHomka
require 'lib.moonloader'
require 'lib.sampfuncs'

--REQUESTS--
local encoding = require 'encoding'
local sf = require 'sampfuncs'
local key = require "vkeys"
local inicfg = require 'inicfg'
local sp = require 'lib.samp.events'
local dlstatus = require('moonloader').download_status
encoding.default = 'CP1251'
u8 = encoding.UTF8
------------
--GLOBALS--
ctag = " FBI Tools {ffffff}|"
mcheckb = false
rabden = false
frak = nil
rang = nil
wfrac = nil
warnst = false
changetextpos = false
opyatstat = false
gmegafhandle = nil
gmegafid = nil
gmegaflvl = nil
gmegaffrak = nil
nikk = nil
ttt = nil
tLastKeys = {}

local shpt = [[
Пока что вы не настроили шпору.
Что бы вставить сюда свой текст вам нужно выполнить ряд дейтсвий:
1. Открыть папку fbitools которая находится в папке moonloader
2. Открыть файл shp.txt любым блокнотом
3. Изменить текст в нем на какой вам нужен
4. Сохранить файл
]]
local ykt = [[
Раздел I

1. Избиение, нанесение телесных повреждений.
1.1 За избиение или нанесение телесных повреждений, преступнику присваивается 2 уровень розыска.
[ Удары ножом, битой, лопатой, кулаком и ногой. ]

2. Вооружённое нападение, использование огнестрельного оружия.
2.1 За вооружённое нападение на гражданских, преступнику присваивается 3 уровень розыска + изъятие лицензии на оружие.
2.2 За вооружённое нападение на гос.сотрудников, преступнику присваивается 6 уровень розыска + изъятие лицензии на оружие + запрет на выход под залог [ООП].
[ Розыск выдаётся за использование огнестрельного оружия с целью нанесения физического вреда или повреждения/уничтожения имущества. ]
В рамках самообороны разрешено использовать оружие, но только при условии наличия соответствующей лицензии. Если лицензии нет, обороняющийся всё равно задерживается по статье за "Ношение оружия без лицензии". ]

3. Убийство.
3.1 За убийство или заказ убийства, преступнику присваивается 3 уровень розыска.
3.2 За убийство военнослужащего при исполнении, преступнику присваивается 4 уровень розыска.
3.3 За убийство полицейского при исполнении, преступнику присваивается 5 уровень розыска.
3.4 За убийство агента ФБР при исполнении, преступнику присваивается 6 уровень розыска.

4. Хулиганство, попрошайничество.
4.1 За хулиганство и неадекватное поведение в общественных местах, преступнику присваивается 1 уровень розыска.
[ К хулиганству приравнивается любое нарушение общественного порядка: Стояние на крыше автомобиля, нахождение на крыше остановки, ложный вызов на экстренную линию, флуд в любой чат одним и тем же сообщением.
Если человек толкает пустую машину с проезжей части на обочину, это не считается хулиганством. ]
4.2 За попрошайничество в общественных местах, преступнику присваивается 1 уровень розыска.

5. Оскорбление.
5.1 За оскорбление в любой форме, преступнику присваивается 2 уровень розыска.
[ Оскорбление – это любая попытка перехода на личности в общении, например обращение – "мусор" в отношении представителя силовых структур. Так же оскорблением можно считать затрагивание расы, национальности [Ниггер, макаронник, узкоглазый и т.п.].
В случае если оскорбления идут в крайне неадекватной форме, при задержании следует ставить запрет на рассмотрение дела о выпуске под залог [Запрет права на адвоката].

6. Угон транспортного средства.
6.1 За угон транспортного средства, преступнику присваивается 2 уровень розыска.
[ Угон считается угоном лишь тогда, когда преступник сдвинулся с места находясь за рулем транспорта – в иных случаях следует задерживать за "Проникновение", в зависимости от ситуации ограничиваясь предупреждением.
Если угон происходит через взлом авто, так же следует обвинять в порче имущества. ]

7. Неподчинение, попытка скрыться от полиции, побег.
7.1 За неподчинение правоохранительным органам, преступнику присваивается 1 уровень розыска.
[ Неподчинением следует считать отказ или игнорирование законных требований офицера, как пример: Отказ покинуть салон авто или отказ покинуть место проведения тренировки гос. служащих.
Отказ оплачивать штраф или подписывать протокол о задержании неподчинением не является! ]
7.2 За попытку скрыться от сотрудников правоохранительных органов, преступнику присваивается 2 уровень розыска.
7.3 За побег из тюрьмы при помощи ключей от камер [/escape], преступнику присваивается 6 уровень розыска и запрет на выход под залог [ООП].
[ Ключи подвергаются изъятию из инвентаря лишь при 3 и выше уровне розыска [Общее кол-во зв. по действующим статьям] и за офф от ареста.
При проведении рейдов на ОПГ, у членов ОПГ розыск уже изначально 6+, так как рейд проводится после проведённого расследования против данной ОПГ.
Помните, ключи – как и лицензии, являются предметом ценности, за злоупотребление полномочиями и командами, будет следовать наказание вплоть до увольнения с занесением в ЧС гос. структур. ]

8. Соучастие в преступлении.
8.1 За соучастие в преступлении, преступнику присваивается тоже же наказание, что и организатору.
[ Пример: Таксист везёт пассажира, если оскорбляет пассажир, а водитель пытается скрыться от погони, заместо того чтобы содействовать задержанию – он соучастник.
Однако если водитель оскорбляет, а невинный пассажир едет рядом, то пассажир соучастником не является, так как он не причастен к преступлению.

Не следует путать с содействием преступлению, если пассажир к примеру подсказывает водителю как/куда ехать или например провоцирует офицеров своими криками, то это такое же соучастие. ]

9. Оружие.
9.1 За ношение оружия в открытом виде, кроме гос. служащих находящихся при исполнении служебных обязанностей – оружие изымается.
9.2 За ношение оружия без лицензии, преступнику присваивается 1 уровень розыска и штраф в размере 2000$.
9.3 За изготовление оружие нелегальным способом, его приобретение или его продажу, преступнику присваивается 3 уровень розыска с последующим изъятием оружия и/или материалов.
[ Нелегальным способом является изготовление оружия из материалов в гетто. Легальный способ – покупка у NPC в АММО. ]

10. Наркотики и материалы.
10.1 За хранение или перевозку наркотиков, преступнику присваивается 3 уровень розыска с изъятием наркотических веществ.
10.2 За хранение или перевозку материалов, преступнику присваивается 3 уровень розыска с изъятием материалов.
10.3 За употребление наркотиков, преступнику присваивается 3 уровень розыска с последующим изъятием наркотических веществ.
[ Отыгровки навроде – "/me съел конфету", с целью употребить наркотик и избежать наказание – НЕ являются адекватной РП-отыгровкой.
Если вы видите в чате "Nick_Name употребил(а) наркотик", то смело задерживайте преступника, при обязательном условии что это происходит прямо на ваших глазах и вы напрямую видите персонаж игрока.
При употреблении наркотических веществ, розыск следует так же выдавать и за их хранение. ]
10.4 За употребление наркотических веществ гос. служащим, сотрудник увольняется из организации и получает 3 уровень розыска.
10.5 За рекламу/продажу/покупку наркотиков или материалов, преступнику присваивается 2 уровень розыска и изъятие наркотиков/материалов.
10.6 За изготовление наркотиков/психотропных веществ, присваивается 3 уровень розыска.
[ Относится так же к выращиванию "марихуаны" на фермах. Обвинению подлежат все фермеры, заместители и хозяева фермы. Простые работники обвинению не подлежат. ]


11. Уничтожение и повреждение имущества.
11.1 За повреждение чужого имущества, преступнику присваивается 1 уровень розыска и штраф в размере 5000$
11.2 За уничтожение чужого имущества, преступнику присваивается 4 уровень розыска, штраф в размере 15000$ и полная выплата компенсации за нанесённый ущерб.
[ Уничтожением является любое действие, после которого предмет взорвался или исчез [Перевернули, утопили, расстреляли и т.д.]


12. Проникновение на запретную территорию.
12.1 За проникновение на охраняемую территорию, преступнику присваивается 2 уровень розыска.
[ Территории воинских частей и формирований, офис ФБР, второй и выше этажи мэрии, места тренировок - розыск следует выдавать после повторного нарушения границы. Пробивание блок постов, проникновение на территории находящиеся под оцеплением силами правопорядка - розыск следует выдавать сразу же, после нарушения границы.
Если преступник совершил правонарушение на территории, то розыск следует выдавать так же и по этой статье (оскорбил и уехал, испортил имущество, угнал т/с и т.д.). ].
12.2 За проникновение на частную территорию, преступнику присваивается 1 уровень розыска.
[ Проникновение в транспорт является незаконным, если оно осуществляется без согласия владельца/арендатора данного транспорта.
Крыша SFN так же является частной территорией ].


13. Бандитизм.
13.1 За ограбление граждан или организаций, преступнику присваивается 3 уровень розыска с последующим изъятием награбленного имущества.
[ При ограблениях на форму, материалы или наркотики, розыск следует выдавать так же и за хранение. ]
13.2 За вымогательство, обвиняемому присваивается 2 уровень розыска.
[ "– Механик, либо ты сейчас отдаёшь нам все свои деньги, либо мы покромсаем твоё корыто до состояния металлолома!", "– У меня есть док-ва твоего самовола, либо ты сейчас платишь мне 50000$, либо я на это пожалуюсь и тебя уволят!" – примеры оснований для обвинений в вымогательстве. ]
13.3 За угрозы, обвиняемому присваивается 1 уровень розыска.
[ Угрозы наподобие "Тебя понизят/уволят/занесут в ЧС гос. структур" – наказываются по этой статье, но если гражданин к примеру говорит "Я буду жаловаться!" – это не является основанием. ]
13.4 За провокации, обвиняемому присваивается 2 уровень розыска.
[ Выкрики подобно "– Давай! Стреляй, или ты боишься?!", оскорбительные жесты вроде "/me показал средний палец", "/me плюнул в лицо" и т.п. – примеры оснований для обвинений в провокации. ]
13.5 За мошенничество, обвиняемому присваивается 2 уровень розыска.
[ Пример: Таксист на арендованном гос. авто с включенным счётчиком [/fare] вымогает деньги/чаевые наперёд, а при отказе их дать – высаживает из авто. Подобное является мошенничеством и за это следует задерживать.
"– Хочешь расскажу, как взламывать банкомат? Заплати деньги и скажу." – NonRP-мошенничество, в этой ситуации обязательно сообщите в репорт администрации. ]
13.6 За попытку взлома/взлом базы данных полиции, преступнику присваивается 1 уровень розыска.

14. Проституция и изнасилование.
14.1 За предложение интимных услуг, преступнику присваивается 1 уровень розыска.
14.2 За изнасилование преступнику присваивается 3 уровень розыска.

15. Дача ложных показаний, использование фальшивых документов.
15.1 За укрывательство преступлений/преступников/фактов/улик и прочей важной для следствия информации или за дачу ложных показаний, преступнику присваивается 2 уровень розыска.
15.2 За использование фальшивых документов или удостоверений, присваивается 1 уровень розыска.


16. Клевета.
16.1 За клевету на гражданское или государственное лицо, присваивается 1 уровень розыска.
16.2 За клевету на государственные и частные организации, присваивается 2 уровень розыска.


17. Покупка, продажа и хранение военной формы.
17.1 За продажу военного имущества, военный подлежит увольнению, занесению в черный список армии, так же ему присваивается 3 уровень розыска.
17.2 За покупку военной формы, преступнику присваивается 2 уровень розыска, форма подлежит изъятию.
17.3 За хранение/ношение купленной или ворованной военной формы, преступнику присваивается 2 уровень розыска, форма подлежит изъятию.
[ Или хранение, или ношение – это одно и тоже преступление и при задержании обвинение следует выдавать лишь по одному виду статьи. ]

18. Покупка, кража и продажа ключей от камер.
18.1 За покупку/продажу/кражу ключей от камеры, преступнику присваивается 6 уровень розыска.

19. Коррупция.
19.1 За предложение взятки, преступнику присваивается 2 уровень розыска.
19.2 За принятие взятки, гос. сотрудник несет наказание в виде присвоения 2 уровня розыска и увольнения.
[ Чтобы офицер понёс наказание за коррупцию, вы должны предоставить руководству РП-доказательства, к примеру: Запись диктофона или видео с видеорегистратора, с полагающейся РП-отыгровкой.
Полиции запрещается полностью манипулировать ситуацией, не оставляя жертвам ни единого шанса, за бредовые махинации вроде "/me изъял все предметы для видеосъёмки, диктофон, часы и т.п.", будет следовать наказание за PowerGaming. ]

20. Терроризм и взятие в заложники.
20.1 За совершение теракта, захват зданий и помещений, преступнику присваивается 6 уровень розыска, лишение всех лицензий и запрет на выход под залог [ООП].
[ Террористический акт — совершение взрыва, поджога или иных действий, устрашающих население и создающих опасность гибели человека, посеяв страх и неуверенность в его несокрушимости среди населения.
Стрельба в воздух среди населения, стрельба в людей, взрывы – считается терактом. Вооруженное нападение на одного человека, террористическим актом не является. ]
20.2 За похищение или взятие в заложники граждан или гос. сотрудников, преступнику присваивается 4 уровень розыска, изъятие лицензии на оружие и запрет на выход под залог [ООП].

21. Нелегальные мероприятия/организации. Митинги.
21.1 За организацию нелегальных мероприятий/митингов (Без согласия мэра, премьер-министра или шерифа окрестности, которое стало местом проведения), организаторам присваивается 2 уровень розыска.
21.2 За создание нелегальных организаций (Без согласия мэра или премьер-министра), организаторы и работники получают наказание в виде 3 уровня розыска.

22. Браконьерство.
22.1 За рыбалку без лицензии [Браконьерство], преступнику присваивается 1 уровень розыска.

23. Неуплата штрафа.
23.1 За неуплату штрафа, преступнику присваивается 2 уровень розыска.

24. Игнорирование спец.сирен.
24.1 За игнорирование специальных сирен при движении государственного транспорта, преступнику присваивается 1 уровень розыска.


Раздел II

1. Неординарные ситуации.
1.1 За уход в "АФК" на 30 с лишним секунд или за офф от ареста, преступнику присваивается 6 уровень розыска с причиной: "Уход" и запрет на выход под залог [ООП].
1.2 За превышение полномочий адвоката [освобождение ООП], адвокату присваивается 3 уровень розыска и запрет на выход под залог [Данное деяние приравнивается к соучастию ООП].
[ Освобожденный преступник задерживается по статье за побег с места заключения (статья 7.3) ].
1.3 За агитацию в день выборов – присваивается 6 уровень розыска и запрет на выход под залог [ООП].
[ Запрещена агитация путём подачи объявлений, в эфирах радио, в публичных выступлениях, выкриках и СМС-рассылке. ]


2. Судебные разбирательства.
2.1 За уклонение от участия в судебном разбирательстве, преступнику присваивается 3 уровень розыска и запрет на выход под залог [ООП], так же происходит понижение/увольнение из организации, если он там состоит, если это невозможно, то ему присваивается штраф устанавливаемый судом.
2.2 За отказ в выплате денежной компенсации, преступнику присваивается 2 уровень розыска и запрет на выход под залог [ООП], так же происходит понижение/увольнение из организации, если он там состоит, если это невозможно, то ему присваивается штраф устанавливаемый судом.
2.3 За уклонение от уголовного наказания [АФК/выход из игры/неоправданный неактив и т.п.], преступнику присваивается 3 уровень розыска и запрет на выход под залог [ООП], так же происходит понижение/увольнение из организации, если он там состоит, если же это невозможно, то ему присваивается штраф устанавливаемый судом.
2.4 За нарушение порядка на судебном заседании [Касается всех участников процесса, включая судебную комиссию], преступнику присваивается 2 уровень розыска и запрет на выход под залог [ООП], так же если не удается задержать нарушителя, то добавляется статья 2.3.



ПРИМЕЧАНИЕ К УГОЛОВНОМУ КОДЕКСУ:


Знание пунктов 2 и 3 второго раздела УК не является обязательным, так как они используются исключительно в судебных процессах.

Так как на нашем проекте нет судов, которые определяют тяжесть преступления – все нарушения законов совмещаются – по каждому преступлению идёт отдельное обвинение, как примеры:
Человека задержали за употребление наркотиков, при обыске у него нашли ещё наркотики – следует выдавать розыск как за употребление, так и за хранение.
Человека задержали за угон частного т/с, при задержании следует выдавать розыск как за угон, так и за проникновение в транспорт.

Так же, при условии что:
1. Преступник адекватен;
2. Идёт на встречу правоохранительным органам;
3. Был задержан не по статьям, за которые следует 10-14.
Задержанному разрешается сбавить срок до минимального, с сохранением лицензий, но не запрещёнки.
Суть: Если задержанный признаёт свою вину, раскаивается и после же вменяемо отыгрывает с офицером полноценный допрос, где даёт пояснение своих мотивов свершения данного преступления – он получает право на кратчайшее освобождение из СИЗО [/clear –> /su 1 Чистосердечное признание –> /arrest].
]]
local akt = [[
1-я часть – для водителей:

0.0 Езда без включенных фар.
0.1 За езду без фар дальнего света [/clist 33], нарушителю следует наказание в виде предупреждения и лекции от полиции.
[ По статье не следует задерживать, но если нарушитель проигнорировал/не подчинился требованиям сделанным в доступной для него форме включить фары [Любой /clist, кроме 0], офицер может произвести задержание по статье "Неподчинение".
Сотрудники гос. структур имеют право выключать фары при необходимости. ]
1.1 Езда по встречной полосе.
1.2 Езда по встречной: штраф в размере [LVL x 500$], в случае же неуплаты штрафа – изъятие водительских прав и задержание по статье за неуплату штрафов.
[ Объезд по встречной полосе не считается нарушением, если он стал следствием из-за действий и нарушения ПДД другим водителем ]
2.0 Превышение скорости.
2.1 Превышение скорости: штраф в размере [LVL x 500$].
3.0 Наезд на пешехода.
3.1 Наезд на пешехода: 2 уровень розыска + изъятие водительских прав.
4.0 Парковка в неположенном месте.
4.1 Парковка в неположенном месте наземным транспортным средством: изъятие водительских прав.
4.2 Парковка в неположенном месте воздушным транспортным средством: изъятие лицензии пилота.
5.0 ДТП, уход с места ДТП.
5.1 Виновник ДТП: штраф в размере [LVL x 500$], выплата материального ущерба.
5.2 Покидание места ДТП: 3 уровень розыска, штраф в размере [LVL x 500$] + изъятие прав.
6.0 Управление транспортным средством в нетрезвом состоянии.
6.1 Управление ТС в наркотическом или алкогольном опьянении: 1 уровень розыска + изъятие прав.
7.0 Создание аварийной ситуации.
7.1 Создание аварийной ситуации [АФК на дороге будучи водителем авто, намеренная помеха движению, подрезания]: Изъятие прав и штраф [LVL x 500$].
[ Запрещается изымать водительские права, пока человек находится в АФК ]
8.0 Движение в неположенном месте.
8.1 Движение по тротуарам, обочинам и ж/д путям: штраф в размере [LVL x 500$], в случае же неуплаты штрафа – изъятие водительских прав и задержание по статье за неуплату штрафов.

2-я часть – для пешеходов:

10.1 Создание аварийной ситуации [АФК на дороге, ходьба по проезжей части, перегораживание движения и намеренные прыжки под машину]:
[ Для людей проживающих в штате от 1 до 2-х лет : давать предупреждение, при повторном нарушении выписывать штраф.
Для людей проживающих в штате от 3-ех лет: выписывать штраф.
Штраф [LVL x 250]. ]
]]
local fpt = [[
ПРЕАМБУЛА
Вступительная часть.

0.1 Федеральное Постановление - это нормативно-правовой акт, который был призван внести чёткие рамки в работу государственных организаций.
0.2 Федеральное Постановление издаётся Федеральным Бюро Расследований (далее ФБР) для Полицейских Департаментов (далее ПД) и военных частей (Далее Армия).
0.3 Федеральное Постановление может быть изменено Директором ФБР ( при участии следящего Администратора ) в любое время дня и ночи, его вступление в силу происходит через 48 часов после публикации.
0.4 Федеральное Постановление обязано выполняться всеми сотрудниками вышеупомянутых организаций.
0.5 Незнание Федерального Постановления не освобождает обвиняемого от ответственности.

Изображение

ГЛАВА НОМЕР ОДИН
Преступления против общественности.

1.1 Запрещается несанкционированное применение огнестрельного оружия против любого гражданского лица/сотрудника государственных организаций - понижене.
1.2 Запрещается любое унижение чести и достоинства граждан вне зависимо от его социального или правового статуса - увольнение.
1.3 Запрещается применение насилия в отношении как граждан так и заключенных под стражу лиц - понижение.

Изображение

ГЛАВА НОМЕР ДВА
Постановление в отношении сотрудников Федерального Бюро Расследований и Мэрии.

2.1 Запрещается проникать на территорию FBI без получения официального пропуска от любого из агентов ФБР выше Мл.Агента - предупреждение / понижение.
Примечание: Мэру, Генералам армий, Шерифам разрешение не требуется.
2.2 Запрещается выдавать себя за любого государственного сотрудника - увольнение.
Исключение: Агенты ФБР во время ведения следственных действий под прикрытием.
2.3 Запрещается брать руководство операциями (теракты / похищения) без приказа ФБР - увольнение.
2.4 Запрещается неподчинение агенту ФБР в рамках его законных требований - понижение-увольнение.
Исключение: Агенты ФБР во время ведения следственных действий под прикрытием.
2.5 Запрещается оскорблять/угрожать/шантажировать агента ФБР - увольнение.
2.6 Запрещается оспаривать понижение/увольнение, выданное агентом ФБР/Мэром где-либо, кроме как в специальном разделе жалоб - понижение / увольнение.
2.7 Запрещается раскрывать личность агента ФБР, если тот находится под прикрытием - увольнение.
2.8 Запрещается вносить помехи в работу аттестационной комиссии от высших органов власти, проводящих любого рода проверки в государственных структурах - понижение.
2.9 Запрещается избегать проверки от ФБР - понижение.
Примечание: Агент имеет право вас вызвать в бюро и провести проверку. При отказе последует соответствующее наказание согласно пункту 2.9.

Изображение

ГЛАВА НОМЕР ТРИ
Постановление в отношении Полицейских Департаментов и Армий.

3.1 Запрещаются любые проявления неадекватного поведения и провокации - предупреждение / понижение / увольнение.
3.2 Запрещается нарушать правила строя - предупреждение / понижение.
3.3 Запрещается продажа любого государственного имущества (Ключи от камер/форма/фуры с боеприпасами) - увольнение + ЧС фракции.
3.4 Запрещается давать заведомо ложную информацию государственному сотруднику - увольнение.
3.5 Запрещается необоснованно требовать документы, а так же проводить обыск гражданских лиц - понижение.
3.6 Запрещается лишать права на адвоката (За исключением статьей "Уголовного Кодекса",предусматривающих лишение и наличия у вас доказательств) - понижение.
3.7 Запрещается государственным сотрудникам входить в сговоры с мафией/бандами - увольнение.
Исключение: Спец. операции (обязательный контроль старшего офицера).
3.8 Запрещается без разрешения/пропуска (самовольно) покидать часть/свой город - выговор/понижение/увольнение.
3.9 Запрещается носить форму не соответствующую занимаемой должности/званию - понижение.
Примечание: Соответствие формы и званий устанавливается руководителем организации.
3.10 Запрещается в рабочее время носить на себе вызывающие аксессуары - предупреждение / понижение.
3.11 Запрещается умышленно удалять с базы данных розыска - понижение / увольнение
Дополнение: Если вы ошиблись и можете доказать свою невиновность, вы должны сообщить об этом в департамент.


Изображение

ГЛАВА НОМЕР ЧЕТЫРЕ
Преступления государственных сотрудников против норм Устава, и других правовых документов.

4.1 Запрещается снимать преступникам розыск без уведомления ФБР - понижение.
Исключение: Если розыск был выдан по ошибке и вы можете это доказать.
4.2 Запрещается выдавать розыск без весомой на то причины, по просьбе. Иными словами - не видя факта нарушения лично - понижение / увольнение.
4.3 Запрещается провоцировать кого-либо, не важно, какого рода провокации - понижение.
4.4 Запрещается использовать нецензурную брань, а также оскорбления - понижение / увольнение.
4.5 Запрещается в рабочее время заниматься своими делами ( игра в казино, участие в гонках, дерби, пейнтболе в рабочее время с 9:00 до 22:00 за исключением перерыв с 13:00 до 14:00 , и случаев, когда вышеупомянутые мероприятия были организованы Администрацией сервера) - предупреждение / понижение / увольнение.
Исключение: Разрешение со стороны руководства организации, выполнение служебных обязанностей (например, охрана авторынка) или тренировок под присмотром старшего офицерского состава.
4.6 Запрещается хранение и употребление наркотических веществ, а также хранение краденых материалов - увольнение.
Исключение: Сотрудники PD, сотрудники ФБР в целях спец. операций (с обязательным контролем старшего офицера).
4.7 Запрещается находиться в опасном районе вне спец. операций - увольнение.
Исключение: Спец. операция, Федеральный патруль,специальные отделы (обязательный контроль со стороны руководства организации).
4.8 Запрещается объявлять в розыск не по уголовному кодексу - предупреждение / понижение.
4.9 Запрещается неподчинение старшему по званию в рамках закона - понижение.
Исключение: Старшие по званию - в рамках одной организации.
4.10 Запрещается употреблять алкоголь в рабочее время - понижение.
4.11 Запрещается брать/давать взятки - увольнение.
4.12 Запрещается нарушать правила волны департамента - предупреждение / понижение.
4.13 Запрещается беспричинно обыскивать государственных сотрудников - понижение.
4.14 Запрещается лишать лицензии без весомых на то причин - компенсация стоимости лицензий за счёт отобравшего офицера + понижение.
Примечание: Если Вы увидели, что государственный сотрудник нарушил правила дорожного движения или в гражданской форме УК (где предусматривается изъятие лицензии), и у Вас есть доказательства, Вы имеете полное право забрать лицензию.
4.15 Запрещается нарушать субординацию при общении со старшими по званию - предупреждение / понижение.
4.16 Запрещается убийство в наручниках или эффектом электрошокера - понижение / увольнение.
Примечание: Разрешено использовать электрошокер в перестрелке, если она началась в Зелёной Зоне и у вас есть доказательства.
4.17 Запрещается нарушать законы штата, не важно в форме вы или нет - предупреждение / понижение / увольнение.
Исключение: Если у Вас есть доказательства, подтверждающие вашу полную либо частичную невиновность по фактам: самообороны себя и близких; защиты личного имущества; при выполнении служебного долга, но находясь не при исполнении служебных обязанностей ( не в форме ); приказ старшего по званию в рамках закона.
4.18 Запрещается неподчинение руководящему составу ФБР - увольнение.
4.19 Запрещается неподчинение Мэру в рамках закона Штата Evolve - увольнение.
4.20 Запрещается отдавать приказы Мэру - увольнение.
4.21 Запрещается отдавать приказы сотрудникам ФБР - увольнение.
4.22 Запрещается нарушать нормы составления правовых актов ( Запрещается злоупотребление биндерами/скриптами ) - выговор / понижение / увольнение. Правила использования. ( кликабельно )

Изображение

ГЛАВА НОМЕР ПЯТЬ
Дополнительное положение.
5.1 Сотрудник ФБР имеет право сменить наказание на дисциплинарное взыскание в виде предупреждения.
5.2 Cотрудник Армии или ПД обязан сделать выводы о своей вине и постараться более не нарушать ФП.
5.3 Смена наказания осуществляется агентом ФБР, исходя из его здравого смысла и опыта. Выдача предупреждений за пункты, которые так или иначе способны пошатнуть государственную безопасность - запрещены.
5.4 Сотрудник имеет право получить только одно предупреждение, при последующих нарушениях следуют более тяжкие наказания.
5.5 Пункты, предусматривающие выбор вида наказания, подразумевают применение одного из них по усмотрению выдающего наказание, в зависимости от тяжести нарушения и наличия активных предупреждений, либо нарушений в прошлом.

]]
local dfmenu =
{
  {
    title = 'Бомба с часовым механизмом',
    onclick = function()
      if cfg.main.male == true then
        sampSendChat("/me достал саперный набор")
        wait(3500)
        sampSendChat("/me открыл саперный набор")
        wait(3500)
        sampSendChat("/me осмотрел взрывное устройство")
        wait(3500)
        sampSendChat("/do Определил тип взрывного устройства. Бомба с часовым механизмом.")
        wait(3500)
        sampSendChat("/do Увидел три провода выходящих с механизма.")
        wait(3500)
        sampSendChat("/me достал нож из саперного набора")
        wait(3500)
        sampSendChat("/me аккуратно зачистил первый провод")
        wait(3500)
        sampSendChat("/try достал отвертку с индикатором и прислонил край отвертки к оголённом проводу")
      end
      if cfg.main.male == false then
        sampSendChat("/me достала саперный набор")
        wait(3500)
        sampSendChat("/me открыла саперный набор")
        wait(3500)
        sampSendChat("/me осмотрела взрывное устройство")
        wait(3500)
        sampSendChat("/do Определила тип взрывного устройства. Бомба с часовым механизмом.")
        wait(3500)
        sampSendChat("/do Увидела три провода выходящих с механизма.")
        wait(3500)
        sampSendChat("/me достала нож из саперного набора")
        wait(3500)
        sampSendChat("/me аккуратно зачистила первый провод")
        wait(3500)
        sampSendChat("/try достала отвертку с индикатором и прислонила край отвертки к оголённом проводу")
      end
    end
  },
  {
    title = 'Бомба с часовым механизмом если {63c600}[Удачно]',
    onclick = function()
        if cfg.main.male == true then
        sampSendChat("/me перерезал проводок")
        wait(3500)
        sampSendChat("/me прислушался к устройству")
        wait(3500)
        sampSendChat("/do Механизм перестал издавать тикающие звуки.")
        wait(3500)
        sampSendChat("/do Бомба обезврежена.")
        wait(3500)
        sampSendChat("/me сложил инструменты обратно в саперный набор")
        wait(3500)
        sampSendChat("/me достал бронированный кейс и аккуратно сложил туда бомбу")
      end
      if cfg.main.male == false then
        sampSendChat("/me перерезала проводок")
        wait(3500)
        sampSendChat("/me прислушалась к устройству")
        wait(3500)
        sampSendChat("/do Механизм перестал издавать тикающие звуки.")
        wait(3500)
        sampSendChat("/do Бомба обезврежена.")
        wait(3500)
        sampSendChat("/me сложила инструменты обратно в саперный набор")
        wait(3500)
        sampSendChat("/me достала бронированный кейс и аккуратно сложила туда бомбу")
      end
    end
  },
  {
    title = 'Бомба с часовым механизмом если {bf0000}[Неудачно]',
    onclick = function()
      if cfg.main.male == true then
        sampSendChat("/me аккуратно зачистил второй провод")
        wait(3500)
        sampSendChat("/me перерезал проводок")
        wait(3500)
        sampSendChat("/me прислушался к устройству")
        wait(3500)
        sampSendChat("/do Механизм перестал издавать тикающие звуки.")
        wait(3500)
        sampSendChat("/do Бомба обезврежена.")
        wait(3500)
        sampSendChat("/me сложил инструменты обратно в саперный набор")
        wait(3500)
        sampSendChat("/me достал бронированный кейс и аккуратно сложил туда бомбу")
      end
      if cfg.main.male == false then
        sampSendChat("/me аккуратно зачистила второй провод")
        wait(3500)
        sampSendChat("/me перерезала проводок")
        wait(3500)
        sampSendChat("/me прислушалась к устройству")
        wait(3500)
        sampSendChat("/do Механизм перестал издавать тикающие звуки.")
        wait(3500)
        sampSendChat("/do Бомба обезврежена.")
        wait(3500)
        sampSendChat("/me сложила инструменты обратно в саперный набор")
        wait(3500)
        sampSendChat("/me достала бронированный кейс и аккуратно сложила туда бомбу")
      end
    end
  },
  {
    title = 'Бомба с дистанционным управлением',
    onclick = function()
      if cfg.main.male == true then
        sampSendChat("/me достал саперный набор")
        wait(3500)
        sampSendChat("/me открыл саперный набор")
        wait(3500)
        sampSendChat("/me осмотрел взрывное устройство")
        wait(3500)
        sampSendChat("/do Определил тип взрывного устройства. Бомба с дистанционным управлением.")
        wait(3500)
        sampSendChat("/do Увидел два шурупа на блоке с механизмом.")
        wait(3500)
        sampSendChat("/me достал отвертку из саперного набора")
        wait(3500)
        sampSendChat("/me аккуратно выкручивает шуруп")
        wait(3500)
        sampSendChat("/me отодвинул крышку блока и увидел антенну")
        wait(3500)
        sampSendChat("/do Увидел красный мигающий индикатор.")
        wait(3500)
        sampSendChat("/me просмотрел путь микросхемы от антенны к детонатору")
        wait(3500)
        sampSendChat("/me увидел два провода")
        wait(3500)
        sampSendChat("/try перерезал первый провод. Индикатор перестал мигать.")
      end
      if cfg.main.male == false then
        sampSendChat("/me достала саперный набор")
        wait(3500)
        sampSendChat("/me открыла саперный набор")
        wait(3500)
        sampSendChat("/me осмотрела взрывное устройство")
        wait(3500)
        sampSendChat("/do Определила тип взрывного устройства. Бомба с Бомба с дистанционным управлением.")
        wait(3500)
        sampSendChat("/do Увидела два шурупа на блоке с механизмом.")
        wait(3500)
        sampSendChat("/me достала отвертку из саперного набора")
        wait(3500)
        sampSendChat("/me аккуратно выкручивает шуруп")
        wait(3500)
        sampSendChat("/me отодвинула крышку блока и увидел антенну")
        wait(3500)
        sampSendChat("/do Увидел красный мигающий индикатор.")
        wait(3500)
        sampSendChat("/me просмотрела путь микросхемы от антенны к детонатору")
        wait(3500)
        sampSendChat("/me увидела два провода")
        wait(3500)
        sampSendChat("/try перерезала первый провод. Индикатор перестал мигать.")
      end
    end
  },
  {
    title = 'Бомба с дистанционным управлением если {63c600}[Удачно]',
    onclick = function()
      if cfg.main.male == true then
        sampSendChat("/do Бомба обезврежена.")
        wait(3500)
        sampSendChat("/me сложил инструменты обратно в саперный набор")
        wait(3500)
        sampSendChat("/me достал бронированный кейс и аккуратно сложил туда бомбу")
      end
      if cfg.main.male == false then
        sampSendChat("/do Бомба обезврежена.")
        wait(3500)
        sampSendChat("/me сложила инструменты обратно в саперный набор")
        wait(3500)
        sampSendChat("/me достала бронированный кейс и аккуратно сложила туда бомбу")
      end
    end
  },
  {
    title = 'Бомба с дистанционным управлением если {bf0000}[Неудачно]',
    onclick = function()
      if cfg.main.male == true then
        sampSendChat("/me перерезал второй провод")
        wait(3500)
        sampSendChat("/do Индикатор перестал мигать.")
        wait(3500)
        sampSendChat("/do Бомба обезврежена.")
        wait(3500)
        sampSendChat("/me сложил инструменты обратно в саперный набор")
        wait(3500)
        sampSendChat("/me достал бронированный кейс и аккуратно сложил туда бомбу")
      end
      if cfg.main.male == false then
        sampSendChat("/me перерезала второй провод")
        wait(3500)
        sampSendChat("/do Индикатор перестал мигать.")
        wait(3500)
        sampSendChat("/do Бомба обезврежена.")
        wait(3500)
        sampSendChat("/me сложила инструменты обратно в саперный набор")
        wait(3500)
        sampSendChat("/me достала бронированный кейс и аккуратно сложил туда бомбу")
      end
    end
  },
  {
    title = 'Бомба с активационным кодом',
    onclick = function()
      if cfg.main.male == true then
        sampSendChat("/me достал саперный набор")
        wait(3500)
        sampSendChat("/me открыл саперный набор")
        wait(3500)
        sampSendChat("/me осмотрел взрывное устройство")
        wait(3500)
        sampSendChat("/do Определил тип взрывного устройства. Бомба с активационным кодом.")
        wait(3500)
        sampSendChat("/me достал из саперного набора прибор для подбора кода")
        wait(3500)
        sampSendChat("/me подключил прибор к бомбе")
        wait(3500)
        sampSendChat("/do На приборе высветилось: Ожидание получения пароля.")
        wait(3500)
        sampSendChat("/do На приборе высветилось: Пароль 5326.")
        wait(3500)
        sampSendChat("/try ввёл полученный пароль. Экран бомбы выключился")
      end
      if cfg.main.male == false then
        sampSendChat("/me достала саперный набор")
        wait(3500)
        sampSendChat("/me открыла саперный набор")
        wait(3500)
        sampSendChat("/me осмотрела взрывное устройство")
        wait(3500)
        sampSendChat("/do Определила тип взрывного устройства. Бомба с активационным кодом.")
        wait(3500)
        sampSendChat("/me достала из саперного набора прибор для подбора кода")
        wait(3500)
        sampSendChat("/me подключила прибор к бомбе")
        wait(3500)
        sampSendChat("/do На приборе высветилось: Ожидание получения пароля.")
        wait(3500)
        sampSendChat("/do На приборе высветилось: Пароль 5326.")
        wait(3500)
        sampSendChat("/try ввёла полученный пароль. Экран бомбы выключился")
      end
    end
  },
  {
    title = 'Бомба с активационным кодом если {63c600}[Удачно]',
    onclick = function()
      if cfg.main.male == true then
        sampSendChat("/do Бомба обезврежена.")
        wait(3500)
        sampSendChat("/me сложил инструменты обратно в саперный набор")
        wait(3500)
        sampSendChat("/me достал бронированный кейс и аккуратно сложил туда бомбу")
      end
      if cfg.main.male == false then
        sampSendChat("/do Бомба обезврежена.")
        wait(3500)
        sampSendChat("/me сложила инструменты обратно в саперный набор")
        wait(3500)
        sampSendChat("/me достала бронированный кейс и аккуратно сложила туда бомбу")
      end
    end
  },
  {
    title = 'Бомба с активационным кодом если {bf0000}[Неудачно]',
    onclick = function()
      if cfg.main.male == true then
        sampSendChat("/me перезагрузил(а) прибор")
        wait(3500)
        sampSendChat("/do На приборе высветилось: Ожидание получения пароля.")
        wait(3500)
        sampSendChat("/do На приборе высветилось: Пароль 3789.")
        wait(3500)
        sampSendChat("/me ввёл полученный пароль")
        wait(3500)
        sampSendChat("/Экран бомбы выключился")
        wait(3500)
        sampSendChat("/do Бомба обезврежена.")
        wait(3500)
        sampSendChat("/me сложил инструменты обратно в саперный набор")
        wait(3500)
        sampSendChat("/me достал бронированный кейс и аккуратно сложил туда бомбу")
      end
      if cfg.main.male == false then
        sampSendChat("/me перезагрузила прибор")
        wait(3500)
        sampSendChat("/do На приборе высветилось: Ожидание получения пароля.")
        wait(3500)
        sampSendChat("/do На приборе высветилось: Пароль 3789.")
        wait(3500)
        sampSendChat("/me ввёла полученный пароль")
        wait(3500)
        sampSendChat("/Экран бомбы выключился")
        wait(3500)
        sampSendChat("/do Бомба обезврежена.")
        wait(3500)
        sampSendChat("/me сложила инструменты обратно в саперный набор")
        wait(3500)
        sampSendChat("/me достала бронированный кейс и аккуратно сложила туда бомбу")
      end
    end
  }
}
local fcmenu =
{
  {
    title = 'Теракты',
    submenu =
    {
      {
        title = '{00BFFF}« Мэрия »'
      },
      {
        title = '{00BFFF}Захват мэрии без заложников — {ff0000}100.000$'
      },
      {
        title = '{00BFFF}Захват мэрии c заложниками — {ff0000}150.000$'
      },
      {
        title = '{9A9593}« Офис ФБР »'
      },
      {
        title = '{9A9593}Захват офиса федерального бюро без заложников — {ff0000}100.000$'
      },
      {
        title = '{9A9593}Захват офиса федерального бюро c заложниками — {ff0000}150.000$'
      },
      {
        title = '{0080FF}« Участок SFPD »'
      },
      {
        title = '{0080FF}Захват участка SAPD без заложников — {ff0000}100.000$'
      },
      {
        title = '{0080FF}Захват участка SAPD c заложниками — {ff0000}150.000$'
      },
      {
        title = '{BF4040}« Больница »'
      },
      {
        title = '{BF4040}Захват больницы без заложников — {ff0000}75.000$'
      },
      {
        title = '{BF4040}Захват больницы с заложниками — {ff0000}100.000$'
      },
      {
        title = '{00BFFF}« Автошкола »'
      },
      {
        title = '{00BFFF}Захват автошколы без заложников — {ff0000}50.000$'
      },
      {
        title = '{00BFFF}Захват автошколы с заложниками — {ff0000}75.000$'
      },
      {
        title = '{40BFBF}« CМИ »'
      },
      {
        title = '{40BFBF}Захват СМИ без заложников — {ff0000}50.000$'
      },
      {
        title = '{40BFBF}Захват СМИ с заложниками — {ff0000}75.000$'
      },
      {
        title = '« Остальное »'
      },
      {
        title = 'Захват развлекательных/рабочих заведений без заложников — {ff0000}50.000$'
      },
      {
        title = 'Захват развлекательных/рабочих заведений с заложниками — {ff0000}75.000$'
      }
    }
  },
  {
    title = 'Похищения',
    submenu =
    {
      {
        title = 'Мэрия',
        submenu =
        {
          {
            title = '{0040BF}Мэр{ffffff} [6] - {ff0000}100.000$'
          },
          {
            title = '{0040BF}Зам.Мэра{ffffff} [5] - {ff0000}80.000$'
          },
          {
            title = '{0040BF}Начальник охраны{ffffff} [4] - {ff0000}60.000$'
          },
          {
            title = '{0040BF}Охранник{ffffff} [3] - {ff0000}40.000$'
          },
          {
            title = '{0040BF}Адвокат{ffffff} [2] - {ff0000}30.000$'
          },
          {
            title = '{0040BF}Секретарь{ffffff} [1] - {ff0000}20.000$'
          }
        }
      },
      {
        title = 'ФБР',
        submenu =
        {
          {
            title = '{9A9593}Директор{ffffff} [10] - {ff0000}100.000$'
          },
          {
            title = '{9A9593}Зам.Директора{FFFFFF} [9] - {ff0000}80.000$'
          },
          {
            title = '{9A9593}Инспектор{ffffff} [8] - {ff0000}70.000$'
          },
          {
            title = '{9A9593}Глава CID{ffffff} [7] - {ff0000}60.000$'
          },
          {
            title = '{9A9593}Глава DEA{ffffff} [6] - {ff0000}50.000$'
          },
          {
            title = '{9A9593}Агент CID{ffffff} [5] - {ff0000}40.000$'
          },
          {
            title = '{9A9593}Агент DEA{ffffff} [4] - {ff0000}30.000$'
          },
          {
            title = '{9A9593}Мл.Агент{ffffff} [3] - {ff0000}25.000$'
          },
          {
            title = '{9A9593}Дежурный{ffffff} [2] - {ff0000}20.000$'
          },
          {
            title = '{9A9593}Стажер{ffffff} [1] - {ff0000}15.000$'
          }
        }
      },
      {
        title = 'Полиция',
        submenu =
        {
          {
            title = '{0000FF}Шериф{ffffff} [14] - {ff0000}80.000$'
          },
          {
            title = '{0000FF}Полковник{ffffff} [13] - {ff0000}70.000$'
          },
          {
            title = '{0000FF}Подполковник{ffffff} [12] - {ff0000}65.000$'
          },
          {
            title = '{0000FF}Майор{ffffff} [11] - {ff0000}60.000$'
          },
          {
            title = '{0000FF}Капитан{ffffff} [10] - {ff0000}55.000$'
          },
          {
            title = '{0000FF}Ст.Лейтенант{ffffff} [9] - {ff0000}50.000$'
          },
          {
            title = '{0000FF}Лейтенант{ffffff} [8] - {ff0000}45.000$'
          },
          {
            title = '{0000FF}Мл.Лейтенант{ffffff} [7] - {ff0000}40.000$'
          },
          {
            title = '{0000FF}Ст.Прапорщик{ffffff} [6] - {ff0000}35.000$'
          },
          {
            title = '{0000FF}Прапорщик{ffffff} [5] - {ff0000}30.000$'
          },
          {
            title = '{0000FF}Сержант{ffffff} [4] - {ff0000}25.000$'
          },
          {
            title = '{0000FF}Мл.Сержант{ffffff} [3] - {ff0000}20.000$'
          },
          {
            title = '{0000FF}Офицер{ffffff} [2] - {ff0000}15.000$'
          },
          {
            title = '{0000FF}Кадет{ffffff} [1] - {ff0000}10.000$'
          }
        }
      },
      {
        title = 'Армия',
        submenu =
        {
          {
            title = '{008040}Генерал{ffffff} [15] - {ff0000}80.000$'
          },
          {
            title = '{008040}Полковник{ffffff} [14] - {ff0000}75.000$'
          },
          {
            title = '{008040}Подполковник{ffffff} [13] - {ff0000}70.000$'
          },
          {
            title = '{008040}Майор{ffffff} [12] - {ff0000}65.000$'
          },
          {
            title = '{008040}Капитан{ffffff} [11] - {ff0000}60.000$'
          },
          {
            title = '{008040}Ст.Лейтенант{ffffff} [10] - {ff0000}55.000$'
          },
          {
            title = '{008040}Лейтенант{ffffff} [9] - {ff0000}50.000$'
          },
          {
            title = '{008040}Мл.Лейтенант{ffffff} [8] - {ff0000}45.000$'
          },
          {
            title = '{008040}Прапорщик{ffffff} [7] - {ff0000}40.000$'
          },
          {
            title = '{008040}Старшина{ffffff} [6] - {ff0000}35.000$'
          },
          {
            title = '{008040}Ст.сержант{ffffff} [5] - {ff0000}30.000$'
          },
          {
            title = '{008040}Сержант{ffffff} [4] - {ff0000}25.000$'
          },
          {
            title = '{008040}Мл.Сержант{ffffff} [3] - {ff0000}20.000$'
          },
          {
            title = '{008040}Ефрейтор{ffffff} [2] - {ff0000}15.000$'
          },
          {
            title = '{008040}Рядовой{ffffff} [1] - {ff0000}10.000$'
          }
        }
      },
      {
        title = 'Медики',
        submenu =
        {
          {
            title = '{BF4040}Глав.Врач{ffffff} [10] - {ff0000}80.000$'
          },
          {
            title = '{BF4040}Зам.Глав.Врача{ffffff} [9] - {ff0000}75.000$'
          },
          {
            title = '{BF4040}Хирург{ffffff} [8] - {ff0000}70.000$'
          },
          {
            title = '{BF4040}Психолог{ffffff} [7] - {ff0000}60.000$'
          },
          {
            title = '{BF4040}Доктор{ffffff} [6] - {ff0000}40.000$'
          },
          {
            title = '{BF4040}Нарколог{ffffff} [5] - {ff0000}35.000$'
          },
          {
            title = '{BF4040}Спасатель{ffffff} [4] - {ff0000}30.000$'
          },
          {
            title = '{BF4040}Мед.Брат{ffffff} [3] - {ff0000}25.000$'
          },
          {
            title = '{BF4040}Санитар{ffffff} [2] - {ff0000}20.000$'
          },
          {
            title = '{BF4040}Интерн{ffffff} [1] - {ff0000}15.000$'
          }
        }
      },
      {
        title = 'Автошкола',
        submenu =
        {
          {
            title = '{40BFFF}Управляющий{ffffff} [10] - {ff0000}80.000$'
          },
          {
            title = '{40BFFF}Директор{ffffff} [9] - {ff0000}75.000$'
          },
          {
            title = '{40BFFF}Ст.Менеджер{ffffff} [8] - {ff0000}70.000$'
          },
          {
            title = '{40BFFF}Мл.Менеджер{ffffff} [7] - {ff0000}60.000$'
          },
          {
            title = '{40BFFF}Координатор{ffffff} [6] - {ff0000}55.000$'
          },
          {
            title = '{40BFFF}Инструктор{FFFFFF} [5] - {ff0000}50.000$'
          },
          {
            title = '{40BFFF}Мл.Инструктор{ffffff} [4] - {ff0000}45.000$'
          },
          {
            title = '{40BFFF}Экзаменатор{ffffff} [3] - {ff0000}30.000$'
          },
          {
            title = '{40BFFF}Консультант{ffffff} [2] - {ff0000}25.000$'
          },
          {
            title = '{40BFFF}Стажер{ffffff} [1] - {ff0000}20.000$'
          }
        }
      },
      {
        title = 'Новости',
        submenu =
        {
          {
            title = '{FFFF80}Генеральный директор{ffffff} [10] - {ff0000}70.000$'
          },
          {
            title = '{FFFF80}Програмный директор{ffffff} [9] - {ff0000}60.000$'
          },
          {
            title = '{FFFF80}Технический директор{ffffff} [8] - {ff0000}55.000$'
          },
          {
            title = '{FFFF80}Главный редактор{ffffff} [7] - {ff0000}50.000$'
          },
          {
            title = '{FFFF80}Редактор{ffffff} [6] - {ff0000}45.000$'
          },
          {
            title = '{FFFF80}Ведущий{ffffff} [5] - {ff0000}40.000$'
          },
          {
            title = '{FFFF80}Репортер{ffffff} [4] - {ff0000}30.000$'
          },
          {
            title = '{FFFF80}Звукорежиссер{ffffff} [3] - {ff0000}25.000$'
          },
          {
            title = '{FFFF80}Звукооператор{ffffff} [2] - {ff0000}20.000$'
          },
          {
            title = '{FFFF80}Стажер{ffffff} [1] - {ff0000}15.000$'
          }
        }
      }
    }
  }
}
-----------
function ftext(message)
    sampAddChatMessage(string.format('%s %s', ctag, message), 0x9966CC)
end
--FUNCTIONS--
function update()
	local fpath = os.getenv('TEMP') .. '\\ftulsupd.json'
	downloadUrlToFile('https://raw.githubusercontent.com/WhackerH/kirya/master/ftulsupd.json', fpath, function(id, status, p1, p2)
		if status == dlstatus.STATUS_ENDDOWNLOADDATA then
            local f = io.open(fpath, 'r')
            if f then
			    local info = decodeJson(f:read('*a'))
                updatelink = info.updateurl
                updlist1 = info.updlist
                ttt = updlist1
			    if info and info.latest then
                    version = tonumber(info.latest)
                    if version > tonumber(thisScript().version) then
                        ftext('Обнаружено обновление {9966cc}FBI Tools{ffffff}. Для обновления нажмите кнопку в окошке.')
                        ftext('Примечание: Если у вас не появилось окошко введите /ft')
					    updwindows.v = true
                    else
                        ftext('Обновлений скрипта не обнаружено. Приятной игры.', -1)
                        update = false
				    end
			    end
		    end
	    end
    end)
end

--скачивание актуальной версии
function goupdate()
    ftext('Началось скачивание обновления. Скрипт перезагрузится через пару секунд.', -1)
    wait(300)
    downloadUrlToFile(updatelink, thisScript().path, function(id3, status1, p13, p23)
    if status1 == dlstatus.STATUS_ENDDOWNLOADDATA then
        showCursor(false)
	    thisScript():reload()
    end
end)
end
function getNameSphere(id)
    local names =
    {
      [1] = 'АВ',
      [2] = 'АШ',
      [3] = 'СФа',
      [4] = 'В',
      [5] = 'А',
      [6] = 'СФн',
      [7] = 'Тоннель',
      [8] = 'Мэрия',
      [9] = 'Хот-Доги',
      [10] = 'Больница ЛС',
      [11] = 'АВ',
      [12] = 'Мост',
      [13] = 'Перекресток',
      [14] = 'Развилка',
      [15] = 'В',
      [16] = 'А',
      [17] = 'В',
      [18] = 'С',
      [19] = 'КПП',
      [20] = 'Порт ЛС',
      [21] = 'Опасный район',
      [32] = 'КПП',
      [33] = 'D',
      [34] = 'Холл Мэрии'
    }
    return names[id]
end
checkstat = false
function checkStats()
    checkstat = true
    sampSendChat('/stats')
    while checkstat do wait(0) end
    sampCloseCurrentDialogWithButton(1)
    if rang == nil and frak == nil then
        ftext('Не удалось определить статистику персонажа. Повторить попытку?', -1)
        ftext('Подтвердить: {9966cc}'..table.concat(rkeys.getKeysName(config_keys.oopda.v), " + ")..'{ffffff} | Отменить: {9966cc}'..table.concat(rkeys.getKeysName(config_keys.oopnet.v), " + "), -1)
        opyatstat = true
    end
end
function shpf()
    if not doesFileExist('moonloader/fbitools/shp.txt') then
        local file = io.open("moonloader/fbitools/shp.txt", "w")
        file:write(shpt)
        file:close()
        file = nil
    end
end
function akf()
    if not doesFileExist('moonloader/fbitools/ak.txt') then
        local file = io.open("moonloader/fbitools/ak.txt", "w")
        file:write(akt)
        file:close()
        file = nil
    end
end

function fpf()
    if not doesFileExist('moonloader/fbitools/fp.txt') then
        local file = io.open("moonloader/fbitools/fp.txt", "w")
        file:write(fpt)
        file:close()
        file = nil
    end
end

function ykf()
    if not doesFileExist('moonloader/fbitools/yk.txt') then
        local file = io.open("moonloader/fbitools/yk.txt", "w")
        file:write(ykt)
        file:close()
        file = nil
    end
end
function oopchat()
    stext, sprefix, scolor, spcolor = sampGetChatString(99)
    if zaproop then
        if nikk ~= nil then
            if stext:find(nikk) and scolor == 4294935170 then
                local _, myid = sampGetPlayerIdByCharHandle(PLAYER_PED)
                local myname = sampGetPlayerNickname(myid)
                if not stext:find(myname) then
                    zaproop = false
                    nikk = nil
                    wait(100)
                    ftext('Команду выполнил другой сотрудник.', -1)
                end
            end
        end
    end
    if rang ~= 'Кадет' and rang ~= 'Офицер' and rang ~= 'Мл.Сержант' and  rang ~= 'Сержант' and  rang ~= 'Прапорщик' then
        if stext:find('Дело .+ рассмотрению не подлежит - ООП.') then
            local name = stext:match('Дело (.+) рассмотрению не подлежит - ООП.')
            zaproop = true
            nikk = name
            if nikk ~= nil then
                wait(50)
                ftext(string.format("Поступил запрос на объявление ООП игрока {9966cc}%s", nikk:gsub('_', ' ')), -1)
                ftext('Подтвердить: {9966cc}'..table.concat(rkeys.getKeysName(config_keys.oopda.v), " + ")..'{ffffff} | Отменить: {9966cc}'..table.concat(rkeys.getKeysName(config_keys.oopnet.v), " + "), -1)
            else
                zaproop = false
            end
        end
        if stext:find('Дело на имя .+ %(%d+%) рассмотрению не подлежит, ООП, объявите.') then
            local name, id = stext:match('Дело на имя (.+) %((%d+)%) рассмотрению не подлежит, ООП, объявите.')
            zaproop = true
            nikk = name
            if nikk ~= nil then
                wait(50)
                ftext(string.format("Поступил запрос на объявление ООП игрока {9966cc}%s", nikk:gsub('_', ' ')), -1)
                ftext('Подтвердить: {9966cc}'..table.concat(rkeys.getKeysName(config_keys.oopda.v), " + ")..'{ffffff} | Отменить: {9966cc}'..table.concat(rkeys.getKeysName(config_keys.oopnet.v), " + "), -1)
            else
                zaproop = false
            end
        end
        if stext:find('Дело №%d+ на имя .+ рассмотрению не подлежит, ООП, объявите.') then
            local id, name = stext:match('Дело №(%d+) на имя (.+) рассмотрению не подлежит, ООП, объявите.')
            zaproop = true
            nikk = name
            if nikk ~= nil then
                wait(50)
                ftext(string.format("Поступил запрос на объявление ООП игрока {9966cc}%s", nikk:gsub('_', ' ')), -1)
                ftext('Подтвердить: {9966cc}'..table.concat(rkeys.getKeysName(config_keys.oopda.v), " + ")..'{ffffff} | Отменить: {9966cc}'..table.concat(rkeys.getKeysName(config_keys.oopnet.v), " + "), -1)
            else
                zaproop = false
            end
        end
    end
    if nikk == nil then
        if aroop then aroop = false end
        if zaproop then zaproop = false end
        if dmoop then dmoop = false end
    end
end
function oopdakey()
    if opyatstat then
        checkStats()
        opyatstat = false
    end
    if zaproop then
        sampSendChat(string.format('/d Mayor, дело на имя %s рассмотрению не подлежит, ООП', nikk:gsub('_', ' ')))
        nikk = nil
        zaproop = false
    end
    if dmoop then
        if frak == 'FBI' or frak == 'LSPD' or frak == 'SFPD' or frak == 'LVPD' then
            if rang == 'Кадет' or rang == 'Офицер' or rang == 'Мл.Сержант' or  rang == 'Сержант' or  rang == 'Прапорщик' then
                if not cfg.main.tarb then
                    sampSendChat(string.format('/r Дело на имя %s рассмотрению не подлежит, ООП, объявите.', nikk:gsub('_', ' ')))
                    dmoop = false
                    nikk = false
                else
                    sampSendChat(string.format('/r [%s]: Дело на имя %s рассмотрению не подлежит, ООП, объявите.', cfg.main.tar, nikk:gsub('_', ' ')))
                    dmoop = false
                    nikk = false
                end
            else
                sampSendChat(string.format('/d Mayor, дело на имя %s рассмотрению не подлежит, ООП КПЗ LSPD.', nikk:gsub('_', ' ')))
                dmoop = false
                nikk = false
            end
        end
    end
    if aroop then
        if frak == 'FBI' or frak == 'LSPD' or frak == 'SFPD' or frak == 'LVPD' then
            if rang == 'Кадет' or rang == 'Офицер' or rang == 'Мл.Сержант' or  rang == 'Сержант' or  rang == 'Прапорщик' then
                if not cfg.main.tarb then
                    sampSendChat(string.format('/r Дело на имя %s рассмотрению не подлежит, ООП, объявите.', nikk:gsub('_', ' ')))
                    aroop = false
                    nikk = false
                else
                    sampSendChat(string.format('/r [%s]: Дело на имя %s рассмотрению не подлежит, ООП, объявите.', cfg.main.tar, nikk:gsub('_', ' ')))
                    aroop = false
                    nikk = false
                end
            else
                sampSendChat(string.format("/d Mayor, дело на имя %s рассмотрению не подлежит, ООП.", nikk:gsub('_', ' ')))
                aroop = false
                nikk = false
            end
        end
    end
end
function oopnetkey()
    if opyatstat then
        opyatstat = false
    end
    if dmoop == true then
        dmoop = false
        nikk = nil
        ftext("Рассмотр дела отменен.", -1)
    end
    if zaproop == true then
        zaproop = false
        nikk = nil
        ftext("Рассмотр дела отменен.", -1)
    end
    if aroop == true then
        aroop = false
        nikk = nil
        ftext("Рассмотр дела отменен.", -1)
    end
end
local russian_characters = {
    [168] = 'Ё', [184] = 'ё', [192] = 'А', [193] = 'Б', [194] = 'В', [195] = 'Г', [196] = 'Д', [197] = 'Е', [198] = 'Ж', [199] = 'З', [200] = 'И', [201] = 'Й', [202] = 'К', [203] = 'Л', [204] = 'М', [205] = 'Н', [206] = 'О', [207] = 'П', [208] = 'Р', [209] = 'С', [210] = 'Т', [211] = 'У', [212] = 'Ф', [213] = 'Х', [214] = 'Ц', [215] = 'Ч', [216] = 'Ш', [217] = 'Щ', [218] = 'Ъ', [219] = 'Ы', [220] = 'Ь', [221] = 'Э', [222] = 'Ю', [223] = 'Я', [224] = 'а', [225] = 'б', [226] = 'в', [227] = 'г', [228] = 'д', [229] = 'е', [230] = 'ж', [231] = 'з', [232] = 'и', [233] = 'й', [234] = 'к', [235] = 'л', [236] = 'м', [237] = 'н', [238] = 'о', [239] = 'п', [240] = 'р', [241] = 'с', [242] = 'т', [243] = 'у', [244] = 'ф', [245] = 'х', [246] = 'ц', [247] = 'ч', [248] = 'ш', [249] = 'щ', [250] = 'ъ', [251] = 'ы', [252] = 'ь', [253] = 'э', [254] = 'ю', [255] = 'я',
}
function string.rlower(s)
    s = s:lower()
    local strlen = s:len()
    if strlen == 0 then return s end
    s = s:lower()
    local output = ''
    for i = 1, strlen do
        local ch = s:byte(i)
        if ch >= 192 and ch <= 223 then -- upper russian characters
            output = output .. russian_characters[ch + 32]
        elseif ch == 168 then -- Ё
            output = output .. russian_characters[184]
        else
            output = output .. string.char(ch)
        end
    end
    return output
end
function string.rupper(s)
    s = s:upper()
    local strlen = s:len()
    if strlen == 0 then return s end
    s = s:upper()
    local output = ''
    for i = 1, strlen do
        local ch = s:byte(i)
        if ch >= 224 and ch <= 255 then -- lower russian characters
            output = output .. russian_characters[ch - 32]
        elseif ch == 184 then -- ё
            output = output .. russian_characters[168]
        else
            output = output .. string.char(ch)
        end
    end
    return output
end
function submenus_show(menu, caption, select_button, close_button, back_button)
    select_button, close_button, back_button = select_button or '»', close_button or 'x', back_button or '«'
    prev_menus = {}
    function display(menu, id, caption)
        local string_list = {}
        for i, v in ipairs(menu) do
            table.insert(string_list, type(v.submenu) == 'table' and v.title .. ' »' or v.title)
        end
        sampShowDialog(id, caption, table.concat(string_list, '\n'), select_button, (#prev_menus > 0) and back_button or close_button, sf.DIALOG_STYLE_LIST)
        repeat
            wait(0)
            local result, button, list = sampHasDialogRespond(id)
            if result then
                if button == 1 and list ~= -1 then
                    local item = menu[list + 1]
                    if type(item.submenu) == 'table' then -- submenu
                        table.insert(prev_menus, {menu = menu, caption = caption})
                        if type(item.onclick) == 'function' then
                            item.onclick(menu, list + 1, item.submenu)
                        end
                        return display(item.submenu, id + 1, item.submenu.title and item.submenu.title or item.title)
                    elseif type(item.onclick) == 'function' then
                        local result = item.onclick(menu, list + 1)
                        if not result then return result end
                        return display(menu, id, caption)
                    end
                else -- if button == 0
                    if #prev_menus > 0 then
                        local prev_menu = prev_menus[#prev_menus]
                        prev_menus[#prev_menus] = nil
                        return display(prev_menu.menu, id - 1, prev_menu.caption)
                    end
                    return false
                end
            end
        until result
    end
    return display(menu, 31337, caption or menu.title)
end
local yrisdkld1404 = {
    {
        title = '{ffffff}LSPD',
        onclick = function()
            sampSendChat('/d LSPD, пересекаю вашу юрисдикцию, погоня.')
        end
    },
    {
        title = '{ffffff}SFPD',
        onclick = function()
            sampSendChat('/d SFPD, пересекаю вашу юрисдикцию, погоня.')
        end
    }
}
local yrisdkld1405 = {
    {
        title = '{ffffff}LSPD',
        onclick = function()
            sampSendChat('/d LSPD, пересекаю вашу юрисдикцию, погоня.')
        end
    },
    {
        title = '{ffffff}LVPD',
        onclick = function()
            sampSendChat('/d LVPD, пересекаю вашу юрисдикцию, погоня.')
        end
    }
}
local yrisdkld1406 = {
    {
        title = '{ffffff}SFPD',
        onclick = function()
            sampSendChat('/d SFPD, пересекаю вашу юрисдикцию, погоня.')
        end
    },
    {
        title = '{ffffff}LVPD',
        onclick = function()
            sampSendChat('/d LVPD, пересекаю вашу юрисдикцию, погоня.')
        end
    }
}
function sumenu(args)
    return
    {
      {
        title = '{5b83c2}« Раздел №1 »',
        onclick = function()
        end
      },
      {
        title = '{ffffff}» Избиение - {ff0000}2 уровень розыска.',
        onclick = function()
          sampSendChat("/su "..args.." 2 Избиение")
        end
      },
      {
        title = '{ffffff}» Вооруженное нападение на гражданского - {ff0000}3 уровень розыска.',
        onclick = function()
          sampSendChat("/su "..args.." 3 Вооруженное нападение на гражданского")
        end
      },
      {
        title = '{ffffff}» Вооруженное нападение на гос.служащего - {ff0000}6 уровень розыска.',
        onclick = function()
          sampSendChat("/su "..args.." 6 Вооруженное нападение на ПО")
        end
      },
      {
        title = '{ffffff}» Убийство человека - {ff0000}3 уровень розыска.',
        onclick = function()
          sampSendChat("/su "..args.." 3 Убийство человека")
        end
      },
      {
        title = '{ffffff}» Хулиганство - {ff0000}1 уровень розыска.',
        onclick = function()
          sampSendChat("/su "..args.." 1 Хулиганство")
        end
      },
      {
        title = '{ffffff}» Неадекватное поведение - {ff0000}1 уровень розыска.',
        onclick = function()
          sampSendChat("/su "..args.." 1 Неадекватное поведение")
        end
      },
      {
        title = '{ffffff}» Попрошайничество - {ff0000}1 уровень розыска.',
        onclick = function()
          sampSendChat("/su "..args.." 1 Попрошайничество")
        end
      },
      {
        title = '{ffffff}» Оскорбление - {ff0000}2 уровень розыска.',
        onclick = function()
          sampSendChat("/su "..args.." 2 Оскорбление")
        end
      },
      {
        title = '{ffffff}» Наезд на пешехода - {ff0000}2 уровень розыска.',
        onclick = function()
          sampSendChat("/su "..args.." 2 Наезд на пешехода")
        end
      },
      {
        title = '{ffffff}» Игнорирование спец.сигнала - {ff0000}1 уровень розыска.',
        onclick = function()
          sampSendChat("/su "..args.." 1 Игнорирование спец.сигнала")
        end
      },
      {
        title = '{ffffff}» Угон транспортного средства - {ff0000}2 уровень розыска.',
        onclick = function()
          sampSendChat("/su "..args.." 2 Угон транспортного средства")
        end
      },
      {
        title = '{ffffff}» Порча чужого имущества - {ff0000}1 уровень розыска.',
        onclick = function()
          sampSendChat("/su "..args.. " 1 Порча чужого имущества")
        end
      },
      {
        title = '{ffffff}» Уничтожение чужого имущества - {ff0000}4 уровень розыска.',
        onclick = function()
          sampSendChat("/su "..args.." 4 Уничтожение чужого имущества")
        end
      },
      {
        title = '{ffffff}» Неподчинение сотруднику ПО - {ff0000}1 уровень розыска.',
        onclick = function()
          sampSendChat("/su "..args.." 1 Неподчинение сотруднику ПО")
        end
      },
      {
        title = '{ffffff}» Уход от сотрудника ПО - {ff0000}2 уровень розыска',
        onclick = function()
          sampSendChat("/su "..args.." 2 Уход от сотрудника ПО")
        end
      },
      {
          title = '{ffffff}» Уход с места ДТП - {ff0000}3 уровень розыска',
          onclick = function()
            sampSendChat('/su '..args.. ' 3 Уход с места ДТП')
          end
      },
      {
        title = '{ffffff}» Побег из места заключения - {ff0000}6 уровень розыска.',
        onclick = function()
          sampSendChat("/su "..args.." 6 Побег из места заключения")
        end
      },
      {
        title = '{ffffff}» Проникновение на охраняемую территорию - {ff0000}2 уровень розыска.',
        onclick = function()
          sampSendChat("/su "..args.." 2 Проникновение на охр. территорию")
        end
      },
      {
        title = '{ffffff}» Провокация - {ff0000}2 уровень розыска.',
        onclick = function()
          sampSendChat("/su "..args.." 2 Провокация")
        end
      },
      {
        title = '{ffffff}» Угрозы - {ff0000}1 уровень розыска.',
        onclick = function()
          sampSendChat("/su "..args.." 1 Угрозы")
        end
      },
      {
        title = '{ffffff}» Предложение интим. услуг - {ff0000}1 уровень розыска',
        onclick = function()
          sampSendChat('/su '..args..' 1 Предложение интимных услуг')
        end
      },
      {
        title = '{ffffff}» Изнасилование - {ff0000}3 уровень розыска',
        onclick = function()
          sampSendChat('/su '..args..' 3 Изнасилование')
        end
      },
      {
        title = '{ffffff}» Чистосердечное признание - {ff0000}1 уровень розыска.',
        onclick = function()
          local result = isCharInAnyCar(PLAYER_PED)
          if result then
            sampSendChat("/clear "..args)
            wait(cfg.commands.zaderjka)
            sampSendChat("/su "..args.." 1 Чистосердечное признание")
          else
            sampAddChatMessage("{9966CC}FBI Tools {FFFFFF}| You have to be in the car", -1)
          end
        end
      },
      {
        title = '{ffbc54}« Раздел №2 »',
        onclick = function()
        end
      },
      {
        title = '{ffffff}» Хранение материалов - {ff0000}3 уровень розыска.',
        onclick = function()
          sampSendChat("/su "..args.." 3 Хранение материалов")
        end
      },
      {
        title = '{ffffff}» Хранение наркотиков - {ff0000}3 уровень розыска.',
        onclick = function()
          sampSendChat("/su "..args.." 3 Хранение наркотиков")
        end
      },
      {
        title = '{ffffff}» Продажа ключей от камеры - {ff0000}6 уровень розыска',
        onclick = function()
          sampSendChat("/su "..args.." 6 Продажа ключей от камеры")
        end
      },
      {
        title = '{ffffff}» Употребление наркотиков - {ff0000}3 уровень розыска',
        onclick = function()
          sampSendChat("/su "..args.." 3 Употребление наркотиков")
        end
      },
      {
        title = '{ffffff}» Продажа наркотиков - {ff0000}2 уровень розыска',
        onclick = function()
          sampSendChat("/su "..args.." 2 Продажа наркотиков")
        end
      },
      {
        title = '{ffffff}» Покупка военной формы - {ff0000}2 уровень розыска',
        onclick = function()
          sampSendChat("/su "..args.." 2 Покупка военной формы")
        end
      },
      {
        title = '{ffffff}» Предложение взятки гос.служащему - {ff0000}2 уровень розыска.',
        onclick = function()
          sampSendChat("/su "..args.." 2 Предложение взятки гос.служащему")
        end
      },
      {
        title = '{ae0620}« Раздел №3 »',
        onclick = function()
        end
      },
      {
        title = '{ffffff}» Уход в AFK от ареста - {ff0000}6 уровень розыска.',
        onclick = function()
          sampSendChat("/su "..args.." 6 Уход")
        end
      },
      {
        title = '{ffffff}» Совершение терракта - {ff0000}6 уровень розыска.',
        onclick = function()
          sampSendChat("/su "..args.." 6 Совершение теракта")
        end
      },
      {
        title = '{ffffff}» Неуплата штрафа - {ff0000}2 уровень розыска.',
        onclick = function()
          sampSendChat("/su "..args.." 2 Неуплата штрафа")
        end
      },
      {
        title = '{ffffff}» Превышение полномочий адвоката - {ff0000}3 уровень розыска.',
        onclick = function()
          sampSendChat("/su "..args.." 3 Превышение полномочий адвоката")
        end
      },
      {
        title = '{ffffff}» Похищение гражданского/гос.служащего - {ff0000}4 уровень розыска',
        onclick = function()
          sampSendChat("/su "..args.." 4 Похищение")
        end
      },
      {
        title = '{ffffff}» Статус ООП - {ff0000}6 уровень розыска',
        onclick = function()
          sampSendChat("/su "..args.." 6 ООП")
        end
      }
    }
end
function pkmmenu(id)
    return
    {
      {
        title = "{ffffff}» Надеть наручники",
        onclick = function()
          if cfg.main.male == true then
            sampSendChat("/me заломал руки "..sampGetPlayerNickname(id).." и достал наручники")
            wait(1200)
            sampSendChat("/cuff "..id)
          end
          if cfg.main.male == false then
            sampSendChat("/me заломала руки "..sampGetPlayerNickname(id).." и достала наручники")
            wait(1200)
            sampSendChat("/cuff "..id)
          end
        end
      },
      {
        title = "{ffffff}» Вести за собой",
        onclick = function()
          if cfg.main.male == true then
            sampSendChat("/me пристегнул один из концов наручников к себе, после чего повел за собой "..sampGetPlayerNickname(id))
            wait(1200)
            sampSendChat("/follow "..id)
          end
          if cfg.main.male == false then
            sampSendChat("/me пристегнула один из концов наручников к себе, после чего повела за собой "..sampGetPlayerNickname(id))
            wait(1200)
            sampSendChat("/follow "..id)
          end
        end
      },
      {
        title = "{ffffff}» Произвести обыск",
        onclick = function()
          if cfg.main.male == true then
            sampSendChat("/me надев перчатки, провел руками по торсу")
            wait(1200)
            sampSendChat("/take "..id)
          end
          if cfg.main.male == false then
            sampSendChat("/me надев перчатки, провела руками по торсу")
            wait(1200)
            sampSendChat("/take "..id)
          end
        end
      },
      {
        title = "{ffffff}» Произвести арест",
        onclick = function()
          if cfg.main.male == true then
            sampSendChat("/me достал ключи от камеры, открыв ее")
            wait(cfg.commands.zaderjka)
            sampSendChat("/me затолкнул "..sampGetPlayerNickname(id).." в камеру")
            wait(cfg.commands.zaderjka)
            sampSendChat("/arrest "..id)
            wait(cfg.commands.zaderjka)
            sampSendChat("/me закрыл камеру, убрав ключи в карман")
          end
          if cfg.main.male == false then
            sampSendChat("/me достала ключи от камеры, открыв ее")
            wait(cfg.commands.zaderjka)
            sampSendChat("/me затолкнула "..sampGetPlayerNickname(id).." в камеру")
            wait(cfg.commands.zaderjka)
            sampSendChat("/arrest "..id)
            wait(cfg.commands.zaderjka)
            sampSendChat("/me закрыла камеру, убрав ключи в карман")
          end
        end
      },
      {
        title = '{ffffff}» Снять наручники',
        onclick = function()
          if cfg.main.male == true then
            sampSendChat("/me снял наручники с "..sampGetPlayerNickname(id))
            wait(1200)
            sampSendChat("/uncuff "..id)
          end
          if cfg.main.male == false then
            sampSendChat("/me сняла наручники с "..sampGetPlayerNickname(id))
            wait(1200)
            sampSendChat("/uncuff "..id)
          end
        end
      },
      {
        title = "{ffffff}» Выдать розыск за проникновение",
        onclick = function()
          sampSendChat("/su "..id.." 2 Проникновение на охр. территорию")
        end
      },
      {
        title = "{ffffff}» Выдать розыск за хранение наркотиков",
        onclick = function()
          sampSendChat("/su "..id.." 3 Хранение наркотиков")
        end
      },
      {
        title = "{ffffff}» Выдать розыск за хранение материалов",
        onclick = function()
          sampSendChat("/su "..id.." 3 Хранение материалов")
        end
      },
      {
        title = "{ffffff}» Выдать розыск за продажу наркотиков",
        onclick = function()
          if cfg.main.male == true then
            sampSendChat("/su "..id.." 2 Продажа наркотиков")
            wait(1200)
            sampSendChat("/me заломал руки "..sampGetPlayerNickname(id).." и достал наручники")
            wait(1200)
            sampSendChat("/cuff "..id)
          end
          if cfg.main.male == false then
            sampSendChat("/su "..id.." 2 Продажа наркотиков")
            wait(1200)
            sampSendChat("/me заломала руки "..sampGetPlayerNickname(id).." и достала наручники")
            wait(1200)
            sampSendChat("/cuff "..id)
          end
        end
      },
      {
        title = "{ffffff}» Выдать розыск за продажу ключей от камеры",
        onclick = function()
          sampSendChat("/su "..id.." 6 Продажа ключей от камеры")
        end
      },
      {
        title = "{ffffff}» Выдать розыск за вооруженное нападение на ПО",
        onclick = function()
          sampSendChat("/su "..id.. " 6 Вооруженное нападение на ПО")
        end
      },
      {
        title = "{ffffff}» Выдать розыск",
        onclick = function()
          pID = tonumber(args)
          submenus_show(sumenu(id), "{9966cc}FBI Tools {ffffff}| "..sampGetPlayerNickname(id).."["..id.."] ")
        end
      }
    }
end
function commands()
    sampRegisterChatCommand('ftazer', ftazer)
    sampRegisterChatCommand('kmdc', kmdc)
    sampRegisterChatCommand('su', su)
    sampRegisterChatCommand('ssu', ssu)
    sampRegisterChatCommand('megaf', megaf)
    sampRegisterChatCommand('tazer', tazer)
    sampRegisterChatCommand('keys', keys)
    sampRegisterChatCommand('oop', oop)
    sampRegisterChatCommand('cput', cput)
    sampRegisterChatCommand('ceject', ceject)
    if sampIsChatCommandDefined('st') then sampUnregisterChatCommand('st') end
    sampRegisterChatCommand('st', st)
    sampRegisterChatCommand('deject', deject)
    sampRegisterChatCommand('rh', rh)
    sampRegisterChatCommand('gr', gr)
    sampRegisterChatCommand('warn', warn)
    sampRegisterChatCommand('ms', ms)
    sampRegisterChatCommand('ar', ar)
    sampRegisterChatCommand('r', r)
    sampRegisterChatCommand('f', f)
    sampRegisterChatCommand('fthelp', fthelp)
    sampRegisterChatCommand("fst", fst)
    sampRegisterChatCommand("fsw", fsw)
    sampRegisterChatCommand('fshp', fshp)
    sampRegisterChatCommand('fyk', fyk)
    sampRegisterChatCommand('ffp', ffp)
    sampRegisterChatCommand('fak', fak)
    sampRegisterChatCommand('dmb', dmb)
    sampRegisterChatCommand('dkld', dkld)
    sampRegisterChatCommand('fvz', fvz)
    sampRegisterChatCommand('fbd', fbd)
    sampRegisterChatCommand('blg', blg)
    sampRegisterChatCommand('cc', cc)
    sampRegisterChatCommand('df', df)
    sampRegisterChatCommand('mcheck', mcheck)
    sampfuncsRegisterConsoleCommand('gppc', function() print(getCharCoordinates(PLAYER_PED)) end)
    sampRegisterChatCommand('yk', function() ykwindow.v = not ykwindow.v end)
    sampRegisterChatCommand('fp', function() fpwindow.v = not fpwindow.v end)
    if sampIsChatCommandDefined('ak') then sampUnregisterChatCommand('ak') end
    sampRegisterChatCommand('ak', function() akwindow.v = not akwindow.v end)
    sampRegisterChatCommand('shp',function() shpwindow.v = not shpwindow.v end)
    sampRegisterChatCommand('ft', function() mainwin.v = not mainwin.v end)
    sampRegisterChatCommand('hudpos', function()
        if cfg.main.hud then
            if not changetextpos then
                changetextpos = true
                ftext('По завешению введите команду еще раз.')
            else
                changetextpos = false
                inicfg.save(fbitools, 'fbitools/config.ini')
            end
        else
            ftext('Для начала включите инфо-бар.')
        end
    end)
    sampfuncsRegisterConsoleCommand('gppc', function() 
        local mxx, myy, mzz = getCharCoordinates(PLAYER_PED)
        print(string.format('%s, %s, %s', mxx, myy, mzz))
    end)
end
function getCarNamebyModel(model)
    local names = {
      [400] = 'Landstalker',
      [401] = 'Bravura',
      [402] = 'Buffalo',
      [403] = 'Linerunner',
      [404] = 'Perennial',
      [405] = 'Sentinel',
      [406] = 'Dumper',
      [407] = 'Firetruck',
      [408] = 'Trashmaster',
      [409] = 'Stretch',
      [410] = 'Manana',
      [411] = 'Infernus',
      [412] = 'Voodoo',
      [413] = 'Pony',
      [414] = 'Mule',
      [415] = 'Cheetah',
      [416] = 'Ambulance',
      [417] = 'Leviathan',
      [418] = 'Moonbeam',
      [419] = 'Esperanto',
      [420] = 'Taxi',
      [421] = 'Washington',
      [422] = 'Bobcat',
      [423] = 'Mr. Whoopee',
      [424] = 'BF Injection',
      [425] = 'Hunter',
      [426] = 'Premier',
      [427] = 'Enforcer',
      [428] = 'Securicar',
      [429] = 'Banshee',
      [430] = 'Predator',
      [431] = 'Bus',
      [432] = 'Rhino',
      [433] = 'Barracks',
      [434] = 'Hotknife',
      [435] = 'Article Trailer',
      [436] = 'Previon',
      [437] = 'Coach',
      [438] = 'Cabbie',
      [439] = 'Stallion',
      [440] = 'Rumpo',
      [441] = 'RC Bandit',
      [442] = 'Romero',
      [443] = 'Packer',
      [444] = 'Monster',
      [445] = 'Admiral',
      [446] = 'Squallo',
      [447] = 'Seaspamrow',
      [448] = 'Pizzaboy',
      [449] = 'Tram',
      [450] = 'Article Trailer 2',
      [451] = 'Turismo',
      [452] = 'Speeder',
      [453] = 'Reefer',
      [454] = 'Tropic',
      [455] = 'Flatbed',
      [456] = 'Yankee',
      [457] = 'Caddy',
      [458] = 'Solair',
      [459] = 'Topfun Van',
      [460] = 'Skimmer',
      [461] = 'PCJ-600',
      [462] = 'Faggio',
      [463] = 'Freeway',
      [464] = 'RC Baron',
      [465] = 'RC Raider',
      [466] = 'Glendale',
      [467] = 'Oceanic',
      [468] = 'Sanchez',
      [469] = 'Spamrow',
      [470] = 'Patriot',
      [471] = 'Quad',
      [472] = 'Coastguard',
      [473] = 'Dinghy',
      [474] = 'Hermes',
      [475] = 'Sabre',
      [476] = 'Rustler',
      [477] = 'ZR-350',
      [478] = 'Walton',
      [479] = 'Regina',
      [480] = 'Comet',
      [481] = 'BMX',
      [482] = 'Burrito',
      [483] = 'Camper',
      [484] = 'Marquis',
      [485] = 'Baggage',
      [486] = 'Dozer',
      [487] = 'Maverick',
      [488] = 'News Maverick',
      [489] = 'Rancher',
      [490] = 'FBI Rancher',
      [491] = 'Virgo',
      [492] = 'Greenwood',
      [493] = 'Jetmax',
      [494] = 'Hotring Racer',
      [495] = 'Sandking',
      [496] = 'Blista Compact',
      [497] = 'Police Maverick',
      [498] = 'Boxville',
      [499] = 'Benson',
      [500] = 'Mesa',
      [501] = 'RC Goblin',
      [502] = 'Hotring Racer A',
      [503] = 'Hotring Racer B',
      [504] = 'Bloodring Banger',
      [505] = 'Rancher',
      [506] = 'Super GT',
      [507] = 'Elegant',
      [508] = 'Journey',
      [509] = 'Bike',
      [510] = 'Mountain Bike',
      [511] = 'Beagle',
      [512] = 'Cropduster',
      [513] = 'Stuntplane',
      [514] = 'Tanker',
      [515] = 'Roadtrain',
      [516] = 'Nebula',
      [517] = 'Majestic',
      [518] = 'Buccaneer',
      [519] = 'Shamal',
      [520] = 'Hydra',
      [521] = 'FCR-900',
      [522] = 'NRG-500',
      [523] = 'HPV1000',
      [524] = 'Cement Truck',
      [525] = 'Towtruck',
      [526] = 'Fortune',
      [527] = 'Cadrona',
      [528] = 'FBI Truck',
      [529] = 'Willard',
      [530] = 'Forklift',
      [531] = 'Tractor',
      [532] = 'Combine',
      [533] = 'Feltzer',
      [534] = 'Remington',
      [535] = 'Slamvan',
      [536] = 'Blade',
      [537] = 'Train',
      [538] = 'Train',
      [539] = 'Vortex',
      [540] = 'Vincent',
      [541] = 'Bullet',
      [542] = 'Clover',
      [543] = 'Sadler',
      [544] = 'Firetruck',
      [545] = 'Hustler',
      [546] = 'Intruder',
      [547] = 'Primo',
      [548] = 'Cargobob',
      [549] = 'Tampa',
      [550] = 'Sunrise',
      [551] = 'Merit',
      [552] = 'Utility Van',
      [553] = 'Nevada',
      [554] = 'Yosemite',
      [555] = 'Windsor',
      [556] = 'Monster A',
      [557] = 'Monster B',
      [558] = 'Uranus',
      [559] = 'Jester',
      [560] = 'Sultan',
      [561] = 'Stratum',
      [562] = 'Elegy',
      [563] = 'Raindance',
      [564] = 'RC Tiger',
      [565] = 'Flash',
      [566] = 'Tahoma',
      [567] = 'Savanna',
      [568] = 'Bandito',
      [569] = 'Train',
      [570] = 'Train',
      [571] = 'Kart',
      [572] = 'Mower',
      [573] = 'Dune',
      [574] = 'Sweeper',
      [575] = 'Broadway',
      [576] = 'Tornado',
      [577] = 'AT400',
      [578] = 'DFT-30',
      [579] = 'Huntley',
      [580] = 'Stafford',
      [581] = 'BF-400',
      [582] = 'Newsvan',
      [583] = 'Tug',
      [584] = 'Petrol Trailer',
      [585] = 'Emperor',
      [586] = 'Wayfarer',
      [587] = 'Euros',
      [588] = 'Hotdog',
      [589] = 'Club',
      [590] = 'Train',
      [591] = 'Article Trailer 3',
      [592] = 'Andromada',
      [593] = 'Dodo',
      [594] = 'RC Cam',
      [595] = 'Launch',
      [596] = 'Police Car LS',
      [597] = 'Police Car SF',
      [598] = 'Police Car LV',
      [599] = 'Police Ranger',
      [600] = 'Picador',
      [601] = 'S.W.A.T.',
      [602] = 'Alpha',
      [603] = 'Phoenix',
      [604] = 'Glendale',
      [605] = 'Sadler',
      [606] = 'Baggage Trailer',
      [607] = 'Baggage Trailer',
      [608] = 'Tug Stairs Trailer',
      [609] = 'Boxville',
      [610] = 'Farm Trailer',
      [611] = 'Utility Traileraw '
    }
    return names[model]
end
function getFraktionBySkin(playerid)
    fraks = {
        [0] = 'Гражданский',
        [1] = 'Гражданский',
        [2] = 'Гражданский',
        [3] = 'Гражданский',
        [4] = 'Гражданский',
        [5] = 'Гражданский',
        [6] = 'Гражданский',
        [7] = 'Гражданский',
        [8] = 'Гражданский',
        [9] = 'Гражданский',
        [10] = 'Гражданский',
        [11] = 'Гражданский',
        [12] = 'Гражданский',
        [13] = 'Гражданский',
        [14] = 'Гражданский',
        [15] = 'Гражданский',
        [16] = 'Гражданский',
        [17] = 'Гражданский',
        [18] = 'Гражданский',
        [19] = 'Гражданский',
        [20] = 'Гражданский',
        [21] = 'Ballas',
        [22] = 'Гражданский',
        [23] = 'Гражданский',
        [24] = 'Гражданский',
        [25] = 'Гражданский',
        [26] = 'Гражданский',
        [27] = 'Гражданский',
        [28] = 'Гражданский',
        [29] = 'Гражданский',
        [30] = 'Rifa',
        [31] = 'Гражданский',
        [32] = 'Гражданский',
        [33] = 'Гражданский',
        [34] = 'Гражданский',
        [35] = 'Гражданский',
        [36] = 'Гражданский',
        [37] = 'Гражданский',
        [38] = 'Гражданский',
        [39] = 'Гражданский',
        [40] = 'Гражданский',
        [41] = 'Aztec',
        [42] = 'Гражданский',
        [43] = 'Гражданский',
        [44] = 'Aztec',
        [45] = 'Гражданский',
        [46] = 'Гражданский',
        [47] = 'Vagos',
        [48] = 'Aztec',
        [49] = 'Гражданский',
        [50] = 'Гражданский',
        [51] = 'Гражданский',
        [52] = 'Гражданский',
        [53] = 'Гражданский',
        [54] = 'Гражданский',
        [55] = 'Гражданский',
        [56] = 'Grove',
        [57] = 'Мэрия',
        [58] = 'Гражданский',
        [59] = 'Автошкола',
        [60] = 'Гражданский',
        [61] = 'Армия',
        [62] = 'Гражданский',
        [63] = 'Гражданский',
        [64] = 'Гражданский',
        [65] = 'Гражданский', -- над подумать
        [66] = 'Гражданский',
        [67] = 'Гражданский',
        [68] = 'Гражданский',
        [69] = 'Гражданский',
        [70] = 'МОН',
        [71] = 'Гражданский',
        [72] = 'Гражданский',
        [73] = 'Army',
        [74] = 'Гражданский',
        [75] = 'Гражданский',
        [76] = 'Гражданский',
        [77] = 'Гражданский',
        [78] = 'Гражданский',
        [79] = 'Гражданский',
        [80] = 'Гражданский',
        [81] = 'Гражданский',
        [82] = 'Гражданский',
        [83] = 'Гражданский',
        [84] = 'Гражданский',
        [85] = 'Гражданский',
        [86] = 'Grove',
        [87] = 'Гражданский',
        [88] = 'Гражданский',
        [89] = 'Гражданский',
        [90] = 'Гражданский',
        [91] = 'Гражданский', -- под вопросом
        [92] = 'Гражданский',
        [93] = 'Гражданский',
        [94] = 'Гражданский',
        [95] = 'Гражданский',
        [96] = 'Гражданский',
        [97] = 'Гражданский',
        [98] = 'Мэрия',
        [99] = 'Гражданский',
        [100] = 'Байкер',
        [101] = 'Гражданский',
        [102] = 'Ballas',
        [103] = 'Ballas',
        [104] = 'Ballas',
        [105] = 'Grove',
        [106] = 'Grove',
        [107] = 'Grove',
        [108] = 'Vagos',
        [109] = 'Vagos',
        [110] = 'Vagos',
        [111] = 'RM',
        [112] = 'RM',
        [113] = 'LCN',
        [114] = 'Aztec',
        [115] = 'Aztec',
        [116] = 'Aztec',
        [117] = 'Yakuza',
        [118] = 'Yakuza',
        [119] = 'Rifa',
        [120] = 'Yakuza',
        [121] = 'Гражданский',
        [122] = 'Гражданский',
        [123] = 'Yakuza',
        [124] = 'LCN',
        [125] = 'RM',
        [126] = 'RM',
        [127] = 'LCN',
        [128] = 'Гражданский',
        [129] = 'Гражданский',
        [130] = 'Гражданский',
        [131] = 'Гражданский',
        [132] = 'Гражданский',
        [133] = 'Гражданский',
        [134] = 'Гражданский',
        [135] = 'Гражданский',
        [136] = 'Гражданский',
        [137] = 'Гражданский',
        [138] = 'Гражданский',
        [139] = 'Гражданский',
        [140] = 'Гражданский',
        [141] = 'FBI',
        [142] = 'Гражданский',
        [143] = 'Гражданский',
        [144] = 'Гражданский',
        [145] = 'Гражданский',
        [146] = 'Гражданский',
        [147] = 'Мэрия',
        [148] = 'Гражданский',
        [149] = 'Grove',
        [150] = 'Мэрия',
        [151] = 'Гражданский',
        [152] = 'Гражданский',
        [153] = 'Гражданский',
        [154] = 'Гражданский',
        [155] = 'Гражданский',
        [156] = 'Гражданский',
        [157] = 'Гражданский',
        [158] = 'Гражданский',
        [159] = 'Гражданский',
        [160] = 'Гражданский',
        [161] = 'Гражданский',
        [162] = 'Гражданский',
        [163] = 'FBI',
        [164] = 'FBI',
        [165] = 'FBI',
        [166] = 'FBI',
        [167] = 'Гражданский',
        [168] = 'Гражданский',
        [169] = 'Yakuza',
        [170] = 'Гражданский',
        [171] = 'Гражданский',
        [172] = 'Гражданский',
        [173] = 'Rifa',
        [174] = 'Rifa',
        [175] = 'Rifa',
        [176] = 'Гражданский',
        [177] = 'Гражданский',
        [178] = 'Гражданский',
        [179] = 'Army',
        [180] = 'Гражданский',
        [181] = 'Байкер',
        [182] = 'Гражданский',
        [183] = 'Гражданский',
        [184] = 'Гражданский',
        [185] = 'Гражданский',
        [186] = 'Yakuza',
        [187] = 'Мэрия',
        [188] = 'СМИ',
        [189] = 'Гражданский',
        [190] = 'Vagos',
        [191] = 'Army',
        [192] = 'Гражданский',
        [193] = 'Aztec',
        [194] = 'Гражданский',
        [195] = 'Ballas',
        [196] = 'Гражданский',
        [197] = 'Гражданский',
        [198] = 'Гражданский',
        [199] = 'Гражданский',
        [200] = 'Гражданский',
        [201] = 'Гражданский',
        [202] = 'Гражданский',
        [203] = 'Гражданский',
        [204] = 'Гражданский',
        [205] = 'Гражданский',
        [206] = 'Гражданский',
        [207] = 'Гражданский',
        [208] = 'Yakuza',
        [209] = 'Гражданский',
        [210] = 'Гражданский',
        [211] = 'СМИ',
        [212] = 'Гражданский',
        [213] = 'Гражданский',
        [214] = 'LCN',
        [215] = 'Гражданский',
        [216] = 'Гражданский',
        [217] = 'СМИ',
        [218] = 'Гражданский',
        [219] = 'МОН',
        [220] = 'Гражданский',
        [221] = 'Гражданский',
        [222] = 'Гражданский',
        [223] = 'LCN',
        [224] = 'Гражданский',
        [225] = 'Гражданский',
        [226] = 'Rifa',
        [227] = 'Мэрия',
        [228] = 'Гражданский',
        [229] = 'Гражданский',
        [230] = 'Гражданский',
        [231] = 'Гражданский',
        [232] = 'Гражданский',
        [233] = 'Гражданский',
        [234] = 'Гражданский',
        [235] = 'Гражданский',
        [236] = 'Гражданский',
        [237] = 'Гражданский',
        [238] = 'Гражданский',
        [239] = 'Гражданский',
        [240] = 'Автошкола',
        [241] = 'Гражданский',
        [242] = 'Гражданский',
        [243] = 'Гражданский',
        [244] = 'Гражданский',
        [245] = 'Гражданский',
        [246] = 'Байкер',
        [247] = 'Байкер',
        [248] = 'Байкер',
        [249] = 'Гражданский',
        [250] = 'СМИ',
        [251] = 'Гражданский',
        [252] = 'Army',
        [253] = 'Гражданский',
        [254] = 'Байкер',
        [255] = 'Army',
        [256] = 'Гражданский',
        [257] = 'Гражданский',
        [258] = 'Гражданский',
        [259] = 'Гражданский',
        [260] = 'Гражданский',
        [261] = 'СМИ',
        [262] = 'Гражданский',
        [263] = 'Гражданский',
        [264] = 'Гражданский',
        [265] = 'Полиция',
        [266] = 'Полиция',
        [267] = 'Полиция',
        [268] = 'Гражданский',
        [269] = 'Grove',
        [270] = 'Grove',
        [271] = 'Grove',
        [272] = 'RM',
        [273] = 'Гражданский', -- надо подумать
        [274] = 'МОН',
        [275] = 'МОН',
        [276] = 'МОН',
        [277] = 'Гражданский',
        [278] = 'Гражданский',
        [279] = 'Гражданский',
        [280] = 'Полиция',
        [281] = 'Полиция',
        [282] = 'Полиция',
        [283] = 'Полиция',
        [284] = 'Полиция',
        [285] = 'Полиция',
        [286] = 'FBI',
        [287] = 'Army',
        [288] = 'Полиция',
        [289] = 'Гражданский',
        [290] = 'Гражданский',
        [291] = 'Гражданский',
        [292] = 'Aztec',
        [293] = 'Гражданский',
        [294] = 'Гражданский',
        [295] = 'Гражданский',
        [296] = 'Гражданский',
        [297] = 'Grove',
        [298] = 'Гражданский',
        [299] = 'Гражданский',
        [300] = 'Полиция',
        [301] = 'Полиция',
        [302] = 'Полиция',
        [303] = 'Полиция',
        [304] = 'Полиция',
        [305] = 'Полиция',
        [306] = 'Полиция',
        [307] = 'Полиция',
        [308] = 'МОН',
        [309] = 'Полиция',
        [310] = 'Полиция',
        [311] = 'Полиция'
    }
    if sampIsPlayerConnected(playerid) then
        local result, handle = sampGetCharHandleBySampPlayerId(playerid)
        local skin = getCharModel(handle)
        return fraks[skin]
    end
end
function kvadrat()
    local KV = {
        [1] = "А",
        [2] = "Б",
        [3] = "В",
        [4] = "Г",
        [5] = "Д",
        [6] = "Ж",
        [7] = "З",
        [8] = "И",
        [9] = "К",
        [10] = "Л",
        [11] = "М",
        [12] = "Н",
        [13] = "О",
        [14] = "П",
        [15] = "Р",
        [16] = "С",
        [17] = "Т",
        [18] = "У",
        [19] = "Ф",
        [20] = "Х",
        [21] = "Ц",
        [22] = "Ч",
        [23] = "Ш",
        [24] = "Я",
    }
    local X, Y, Z = getCharCoordinates(playerPed)
    X = math.ceil((X + 3000) / 250)
    Y = math.ceil((Y * - 1 + 3000) / 250)
    Y = KV[Y]
    local KVX = (Y.."-"..X)
    return KVX
end
function longtoshort(long)
    local short =
    {
      ['Армия ЛВ'] = 'LVa',
      ['Армия СФ'] = 'SFa',
      ['ФБР'] = 'FBI'
    }
    return short[long]
end
local osnova =
{
  {
    title = "Лаборатория",
    onclick = function()
      local _, myid = sampGetPlayerIdByCharHandle(PLAYER_PED)
      if cfg.main.male == true then
        sampSendChat("/r Переоделся в сотрудника лаборатории.")
        wait(cfg.commands.zaderjka)
        sampSendChat("/rb "..myid)
      end
      if cfg.main.male == false then
        sampSendChat("/r Переоделась в сотрудника лаборатории.")
        wait(cfg.commands.zaderjka)
        sampSendChat("/rb "..myid)
      end
    end
  },
  {
    title = 'Гражданский',
    onclick = function()
      sampShowDialog(1385, '{9966cc}FBI Tools {ffffff}| Маскировка', 'Введите: причину', 'Отправить', '', 1)
    end
  },
  {
    title = 'Полиция',
    onclick = function()
      sampShowDialog(1386, '{9966cc}FBI Tools {ffffff}| Маскировка', 'Введите: причину', 'Отправить', '', 1)
    end
  },
  {
    title = 'Армия',
    onclick = function()
      sampShowDialog(1387, '{9966cc}FBI Tools {ffffff}| Маскировка', 'Введите: причину', 'Отправить', '', 1)
    end
  },
  {
    title = 'МЧС',
    onclick = function()
      sampShowDialog(1388, '{9966cc}FBI Tools {ffffff}| Маскировка', 'Введите: причину', 'Отправить', '', 1)
    end
  },
  {
    title = 'Мэрия',
    onclick = function()
      sampShowDialog(1389, '{9966cc}FBI Tools {ffffff}| Маскировка', 'Введите: причину', 'Отправить', '', 1)
    end
  },
  {
    title = 'Автошкола',
    onclick = function()
      sampShowDialog(1390, '{9966cc}FBI Tools {ffffff}| Маскировка', 'Введите: причину', 'Отправить', '', 1)
    end
  },
  {
    title = 'News',
    onclick = function()
      sampShowDialog(1391, '{9966cc}FBI Tools {ffffff}| Маскировка', 'Введите: причину', 'Отправить', '', 1)
    end
  },
  {
    title = 'LCN',
    onclick = function()
      sampShowDialog(1392, '{9966cc}FBI Tools {ffffff}| Маскировка', 'Введите: причину', 'Отправить', '', 1)
    end
  },
  {
    title = 'Yakuza',
    onclick = function()
      sampShowDialog(1393, '{9966cc}FBI Tools {ffffff}| Маскировка', 'Введите: причину', 'Отправить', '', 1)
    end
  },
  {
    title = 'Russian Mafia',
    onclick = function()
      sampShowDialog(1394, '{9966cc}FBI Tools {ffffff}| Маскировка', 'Введите: причину', 'Отправить', '', 1)
    end
  },
  {
    title = 'Rifa',
    onclick = function()
      sampShowDialog(1395, '{9966cc}FBI Tools {ffffff}| Маскировка', 'Введите: причину', 'Отправить', '', 1)
    end
  },
  {
    title = 'Grove Street',
    onclick = function()
      sampShowDialog(1396, '{9966cc}FBI Tools {ffffff}| Маскировка', 'Введите: причину', 'Отправить', '', 1)
    end
  },
  {
    title = 'Ballas',
    onclick = function()
      sampShowDialog(1397, '{9966cc}FBI Tools {ffffff}| Маскировка', 'Введите: причину', 'Отправить', '', 1)
    end
  },
  {
    title = 'Vagos',
    onclick = function()
      sampShowDialog(1398, '{9966cc}FBI Tools {ffffff}| Маскировка', 'Введите: причину', 'Отправить', '', 1)
    end
  },
  {
    title = 'Aztec',
    onclick = function()
      sampShowDialog(1399, '{9966cc}FBI Tools {ffffff}| Маскировка', 'Введите: причину', 'Отправить', '', 1)
    end
  },
  {
    title = "Байкеры",
    onclick = function()
      sampShowDialog(1400, '{9966cc}FBI Tools {ffffff}| Маскировка', 'Введите: причину', 'Отправить', '', 1)
    end
  }
}
local fthelpsub =
{
  {
    title = '{9966CC}/ft {ffffff}- Открыть меню скрипта',
    onclick = function()
      sampSetChatInputEnabled(true)
      sampSetChatInputText('/ft')
    end
  },
  {
    title = '{9966cc}/st [id]{ffffff} - Попросить игрока заглушить свое Т/С через мегафон [/m]',
    onclick = function()
      sampSetChatInputEnabled(true)
      sampSetChatInputText('/st ')
    end
  },
  {
    title = '{9966cc}/oop [id]{ffffff} - Написать в волну департамента об ООП',
    onclick = function()
      sampSetChatInputEnabled(true)
      sampSetChatInputText('/oop ')
    end
  },
  {
    title = '{9966cc}/warn [id]{ffffff} - Предупредить игрока в волну департамента о нарушении подачи в розыск',
    onclick = function()
      sampSetChatInputEnabled(true)
      sampSetChatInputText('/warn ')
    end
  },
  {
    title = '{9966cc}/su [id]{ffffff} - Выдать розыск через диалог',
    onclick = function()
      sampSetChatInputEnabled(true)
      sampSetChatInputText('/su ')
    end
  },
  {
    title = '{9966cc}/ssu [id]{ffffff} - Выдать розыск через серверную команду',
    onclick = function()
      sampSetChatInputEnabled(true)
      sampSetChatInputText('/ssu ')
    end
  },
  {
    title = '{9966cc}/cput [id] [seat]{ffffff} - РП отыгровка посадки преступника в автомобиль/мото',
    onclick = function()
      sampSetChatInputEnabled(true)
      sampSetChatInputText('/cput ')
    end
  },
  {
    title = '{9966cc}/ceject [id]{ffffff} - РП отыгровка высадки преступника из автомобиля/мото',
    onclick = function()
      sampSetChatInputEnabled(true)
      sampSetChatInputText('/ceject ')
    end
  },
  {
    title = '{9966cc}/deject [id]{ffffff} - РП отыгровка вытаскивания преступника из автомобиля/мото',
    onclick = function()
      sampSetChatInputEnabled(true)
      sampSetChatInputText('/deject ')
    end
  },
  {
    title = '{9966cc}/ms [type]{ffffff} - РП отыгровка взятия маскировки',
    onclick = function()
      sampSetChatInputEnabled(true)
      sampSetChatInputText('/ms ')
    end
  },
  {
    title = '{9966cc}/keys{ffffff} - РП отыгровка сравнения ключей от КПЗ',
    onclick = function()
      sampSetChatInputEnabled(true)
      sampSetChatInputText('/keys')
    end
  },
  {
    title = '{9966cc}/rh [departament]{ffffff} - Запросить патрульный экипаж в текущий квадрат',
    onclick = function()
      sampSetChatInputEnabled(true)
      sampSetChatInputText('/rh ')
    end
  },
  {
    title = '{9966cc}/tazer{ffffff} - РП тайзер',
    onclick = function()
      sampSetChatInputEnabled(true)
      sampSetChatInputText('/tazer')
    end
  },
  {
    title = '{9966cc}/gr [departament] [reason]{ffffff} - Написать в волну департамента о пересечении юрисдикции',
    onclick = function()
      sampSetChatInputEnabled(true)
      sampSetChatInputText('/gr ')
    end
  },
  {
    title = '{9966cc}/df{ffffff} - Открыть диалог с разминированием бомб',
    onclick = function()
      sampSetChatInputEnabled(true)
      sampSetChatInputText('/df')
    end
  },
  {
      title = '{9966cc}/dmb{ffffff} - Открыть /members в диалоге',
      onclick = function()
        sampSetChatInputText('/dmb')
        sampSetChatInputEnabled(true)
      end
  },
  {
    title = '{ffffff}Продолжение',
    submenu =
    {
      {
        title = '{9966cc}/ar [army]{ffffff} - Попросить разрешение на въезд на военную территорию в волну департамента',
        onclick = function()
          sampSetChatInputEnabled(true)
          sampSetChatInputText('/ar ')
        end
      },
      {
        title = '{9966cc}/kmdc [id]{ffffff} - РП отыгровка фотографии человека через КПК',
        onclick = function()
          sampSetChatInputEnabled(true)
          sampSetChatInputText('/kmdc ')
        end
      },
      {
        title = '{9966cc}/ftazer [type]{ffffff} - РП отыгровка ftazer',
        onclick = function()
          sampSetChatInputEnabled(true)
          sampSetChatInputText('/ftazer ')
        end
      },
      {
        title = '{9966cc}/fvz [id]{ffffff} - Вызвать игрока в офис ФБР со старшими',
        onclick = function()
          sampSetChatInputEnabled(true)
          sampSetChatInputText('/fvz ')
        end
      },
      {
        title = '{9966cc}/fbd [id]{ffffff} - Запросить причину изменения БД по волне департамента',
        onclick = function()
          sampSetChatInputEnabled(true)
          sampSetChatInputText('/fbd ')
        end
      },
      {
        title = '{9966cc}/blg [id] [Фракция] [Причина]{ffffff} - Выразить благодарность по волне департамента',
        onclick = function()
          sampSetChatInputEnabled(true)
          sampSetChatInputText('/blg ')
        end
      },
      {
        title = '{9966cc}/r и /f{ffffff} - Автотег в рацию'
      },
      {
        title = '{9966cc}/yk{ffffff} - Открыть шпору УК',
        onclick = function()
          sampSetChatInputEnabled(true)
          sampSetChatInputText('/yk')
        end
      },
      {
        title = '{9966cc}/fp{ffffff} - Открыть шпору ФП',
        onclick = function()
          sampSetChatInputEnabled(true)
          sampSetChatInputText('/fp')
        end
      },
      {
        title = '{9966cc}/ak{ffffff} - Открыть шпору АК',
        onclick = function()
          sampSetChatInputEnabled(true)
          sampSetChatInputText('/ak')
        end
      },
      {
        title = '{9966cc}/shp{ffffff} - Открыть настраиваемую шпору',
        onclick = function()
        sampSetChatInputEnabled(true)
        sampSetChatInputText('/shp')
        end
      },
      {
        title = '{9966cc}/fyk{ffffff} - Поиск по УК шпоре',
        onclick = function()
          sampSetChatInputEnabled(true)
          sampSetChatInputText('/fyk')
        end
      },
      {
        title = '{9966cc}/ffp{ffffff} - Поиск по ФП шпоре',
        onclick = function()
          sampSetChatInputEnabled(true)
          sampSetChatInputText('/ffp')
        end
      },
      {
        title = '{9966cc}/fak{ffffff} - Поиск по АК шпоре',
        onclick = function()
          sampSetChatInputEnabled(true)
          sampSetChatInputText('/fak')
        end
      },
      {
        title = '{9966cc}/fshp{ffffff} - Поиск по настраиваемой шпоре',
        onclick = function()
          sampSetChatInputEnabled(true)
          sampSetChatInputText('/fshp')
        end
      },
      {
        title = '{9966cc}/fst{ffffff} - Изменить время',
        onclick = function()
          sampSetChatInputEnabled(true)
          sampSetChatInputText('/fst')
        end
      },
      {
        title = '{9966cc}/fsw{ffffff} - Изменить погоду',
        onclick = function()
          sampSetChatInputEnabled(true)
          sampSetChatInputText('/fsw')
        end
      },
      {
        title = '{9966cc}/cc{ffffff} - Очистить чат',
        onclick = function()
          sampSetChatInputEnabled(true)
          sampSetChatInputText('/cc')
        end
      },
      {
        title = '{9966cc}/dkld{ffffff} - Сделать доклад',
        onclick = function()
          sampSetChatInputEnabled(true)
          sampSetChatInputText('/dkld')
        end
      },
      {
        title = '{9966cc}/mcheck{ffffff} - Пробить по /mdc всех на расстоянии 200 метров',
        onclick = function()
          sampSetChatInputEnabled(true)
          sampSetChatInputText('/mcheck')
        end
      },
      {
        title = '{9966cc}/megaf{ffffff} - Мегафон с автоопределением авто',
        onclick = function()
            sampSetChatInputEnabled(true)
            sampSetChatInputText('/megaf')
        end
        }
    }
    }
}

function apply_custom_style()
	imgui.SwitchContext()
	local style = imgui.GetStyle()
	local colors = style.Colors
	local clr = imgui.Col
	local ImVec4 = imgui.ImVec4

	style.WindowRounding = 2.0
	style.WindowTitleAlign = imgui.ImVec2(0.5, 0.5)
	style.ChildWindowRounding = 2.0
	style.FrameRounding = 2.0
	style.ItemSpacing = imgui.ImVec2(5.0, 4.0)
	style.ScrollbarSize = 13.0
	style.ScrollbarRounding = 0
	style.GrabMinSize = 8.0
	style.GrabRounding = 1.0
	-- style.Alpha =
	-- style.WindowPadding =
	-- style.WindowMinSize =
	-- style.FramePadding =
	-- style.ItemInnerSpacing =
	-- style.TouchExtraPadding =
	-- style.IndentSpacing =
	-- style.ColumnsMinSpacing = ?
	-- style.ButtonTextAlign =
	-- style.DisplayWindowPadding =
	-- style.DisplaySafeAreaPadding =
	-- style.AntiAliasedLines =
	-- style.AntiAliasedShapes =
	-- style.CurveTessellationTol =

	colors[clr.Text]                   = ImVec4(1.00, 1.00, 1.00, 1.00)
	colors[clr.TextDisabled]           = ImVec4(0.50, 0.50, 0.50, 1.00)
	colors[clr.WindowBg]               = ImVec4(0.06, 0.06, 0.06, 0.94)
	colors[clr.ChildWindowBg]          = ImVec4(1.00, 1.00, 1.00, 0.00)
	colors[clr.PopupBg]                = ImVec4(0.08, 0.08, 0.08, 0.94)
	colors[clr.ComboBg]                = colors[clr.PopupBg]
	colors[clr.Border]                 = ImVec4(0.43, 0.43, 0.50, 0.50)
	colors[clr.BorderShadow]           = ImVec4(0.00, 0.00, 0.00, 0.00)
	colors[clr.FrameBg]                = ImVec4(0.16, 0.29, 0.48, 0.54)
	colors[clr.FrameBgHovered]         = ImVec4(0.26, 0.59, 0.98, 0.40)
	colors[clr.FrameBgActive]          = ImVec4(0.26, 0.59, 0.98, 0.67)
	colors[clr.TitleBg]                = ImVec4(0.04, 0.04, 0.04, 1.00)
	colors[clr.TitleBgActive]          = ImVec4(0.16, 0.29, 0.48, 1.00)
	colors[clr.TitleBgCollapsed]       = ImVec4(0.00, 0.00, 0.00, 0.51)
	colors[clr.MenuBarBg]              = ImVec4(0.14, 0.14, 0.14, 1.00)
	colors[clr.ScrollbarBg]            = ImVec4(0.02, 0.02, 0.02, 0.53)
	colors[clr.ScrollbarGrab]          = ImVec4(0.31, 0.31, 0.31, 1.00)
	colors[clr.ScrollbarGrabHovered]   = ImVec4(0.41, 0.41, 0.41, 1.00)
	colors[clr.ScrollbarGrabActive]    = ImVec4(0.51, 0.51, 0.51, 1.00)
	colors[clr.CheckMark]              = ImVec4(0.26, 0.59, 0.98, 1.00)
	colors[clr.SliderGrab]             = ImVec4(0.24, 0.52, 0.88, 1.00)
	colors[clr.SliderGrabActive]       = ImVec4(0.26, 0.59, 0.98, 1.00)
	colors[clr.Button]                 = ImVec4(0.26, 0.59, 0.98, 0.40)
	colors[clr.ButtonHovered]          = ImVec4(0.26, 0.59, 0.98, 1.00)
	colors[clr.ButtonActive]           = ImVec4(0.06, 0.53, 0.98, 1.00)
	colors[clr.Header]                 = ImVec4(0.26, 0.59, 0.98, 0.31)
	colors[clr.HeaderHovered]          = ImVec4(0.26, 0.59, 0.98, 0.80)
	colors[clr.HeaderActive]           = ImVec4(0.26, 0.59, 0.98, 1.00)
	colors[clr.Separator]              = colors[clr.Border]
	colors[clr.SeparatorHovered]       = ImVec4(0.26, 0.59, 0.98, 0.78)
	colors[clr.SeparatorActive]        = ImVec4(0.26, 0.59, 0.98, 1.00)
	colors[clr.ResizeGrip]             = ImVec4(0.26, 0.59, 0.98, 0.25)
	colors[clr.ResizeGripHovered]      = ImVec4(0.26, 0.59, 0.98, 0.67)
	colors[clr.ResizeGripActive]       = ImVec4(0.26, 0.59, 0.98, 0.95)
	colors[clr.CloseButton]            = ImVec4(0.41, 0.41, 0.41, 0.50)
	colors[clr.CloseButtonHovered]     = ImVec4(0.98, 0.39, 0.36, 1.00)
	colors[clr.CloseButtonActive]      = ImVec4(0.98, 0.39, 0.36, 1.00)
	colors[clr.PlotLines]              = ImVec4(0.61, 0.61, 0.61, 1.00)
	colors[clr.PlotLinesHovered]       = ImVec4(1.00, 0.43, 0.35, 1.00)
	colors[clr.PlotHistogram]          = ImVec4(0.90, 0.70, 0.00, 1.00)
	colors[clr.PlotHistogramHovered]   = ImVec4(1.00, 0.60, 0.00, 1.00)
	colors[clr.TextSelectedBg]         = ImVec4(0.26, 0.59, 0.98, 0.35)
	colors[clr.ModalWindowDarkening]   = ImVec4(0.80, 0.80, 0.80, 0.35)
end
function getweaponname(weapon)
    local names = {
    [0] = "Fist",
    [1] = "Brass Knuckles",
    [2] = "Golf Club",
    [3] = "Nightstick",
    [4] = "Knife",
    [5] = "Baseball Bat",
    [6] = "Shovel",
    [7] = "Pool Cue",
    [8] = "Katana",
    [9] = "Chainsaw",
    [10] = "Purple Dildo",
    [11] = "Dildo",
    [12] = "Vibrator",
    [13] = "Silver Vibrator",
    [14] = "Flowers",
    [15] = "Cane",
    [16] = "Grenade",
    [17] = "Tear Gas",
    [18] = "Molotov Cocktail",
    [22] = "9mm",
    [23] = "Silenced 9mm",
    [24] = "Desert Eagle",
    [25] = "Shotgun",
    [26] = "Sawnoff Shotgun",
    [27] = "Combat Shotgun",
    [28] = "Micro SMG/Uzi",
    [29] = "MP5",
    [30] = "AK-47",
    [31] = "M4",
    [32] = "Tec-9",
    [33] = "Country Rifle",
    [34] = "Sniper Rifle",
    [35] = "RPG",
    [36] = "HS Rocket",
    [37] = "Flamethrower",
    [38] = "Minigun",
    [39] = "Satchel Charge",
    [40] = "Detonator",
    [41] = "Spraycan",
    [42] = "Fire Extinguisher",
    [43] = "Camera",
    [44] = "Night Vis Goggles",
    [45] = "Thermal Goggles",
    [46] = "Parachute" }
    return names[weapon]
end
local tEditData = {
	id = -1,
	inputActive = false
}
local fileb = getWorkingDirectory() .. "\\config\\fbitools.bind"
local tBindList = {}
if doesFileExist(fileb) then
    local f = io.open(fileb, "r")
    if f then
        tBindList = decodeJson(f:read())
        f:close()
    end
else
    tBindList = {
        [1] = {
            text = "/time",
            v = {key.VK_3}
        },
        [2] = {
            text = "/members",
            v = {key.VK_4}
        },
        [3] = {
            text = "/patrul",
            v = {key.VK_5}
        }
    }
end
local config_keys = {
    oopda = { v = {key.VK_F12}}, 
    oopnet = { v = {key.VK_F11}},
    tazerkey = { v = {key.VK_X}},
    fastmenukey = { v = {key.VK_F2}}
}
function onScriptTerminate(scr)
    if scr == script.this then
		if doesFileExist(fileb) then
			os.remove(fileb)
		end
		local f = io.open(fileb, "w")
		if f then
			f:write(encodeJson(tBindList))
			f:close()
        end
        local fa = io.open("moonloader/config/fbitools/keys.json", "w")
        if fa then
            fa:write(encodeJson(config_keys))
            fa:close()
            print('сахранил')
        end
	end
end
-------------
--HOOKS--
function sp.onPlayerQuit(id, reason)
    if id == gmegafid then
        sampAddChatMessage(' {ffffff}~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~', 0x9966cc)
		sampAddChatMessage('', 0x9966cc)
		sampAddChatMessage(' {ffffff}Игрок: {9966cc}'..sampGetPlayerNickname(gmegafid)..'['..gmegafid..'] {ffffff}вышел из игры', 0x9966cc)
		sampAddChatMessage(' {ffffff}Уровень: {9966cc}'..gmegaflvl, 0x9966cc)
		sampAddChatMessage(' {ffffff}Фракция: {9966cc}'..gmegaffrak, 0x9966cc)
		sampAddChatMessage('', 0x9966cc)
        sampAddChatMessage(' {ffffff}~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~', 0x9966cc)
        gmegafid = nil
        gmegaflvl = nil
        gmegaffrak = nil
    end
end
function sp.onSendSpawn()
    if cfg.main.clistb and rabden then
        lua_thread.create(function()
            wait(cfg.commands.zaderjka)
            ftext(cfg.main.clist)
            sampSendChat('/clist '..cfg.main.clist)
        end)
    end
end
function sp.onServerMessage(color, text)
    if mcheckb then
        if text:find('---======== МОБИЛЬНЫЙ КОМПЬЮТЕР ДАННЫХ ========---') then
            local open = io.open("moonloader/fbitools/mcheck.txt", 'a')
            open:write(string.format('%s\n', text))
            open:close()
        end
        if text:find('Имя:') then
            local open = io.open("moonloader/fbitools/mcheck.txt", 'a')
            open:write(string.format('%s\n', text))
            open:close()
        end
        if text:find('Организация:') then
            local open = io.open("moonloader/fbitools/mcheck.txt", 'a')
            open:write(string.format('%s\n', text))
            open:close()
        end
        if text:find('Преступление:') then
            local open = io.open("moonloader/fbitools/mcheck.txt", 'a')
            open:write(string.format('%s\n', text))
            open:close()
        end
        if text:find('Сообщил:') then
            local open = io.open("moonloader/fbitools/mcheck.txt", 'a')
            open:write(string.format('%s\n', text))
            open:close()
        end
        if text:find('Уровень розыска:') then
            local open = io.open("moonloader/fbitools/mcheck.txt", 'a')
            open:write(string.format('%s\n', text))
            open:close()
        end
        if text:find('---============================================---') then
            local open = io.open("moonloader/fbitools/mcheck.txt", 'a')
            open:write(string.format('%s\n', text))
            open:write(' \n')
            open:close()
        end
    end
    if text:find('Вы посадили в тюрьму') then
        local nik, sek = text:match('Вы посадили в тюрьму (.+) на (.+) секунд')
        if sek == '3600' or sek == '3000'  then
            lua_thread.create(function()
                nikk = nik:gsub('_', ' ')
                aroop = true
                wait(3000)
                ftext(string.format("Запретить рассмотр дела на имя %s", nikk:gsub('_', ' ')), -1)
                ftext('Подтвердить: {9966cc}'..table.concat(rkeys.getKeysName(config_keys.oopda.v), " + ")..'{ffffff} | Отменить: {9966cc}'..table.concat(rkeys.getKeysName(config_keys.oopnet.v), " + "), -1)
            end)
        end
    end
    if text:find('Вы посадили преступника на') then
        local sekk = text:match('Вы посадили преступника на (.+) секунд!')
        if sekk == '3000' or sekk == '3600' then
            lua_thread.create(function()
                nikk = sampGetPlayerNickname(tdmg)
                dmoop = true
                wait(50)
                ftext(string.format("Запретить рассмотр дела на имя %s", nikk:gsub('_', ' ')), -1)
                ftext('Подтвердить: {9966cc}'..table.concat(rkeys.getKeysName(config_keys.oopda.v), " + ")..'{ffffff} | Отменить: {9966cc}'..table.concat(rkeys.getKeysName(config_keys.oopnet.v), " + "), -1)
            end)
        end
    end
    if status then
		if text:match('ID: .+ | .+: .+ %- .+') and not fstatus then
			gosmb = true
			local id, nick, rang, stat = text:match('ID: (%d+) | (.+): (.+) %- (.+)')
			local color = ("%06X"):format(bit.band(sampGetPlayerColor(id), 0xFFFFFF))
			table.insert(players2, string.format('{'..color..'}%s[%s]{ffffff}\t%s\t%s', nick, id, rang, stat))
			return false
		end
		if text:match('Всего: %d+ человек') then
			local count = text:match('Всего: (%d+) человек')
			gcount = count
			gotovo = true
			return false
		end
		if color == -1 then
			return false
		end
		if color == 647175338 then
			return false
        end
        if text:match('ID: .+ | .+: .+') and not fstatus then
			krimemb = true
			local id, nick, rang = text:match('ID: (%d+) | (.+): (.+)')
			local color = ("%06X"):format(bit.band(sampGetPlayerColor(id), 0xFFFFFF))
			table.insert(players1, string.format('{'..color..'}%s[%s]{ffffff}\t%s', nick, id, rang))
			return false
        end
    end
    if warnst then
        if text:find('Организация:') then
            local wcfrac = text:match('Организация: (.+)')
		    wfrac = wcfrac
            if wcfrac == 'Армия СФ' or wcfrac == 'Армия ЛВ' or wcfrac == 'ФБР' then
                wfrac = longtoshort(wcfrac)
            end
        end
    end
    if text:find('Рабочий день начат') and color ~= -1 then
        if cfg.main.clistb then
            lua_thread.create(function()
                wait(100)
                ftext(cfg.main.clist)
                sampSendChat('/clist '..tonumber(cfg.main.clist))
                rabden = true
            end)
        end
    end
    if text:find('Рабочий день окончен') and color ~= -1 then
        rabden = false
    end
    if text:find('Вы поменяли пули на резиновые') then
        tazer = true
    end
    if text:find('Вы поменяли пули на обычные') then
        tazer = false
    end
    if cfg.main.nclear then
        if text:find('удалил из розыскиваемых') then
            local chist, jertva = text:match('%[Clear%] (.+) удалил из розыскиваемых (.+)')
            printStringNow(chist..' cleared '..jertva..' from BD', 3000)
        end
    end
    if text:find('Wanted') and text:find('Сообщает') then
        local id, prestp, police, prichin = text:match('%[Wanted (%d+): (.+)%] %[Сообщает: (.+)%] %[(.+)%]')
        if not cfg.main.offwntd then
            if cfg.main.nwanted then
                return {0x9966CCFF, ' [{ffffff}Wanted '..id..': '..prestp..'{9966cc}] [{ffffff}Сообщает: '..police..'{9966cc}] [{ffffff}'..prichin..'{9966cc}]'}
            end
        else
            local mynick = sampGetPlayerNickname(select(2, sampGetPlayerIdByCharHandle(PLAYER_PED)))
            if police ~= mynick then
                return false
            else
                if cfg.main.nwanted then
                    return {0x9966CCFF, ' [{ffffff}Wanted '..id..': '..prestp..'{9966cc}] [{ffffff}Сообщает: '..police..'{9966cc}] [{ffffff}'..prichin..'{9966cc}]'}
                end
            end
        end
    end
    if text:find('начал преследование за преступником') then
        local polic, prest, yrvn = text:match('Полицейский (.+) начал преследование за преступником (.+) %(Уровень розыска: (.+)%)')
        if not cfg.main.offptrl then
            if cfg.main.nwanted then
                return {0xFFFFFFFF, ' Полицейский {9966cc}'..polic..' {ffffff}начал преследование за {9966cc}'..prest..' {ffffff}(Уровень розыска: {9966cc}'..yrvn..'{ffffff})'}
            end
        else
            local mynick = sampGetPlayerNickname(select(2, sampGetPlayerIdByCharHandle(PLAYER_PED)))
            if polic ~= mynick then
                return false
            else
                if cfg.main.nwanted then
                    return {0xFFFFFFFF, ' Полицейский {9966cc}'..polic..' {ffffff}начал преследование за {9966cc}'..prest..' {ffffff}(Уровень розыска: {9966cc}'..yrvn..'{ffffff})'}
                end
            end
        end
    end
    if cfg.main.nwanted then
        if text:find('удалил из розыскиваемых') then
            local chist, jertva = text:match('%[Clear%] (.+) удалил из розыскиваемых (.+)')
            return {0x9966CCFF, ' [{ffffff}Clear{9966cc}] '..chist..'{ffffff} удалил из розыскиваемых {9966cc}'..jertva}
        end
        if text:find('<<') and text:find('Офицер') and text:find('арестовал') and text:find('>>') then
            local arr, arre = text:match('<< Офицер (.+) арестовал (.+) >>')
            return {0xFFFFFFFF, ' « Офицер {9966CC}'..arr..' {ffffff}арестовал {9966cc}'..arre..' {ffffff}»'}
        end
        if text:find('<<') and text:find('Агент FBI') and text:find('арестовал') and text:find('>>') then
            local arrr, arrre = text:match('<< Агент FBI (.+) арестовал (.+) >>')
            return {0xFFFFFFFF, ' « Агент FBI {9966CC}'..arrr..' {ffffff}арестовал {9966cc}'..arrre..' {ffffff}»'}
        end
        if text:find('Вы посадили преступника на') then
            local sekund = text:match('Вы посадили преступника на (%d+) секунд!')
            return {0xFFFFFFFF, ' Вы посадили преступника на {9966cc}'..sekund..' {ffffff}секунд!'}
        end
    end
end
function sp.onShowDialog(id, style, title, button1, button2, text)
    if id == 1 and cfg.main.parolb then
        sampSendDialogResponse(id, 1, _, cfg.main.parol)
        return false
    end
    if id == 0 and checkstat then
        frak = text:match('.+Организация%:%s+(.+)%s+Ранг')
        rang = text:match('.+Ранг%:%s+(.+)%s+Работа')
        sampCloseCurrentDialogWithButton(0)
        print(text)
        print(frak)
        print(rang)
        checkstat = false
    end
end
function sp.onSendGiveDamage(playerId, damage, weapon, bodypart)
    tdmg = playerId
end
function mcheckf()
    if not doesFileExist('moonloader/fbitools/mcheck.txt') then
        local file = io.open("moonloader/fbitools/mcheck.txt", "w")
        file:close()
        file = nil
    end
end
---------
--CONFIG--
local fbitools =
{
  main =
  {
    posX = 1596,
    posY = 916,
    widehud = 320,
    male = true,
    wanted = false,
    clear = false,
    hud = false,
    tar = 'тэг',
    parol = 'пароль',
    parolb = false,
    tarb = false,
    clistb = false,
    spzamen = false,
    clist = 0,
    offptrl = false,
    offwntd = false
  },
  commands =
  {
    cput = true,
    ceject = true,
    deject = true,
    ftazer = true,
    zaderjka = 1200
  }
}
local fthmenu = {
    {
        title = '{ffffff}» Запросить поддержку в текущий квадрат',
        onclick = function()
            if cfg.main.tarb then
                sampSendChat(string.format('/r [%s]: Нужна поддержка в квадрат %s', cfg.main.tar, kvadrat()))
            else
                sampSendChat(string.format('/r Нужна поддержка в квадрат %s', kvadrat()))
            end
        end
    },
    {
        title = '{ffffff}» Запросить эвакуацию в текущий квадрат',
        onclick = function()
            sampShowDialog(1401, '{9966cc}FBI Tools {ffffff}| Эвакуация', '{ffffff}Введите: кол-во мест\nПример: 3 места', 'Отправить', 'Отмена', 1)
        end
    },
    {
        title = '{ffffff}» Цены выкупа',
        onclick = function()
            submenus_show(fcmenu, '{9966cc}FBI Tools {ffffff}| Цены выкупа')
        end
    }
}
megaftimer = nil
----------
local libs = {'sphere.lua', 'rkeys.lua', 'imcustom/hotkey.lua', 'imgui.lua', 'MoonImGui.dll', 'imgui_addons.lua'}
function main()
    while not isSampAvailable() do wait(0) end
    ftext('FBI Tools успешно загружен. Введите: /fthelp что бы получить дополнительную информацию.')
    ftext('Авторы: Sesh Jefferson, Thomas Lawson')
    if not doesDirectoryExist('moonloader\\config') then createDirectory('moonloader\\config') end
    if not doesDirectoryExist('moonloader\\config\\fbitools') then createDirectory('moonloader\\config\\fbitools') end
    if not doesDirectoryExist('moonloader/fbitools') then createDirectory('moonloader/fbitools') end
    cfg = inicfg.load(fbitools, 'fbitools/config.ini')
    if not doesDirectoryExist('moonloader/lib/imcustom') then createDirectory('moonloader/lib/imcustom') end
    for k, v in pairs(libs) do
        if not doesFileExist('moonloader/lib/'..v) then
            downloadUrlToFile('https://raw.githubusercontent.com/WhackerH/kirya/master/lib/'..v, getWorkingDirectory()..'\\lib\\'..v)
            print('Загружается библиотека '..v)
        end
    end
    if not doesFileExist("moonloader/config/fbitools/keys.json") then
        local fa = io.open("moonloader/config/fbitools/keys.json", "w")
        fa:close()
    else
        local fa = io.open("moonloader/config/fbitools/keys.json", 'r')
        if fa then
            config_keys = decodeJson(fa:read('*a'))
        end
    end
    while not sampIsLocalPlayerSpawned() do wait(0) end
    rkeys = require 'rkeys'
    hk = require 'lib.imcustom.hotkey'
    wm = require 'lib.windows.message'
    gk = require 'game.keys'
    Sphere = require 'Sphere'
    imgui = require 'imgui'
    mainwin = imgui.ImBool(false)
    setwindows = imgui.ImBool(false)
    shpwindow = imgui.ImBool(false)
    ykwindow = imgui.ImBool(false)
    fpwindow = imgui.ImBool(false)
    akwindow = imgui.ImBool(false)
    pozivn = imgui.ImBool(false)
    updwindows = imgui.ImBool(false)
    bMainWindow = imgui.ImBool(false)
    sInputEdit = imgui.ImBuffer(128)
    bIsEnterEdit = imgui.ImBool(false)
    imgui.HotKey = require('imgui_addons').HotKey
    apply_custom_style()
    addEventHandler("onWindowMessage", function (msg, wparam, lparam)
        if msg == wm.WM_KEYDOWN or msg == wm.WM_SYSKEYDOWN then
            if tEditData.id > -1 then
                if wparam == key.VK_ESCAPE then
                    tEditData.id = -1
                    consumeWindowMessage(true, true)
                elseif wparam == key.VK_TAB then
                    bIsEnterEdit.v = not bIsEnterEdit.v
                    consumeWindowMessage(true, true)
                end
            end
        end
    end)
    Sphere.createSphere(-1984.6375732422, 106.85540008545, 27.42943572998, 50.0)-- -1984.6375732422 106.85540008545 27.42943572998 -- АВСФ [1]
    Sphere.createSphere(-2055.283203125, -84.472702026367, 35.064281463623, 50.0)-- -2055.283203125 -84.472702026367 35.064281463623 -- АШ [2]
    Sphere.createSphere(-1521.4412841797, 503.20678710938, 6.7215604782104, 40.0)-- -1521.4412841797 503.20678710938 6.7215604782104 -- СФа [3]
    Sphere.createSphere(-1702.3824462891, 684.79150390625, 25.01790618896, 30.0)-- -1702.3824462891 684.79150390625 25.017906188965 -- Пост В СФПД [4]
    Sphere.createSphere(-1574.4406738281, 662.24047851563, 7.3254537582397, 20.0)-- -1574.4406738281 662.24047851563 7.3254537582397 Пост А СФПД [5]
    Sphere.createSphere(-2013.1629638672, 464.77380371094, 35.313331604004, 30.0)-- -2013.1629638672 464.77380371094 35.313331604004 -- СФн [6]
    Sphere.createSphere(-1749.7822265625, -591.34033203125, 16.62273979187, 100.0)-- -1749.7822265625 -591.34033203125 16.62273979187 -- Тоннель [7]
    Sphere.createSphere(1481.77734375, -1739.9536132813, 13.546875, 70.0)-- 1481.77734375 -1739.9536132813 13.546875 -- Мэрия [8]
    Sphere.createSphere(-2448.3591308594, 725.09326171875, 34.756977081299, 70.0)-- -2448.3591308594 725.09326171875 34.756977081299 -- Хот-Доги [9]
    Sphere.createSphere(1186.5642089844, -1322.2257080078,13.098788261414, 50.0)-- 1186.5642089844 -1322.2257080078 13.098788261414 -- Больница ЛС [10]
    Sphere.createSphere(1195.8181152344, -1741.1024169922, 13.131011962891, 70.0)-- 1195.8181152344 -1741.1024169922 13.131011962891 -- АВ ЛС [11]
    Sphere.createSphere(1667.1462402344, -768.31890869141, 54.092594146729, 70.0)-- 1667.1462402344 -768.31890869141 54.092594146729 -- Мост ЛС-ЛВ [12]
    Sphere.createSphere(1766.12109375,   874.89379882813,   10.887091636658, 70.0)-- 1820.5036621094 816.41632080078 10.8203125 -- Перекросток LVPD [13]
    Sphere.createSphere(1155.6971435547, 831.9443359375, 10.409364700317, 80.0)-- 1155.6971435547 831.9443359375 10.409364700317 Развилка LVPD [14]
    Sphere.createSphere(2033.3028564453, 1007.163269043, 10.8203125, 50.0)-- 2033.3028564453 1007.163269043 10.8203125 Постовой В LVPD [4 Дракона] [15]
    Sphere.createSphere(2824.7353515625, 1292.9085693359, 10.764576911926, 50.0)-- 2824.7353515625 1292.9085693359 10.764576911926 Постовой А LVPD [АВЛВ] [16]
    Sphere.createSphere(2180.99609375, 1676.2248535156, 11.060985565186, 50.0)-- 2180.99609375 1676.2248535156 11.060985565186 Постовой В LVPD [Каллигула] [17]
    Sphere.createSphere(1727.3302001953, 1618.9171142578, 9.8169927597046, 50.0)-- 1727.3302001953 1618.9171142578 9.8169927597046 -- Пост С LVPD [18]
    Sphere.createSphere(1545.6296386719, -1631.2828369141, 13.3828125, 50.0)-- 1545.6296386719 -1631.2828369141 13.3828125 -- КПП ЛСПД [19]
    Sphere.createSphere(2753.5388183594, -2432.2268066406, 13.64318561554, 80.0)-- 2753.5388183594 -2432.2268066406 13.64318561554 -- Порт ЛС[20]
    Sphere.createSphere(2293.4145507813, -1584.8774414063, 3.5703411102295, 670.0)--  2293.4145507813 -1584.8774414063 3.5703411102295 -- Патруль гетто [21]
    Sphere.createSphere(186.95843505859, 1901.0294189453, 17.640625, 300.0)-- 186.95843505859 1901.0294189453 17.640625 -- Патруль ЛВа [22]
    Sphere.createSphere(-422, -1195, 60, 500.0)-- -422 -1195 60 --Юрисдикция ЛС - СФ [23]
    Sphere.createSphere(1644, -25, 36, 300.0)-- 1644 -25 36 --Юрисдикция ЛС - ЛВ [24]
    Sphere.createSphere(413, 625, 18, 300.0)-- 413 625 18 Юрисдикция ЛС- ЛВ 2 [25]
    Sphere.createSphere(-129, 518, 8, 300.0)-- -129 518 8 Юрисдикция ЛС - ЛВ 3 [26]
    Sphere.createSphere(-1003, 1285, 40, 300.0)-- -1003 1285 40 Юрисдикция СФ - ЛВ [27]
    Sphere.createSphere(-2126, 2654, 53, 300.0)-- -2126 2654 53 Юрисдикция СФ - ЛВ 2 [28]
    Sphere.createSphere(-1006, -442, 36, 300.0)-- -1006 -442 36 Юрисдикция ЛС - СФ 2 [29]
    Sphere.createSphere(-1126, -2574, 72, 300.0)-- -1126 -2574 72 Юрисдикция ЛС - СФ 3 [30]
    Sphere.createSphere(-1248, -2867, 64, 300.0)-- -1248 -2867 64 Юрисдикция ЛС- СФ 4 [31]
    Sphere.createSphere(2238.6533203125,   2449.4895019531,   11.037217140198, 10.0) -- 2238.6533203125   2449.4895019531   11.037217140198 -- КПП ЛВПД [32]
    Sphere.createSphere(2458.4575195313,   1340.5772705078,   10.9765625, 30) -- 2458.4575195313   1340.5772705078   10.9765625 -- LVPD D [33]
    Sphere.createSphere(373.66720581055,   173.75173950195,   1008.3893432617, 30) -- 373.66720581055,   173.75173950195,   1008.3893432617 -- Холл мэрии [34]
    commands()
    mcheckf()
    shpf()
    ykf()
    akf()
    fpf()
    wait(1000)
	for k, v in pairs(tBindList) do
		rkeys.registerHotKey(v.v, true, onHotKey)
    end
    tazerbind = rkeys.registerHotKey(config_keys.tazerkey.v, true, function() sampSendChat('/tazer') end)
    fastmenubind = rkeys.registerHotKey(config_keys.fastmenukey.v, true, function() lua_thread.create(function() submenus_show(fthmenu, '{9966cc}FBI Tools') end) end)
    oopdabind = rkeys.registerHotKey(config_keys.oopda.v, true, oopdakey)
    oopnetbind = rkeys.registerHotKey(config_keys.oopnet.v, true, oopnetkey)
    nizfont = renderCreateFont('Ariel', 10, 9)
    if not sampIsDialogActive() then
        checkStats()
    else
        while sampIsDialogActive() do wait(0) end
        checkStats()
    end
    update()
    while true do wait(0)
        infbar = imgui.ImBool(cfg.main.hud)
        imgui.Process = mainwin.v or infbar.v or shpwindow.v or ykwindow.v or fpwindow.v or akwindow.v
        function imgui.CentrText(text)
            local width = imgui.GetWindowWidth()
            local calc = imgui.CalcTextSize(text)
            imgui.SetCursorPosX( width / 2 - calc.x / 2 )
            imgui.Text(text)
        end
        function imgui.OnDrawFrame()
            if infbar.v then
                imgui.ShowCursor = false
                _, myid = sampGetPlayerIdByCharHandle(PLAYER_PED)
                local myname = sampGetPlayerNickname(myid)
                local myping = sampGetPlayerPing(myid)
                local myweapon = getCurrentCharWeapon(PLAYER_PED)
                local myweaponammo = getAmmoInCharWeapon(PLAYER_PED, myweapon)
                local valid, ped = getCharPlayerIsTargeting(PLAYER_HANDLE)
                local myweaponname = getweaponname(myweapon)
                imgui.SetNextWindowPos(imgui.ImVec2(cfg.main.posX, cfg.main.posY), imgui.ImVec2(0.5, 0.5))
                imgui.SetNextWindowSize(imgui.ImVec2(cfg.main.widehud, 160), imgui.Cond.FirstUseEver)
                imgui.Begin('FBI Tools', infbar, imgui.WindowFlags.NoResize + imgui.WindowFlags.NoCollapse + imgui.WindowFlags.NoTitleBar)
                imgui.CentrText('FBI Tools')
                imgui.Separator()
                imgui.Text('Information: '..myname..'['..myid..'] | Ping: '..myping) -- простой текст внутри этого окна
                imgui.Text('Current weapon: '..myweaponname..'['..myweaponammo..']')
                if isCharInAnyCar(playerPed) then
                    local vHandle = storeCarCharIsInNoSave(playerPed)
                    local result, vID = sampGetVehicleIdByCarHandle(vHandle)
                    local vHP = getCarHealth(vHandle)
                    local carspeed = getCarSpeed(vHandle)
                    local speed = math.floor(carspeed)
                    local vehName = getCarNamebyModel(getCarModel(storeCarCharIsInNoSave(playerPed)))
                    local ncspeed = math.floor(carspeed*2)
                    imgui.Text('Vehicle: '..vehName..'['..vID..'] | HP: '..vHP..' | Speed: '..ncspeed)
                else
                    imgui.Text('Vehicle: No')
                end
                if valid and doesCharExist(ped) then -- если цель есть и персонаж существует
                    local result, id = sampGetPlayerIdByCharHandle(ped) -- получить samp-ид игрока по хендлу персонажа
                    if result then
                        local targetname = sampGetPlayerNickname(id) -- проверить, прошло ли получение ида успешно
                        local targetscore = sampGetPlayerScore(id)
                        imgui.Text('Target: '..targetname..'['..id..'] | LVL: '..targetscore)
                    end
                else
                    imgui.Text('Target: No')
                end
                imgui.Text('Location: '..u8(kvadrat()))
                imgui.Text('Current Time: '..os.date('%H:%M:%S'))
                if tazer == true then
                    imgui.Text('Tazer: ON')
                else
                    imgui.Text('Tazer: OFF')
                end
                imgui.End()
            end
            if bMainWindow.v then
                imgui.LockPlayer = true
                imgui.ShowCursor = true
                local iScreenWidth, iScreenHeight = getScreenResolution()
                imgui.SetNextWindowPos(imgui.ImVec2(iScreenWidth / 2, iScreenHeight / 2), imgui.Cond.FirstUseEver, imgui.ImVec2(0.5, 0.5))
                imgui.SetNextWindowSize(imgui.ImVec2(800, 525), imgui.Cond.FirstUseEver)
                imgui.Begin(u8("FBI Tools | Биндер##main"), bMainWindow, imgui.WindowFlags.NoCollapse + imgui.WindowFlags.NoResize)
                imgui.Text(u8'Для корректной работы биндера рекомендуется перезагрузить скрипт после изменения настроек биндера.')
                imgui.Separator()
                imgui.BeginChild("##bindlist", imgui.ImVec2(795, 442))
                for k, v in ipairs(tBindList) do
                    if hk.HotKey("##HK" .. k, v, tLastKeys, 100) then
                        if not rkeys.isHotKeyDefined(v.v) then
                            if rkeys.isHotKeyDefined(tLastKeys.v) then
                                rkeys.unRegisterHotKey(tLastKeys.v)
                            end
                            rkeys.registerHotKey(v.v, true, onHotKey)
                        end
                    end
                    imgui.SameLine()
                    if tEditData.id ~= k then
                        local sText = v.text:gsub("%[enter%]$", "")
                        imgui.BeginChild("##cliclzone" .. k, imgui.ImVec2(500, 21))
                        imgui.AlignTextToFramePadding()
                        if sText:len() > 0 then
                            imgui.Text(u8(sText))
                        else
                            imgui.TextDisabled(u8("Пустое сообщение ..."))
                        end
                        imgui.EndChild()
                        if imgui.IsItemClicked() then
                            sInputEdit.v = sText:len() > 0 and u8(sText) or ""
                            bIsEnterEdit.v = string.match(v.text, "(.)%[enter%]$") ~= nil
                            tEditData.id = k
                            tEditData.inputActve = true
                        end
                    else
                        imgui.PushAllowKeyboardFocus(false)
                        imgui.PushItemWidth(500)
                        local save = imgui.InputText(k.."##Edit" .. k, sInputEdit, imgui.InputTextFlags.EnterReturnsTrue)
                        imgui.PopItemWidth()
                        imgui.PopAllowKeyboardFocus()
                        imgui.SameLine()
                        imgui.Checkbox(u8("Ввод") .. "##editCH" .. k, bIsEnterEdit)
                        if save then
                            tBindList[tEditData.id].text = u8:decode(sInputEdit.v) .. (bIsEnterEdit.v and "[enter]" or "")
                            tEditData.id = -1
                        end
                        if tEditData.inputActve then
                            tEditData.inputActve = false
                            imgui.SetKeyboardFocusHere(-1)
                        end
                    end
                end
                imgui.EndChild()
                imgui.Separator()
                if imgui.Button(u8"Добавить клавишу") then
                    tBindList[#tBindList + 1] = {text = "", v = {}}
                end
            imgui.End()
            end
            if setwindows.v then
                local x, y = getScreenResolution()
                local cput =  imgui.ImBool(cfg.commands.cput)
                local ceject = imgui.ImBool(cfg.commands.ceject)
                local ftazer = imgui.ImBool(cfg.commands.ftazer)
                local deject = imgui.ImBool(cfg.commands.deject)
                local stateb = imgui.ImBool(cfg.main.male)
                local tagf = imgui.ImBuffer(u8(cfg.main.tar), 256)
                local parolf = imgui.ImBuffer(u8(cfg.main.parol), 256)
                local tagb = imgui.ImBool(cfg.main.tarb)
                local xcord = imgui.ImInt(cfg.main.posX)
                local ycord = imgui.ImInt(cfg.main.posY)
                local clistbuffer = imgui.ImInt(cfg.main.clist)
                local waitbuffer = imgui.ImInt(cfg.commands.zaderjka)
                local clistb = imgui.ImBool(cfg.main.clistb)
                local parolb = imgui.ImBool(cfg.main.parolb)
                local offptrlb = imgui.ImBool(cfg.main.offptrl)
                local offwntdb = imgui.ImBool(cfg.main.offwntd)
                imgui.SetNextWindowPos(imgui.ImVec2(x/2, y/2), imgui.Cond.FirstUseEver, imgui.ImVec2(0.5, 0.5))
                imgui.Begin(u8'Настройки##1', setwindows, imgui.WindowFlags.AlwaysAutoResize)
                imgui.BeginChild('##set', imgui.ImVec2(140, 200), true)
                if imgui.Selectable(u8'Основные') then show = 1 end
                if imgui.Selectable(u8'Команды') then show = 2 end
                if parolb.v then
                    if imgui.Selectable(u8'Авто логин') then show = 3 end
                end
                imgui.EndChild()
                imgui.SameLine()
                imgui.BeginChild('##set1', imgui.ImVec2(720, 200), true)
                if show == 1 then
                    if imgui.Checkbox(u8'Скрывать сообщения о начале преследования', offptrlb) then
                        cfg.main.offptrl = not cfg.main.offptrl
                        inicfg.save(fbitools, 'fbitools/config.ini')
                    end
                    if imgui.Checkbox(u8'Скрывать сообщения о выдаче розыска', offwntdb) then
                        cfg.main.offwntd = not cfg.main.offwntd
                        inicfg.save(fbitools, 'fbitools/config.ini')
                    end
                    if imgui.Checkbox(u8'Мужские отыгровки', stateb) then
                        cfg.main.male = not cfg.main.male
                        inicfg.save(fbitools, 'fbitools/config.ini')
                    end
                    if imgui.Checkbox(u8'Использовать автотег', tagb) then
                        cfg.main.tarb = not cfg.main.tarb
                        inicfg.save(fbitools, 'fbitools/config.ini')
                    end
                    if tagb.v then
                        if imgui.InputText(u8'Введите ваш Тег.', tagf) then
                            cfg.main.tar = u8:decode(tagf.v)
                            inicfg.save(fbitools, 'fbitools/config.ini')
                        end
                    end
                    if imgui.Checkbox(u8'Использовать авто логин', parolb) then
                        cfg.main.parolb = not cfg.main.parolb
                        inicfg.save(fbitools, 'fbitools/config.ini')
                    end
                    if imgui.Checkbox(u8'Использовать автоклист', clistb) then
                        cfg.main.clistb = not cfg.main.clistb
                        inicfg.save(fbitools, 'fbitools/config.ini')
                    end
                    if clistb.v then
                        if imgui.SliderInt(u8"Выберите значение клиста", clistbuffer, 0, 33) then
                            cfg.main.clist = clistbuffer.v
                            inicfg.save(fbitools, 'fbitools/config.ini')
                        end
                    end
                    if imgui.HotKey(u8'##Клавиша быстрого тазера', config_keys.tazerkey, tLastKeys, 100) then
                        rkeys.changeHotKey(tazerbind, config_keys.tazerkey.v)
                        ftext('Клавиша успешно изменена. Старое значение: '.. table.concat(rkeys.getKeysName(tLastKeys.v), " + ") .. ' | Новое значение: '.. table.concat(rkeys.getKeysName(config_keys.tazerkey.v), " + "))
                    end
                    imgui.SameLine()
                    imgui.Text(u8'Клавиша быстрого тазера')
                    if imgui.HotKey('##fastmenu', config_keys.fastmenukey, tLastKeys, 100) then
                        rkeys.changeHotKey(fastmenubind, config_keys.fastmenukey.v)
                        ftext('Клавиша успешно изменена. Старое значение: '.. table.concat(rkeys.getKeysName(tLastKeys.v), " + ") .. ' | Новое значение: '.. table.concat(rkeys.getKeysName(config_keys.fastmenukey.v), " + "))
                    end
                    imgui.SameLine()
                    imgui.Text(u8('Клавиша быстрого меню'))
                    if imgui.HotKey('##oopda', config_keys.oopda, tLastKeys, 100) then
                        rkeys.changeHotKey(oopdabind, config_keys.oopda.v)
                        ftext('Клавиша успешно изменена. Старое значение: '.. table.concat(rkeys.getKeysName(tLastKeys.v), " + ") .. ' | Новое значение: '.. table.concat(rkeys.getKeysName(config_keys.oopda.v), " + "))
                    end
                    imgui.SameLine()
                    imgui.Text(u8('Клавиша подтверждения'))
                    if imgui.HotKey('##oopda', config_keys.oopnet, tLastKeys, 100) then
                        rkeys.changeHotKey(oopnetbind, config_keys.oopnet.v)
                        ftext('Клавиша успешно изменена. Старое значение: '.. table.concat(rkeys.getKeysName(tLastKeys.v), " + ") .. ' | Новое значение: '.. table.concat(rkeys.getKeysName(config_keys.oopnet.v), " + "))
                    end
                    imgui.SameLine()
                    imgui.Text(u8('Клавиша отмены'))
                    if imgui.InputInt(u8'Задержка в отыгровках', waitbuffer) then
                        cfg.commands.zaderjka = waitbuffer.v
                        inicfg.save(fbitools, 'fbitools/config.ini')
                    end
                end
                if show == 2 then
                    if imgui.Checkbox(u8('Отыгровка /cput'), cput) then
                        cfg.commands.cput = not cfg.commands.cput
                        inicfg.save(fbitools, 'fbitools/config.ini')
                    end
                    if imgui.Checkbox(u8('Отыгровка /ceject'), ceject) then
                        cfg.commands.ceject = not cfg.commands.ceject
                        inicfg.save(fbitools, 'fbitools/config.ini')
                    end
                    if imgui.Checkbox(u8('Отыгровка /ftazer'), ftazer) then
                        cfg.commands.ftazer = not cfg.commands.ftazer
                        inicfg.save(fbitools, 'fbitools/config.ini')
                    end
                    if imgui.Checkbox(u8('Отыгровка /deject'), deject) then
                        cfg.commands.deject = not cfg.commands.deject
                        inicfg.save(fbitools, 'fbitools/config.ini')
                    end
                end
                if show == 3 then
                    if imgui.InputText(u8'Введите ваш пароль.', parolf, imgui.InputTextFlags.Password) then
                        cfg.main.parol = u8:decode(parolf.v)
                        inicfg.save(fbitools, 'fbitools/config.ini')
                    end
                    if imgui.Button(u8'Узнать пароль') then
                        ftext('Ваш пароль: '..cfg.main.parol)
                    end
                end
                imgui.EndChild()
                imgui.End()
            end
            if mainwin.v then
                imgui.LockPlayer = true
                imgui.ShowCursor = true
                local x, y = getScreenResolution()
                local btn_size = imgui.ImVec2(-0.1, 0)
                imgui.SetNextWindowSize(imgui.ImVec2(300, 300), imgui.Cond.FirstUseEver)
                imgui.SetNextWindowPos(imgui.ImVec2(x/2, y/2), imgui.Cond.FirstUseEver, imgui.ImVec2(0.5, 0.5))
                imgui.Begin('FBI Tools | Main Menu | Version: '..thisScript().version, mainwin)
                if imgui.Button(u8'Биндер', btn_size) then
                    bMainWindow.v = not bMainWindow.v
                end
                if imgui.Button(u8(cfg.main.hud and 'Выключить инфо-бар' or 'Включить инфобар'), btn_size) then
                    cfg.main.hud = not cfg.main.hud
                    inicfg.save(fbitools, 'fbitools/config.ini')
                    ftext(cfg.main.hud and 'Инфо-бар включен' or 'Инфо-бар выключен')
                end
                if imgui.Button(u8(cfg.main.nwanted and 'Выключить обновленный Wanted' or 'Включить обновленный Wanted'), btn_size) then
                    cfg.main.nwanted = not cfg.main.nwanted
                    inicfg.save(fbitools, 'fbitools/config.ini')
                    ftext(cfg.main.nwanted and 'Обновленый Wanted включен' or 'Обновленый Wanted выключен')
                end
                if imgui.Button(u8(cfg.main.nclear and 'Выключить дополненый Clear' or 'Включить дополненый Clear'), btn_size) then --дополненый Clear
                    cfg.main.nclear = not cfg.main.nclear
                    inicfg.save(fbitools, 'fbitools/config.ini')
                    ftext(cfg.main.nclear and 'Дополненый Clear включен' or 'Дополненый Clear выключен')
                end
                if imgui.Button(u8'Настройки скрипта', btn_size) then
                    setwindows.v = not setwindows.v
                end
                if imgui.Button(u8'Перезагрузить скрипт', btn_size) then
                    showCursor(false)
                    inicfg.save(fbitools, 'fbitools/config.ini')
                    thisScript():reload()
                end
                imgui.End()
            end
            if shpwindow.v then
                imgui.LockPlayer = true
                imgui.ShowCursor = true
                local iScreenWidth, iScreenHeight = getScreenResolution()
                imgui.SetNextWindowPos(imgui.ImVec2(iScreenWidth / 2, iScreenHeight / 2), imgui.Cond.FirstUseEver, imgui.ImVec2(0.5, 0.5))
                imgui.SetNextWindowSize(imgui.ImVec2(iScreenWidth/2, iScreenHeight / 2), imgui.Cond.FirstUseEver)
                imgui.Begin(u8('FBI Tools | Шпора'), shpwindow)
                for line in io.lines('moonloader\\fbitools\\shp.txt') do
                    imgui.TextWrapped(u8(line))
                end
                imgui.End()
            end
            if akwindow.v then
                imgui.LockPlayer = true
                imgui.ShowCursor = true
                local iScreenWidth, iScreenHeight = getScreenResolution()
                imgui.SetNextWindowPos(imgui.ImVec2(iScreenWidth / 2, iScreenHeight / 2), imgui.Cond.FirstUseEver, imgui.ImVec2(0.5, 0.5))
                imgui.SetNextWindowSize(imgui.ImVec2(iScreenWidth/2, iScreenHeight / 2), imgui.Cond.FirstUseEver)
                imgui.Begin(u8('FBI Tools | Административный кодекс'), akwindow)
                for line in io.lines('moonloader\\fbitools\\ak.txt') do
                    imgui.TextWrapped(u8(line))
                end
                imgui.End()
            end
            if fpwindow.v then
                imgui.LockPlayer = true
                imgui.ShowCursor = true
                local iScreenWidth, iScreenHeight = getScreenResolution()
                imgui.SetNextWindowPos(imgui.ImVec2(iScreenWidth / 2, iScreenHeight / 2), imgui.Cond.FirstUseEver, imgui.ImVec2(0.5, 0.5))
                imgui.SetNextWindowSize(imgui.ImVec2(iScreenWidth/2, iScreenHeight / 2), imgui.Cond.FirstUseEver)
                imgui.Begin(u8('FBI Tools | Федеральное постановление'), fpwindow)
                for line in io.lines('moonloader\\fbitools\\fp.txt') do
                    imgui.TextWrapped(u8(line))
                end
                imgui.End()
            end
            if ykwindow.v then
                imgui.LockPlayer = true
                imgui.ShowCursor = true
                local iScreenWidth, iScreenHeight = getScreenResolution()
                imgui.SetNextWindowPos(imgui.ImVec2(iScreenWidth / 2, iScreenHeight / 2), imgui.Cond.FirstUseEver, imgui.ImVec2(0.5, 0.5))
                imgui.SetNextWindowSize(imgui.ImVec2(iScreenWidth/2, iScreenHeight / 2), imgui.Cond.FirstUseEver)
                imgui.Begin(u8('FBI Tools | Уголовный кодекс'), ykwindow)
                for line in io.lines('moonloader\\fbitools\\yk.txt') do
                    imgui.TextWrapped(u8(line))
                end
                imgui.End()
            end
            if updwindows.v then
                local updlist = ttt
                imgui.LockPlayer = true
                imgui.ShowCursor = true
                local iScreenWidth, iScreenHeight = getScreenResolution()
                imgui.SetNextWindowPos(imgui.ImVec2(iScreenWidth / 2, iScreenHeight / 2), imgui.Cond.FirstUseEver, imgui.ImVec2(0.5, 0.5))
                imgui.SetNextWindowSize(imgui.ImVec2(700, 290), imgui.Cond.FirstUseEver)
                imgui.Begin(u8('FBI Tools | Обновление'), updwindows, imgui.WindowFlags.NoCollapse + imgui.WindowFlags.NoResize)
                imgui.Text(u8('Вышло обновление скрипта FBI Tools! Что бы обновиться нажмите кнопку внизу. Список изменений:'))
                imgui.Separator()
                imgui.BeginChild("uuupdate", imgui.ImVec2(690, 200))
                for line in ttt:gmatch('[^\r\n]+') do
                    imgui.Text(line)
                end
                imgui.EndChild()
                imgui.Separator()
                imgui.PushItemWidth(305)
                if imgui.Button(u8("Обновить"), imgui.ImVec2(339, 25)) then
                    lua_thread.create(goupdate)
                    updwindows.v = false
                end
                imgui.SameLine()
                if imgui.Button(u8("Отложить обновление"), imgui.ImVec2(339, 25)) then
                    updwindows.v = false
                end
                imgui.End()
            end
        end
        function rkeys.onHotKey(id, keys)
            if sampIsChatInputActive() or sampIsDialogActive() or isSampfuncsConsoleActive() then
                return false
            end
        end
        function Sphere.onEnterSphere(id)
            post = id
        end
        function Sphere.onExitSphere(id)
              post = nil
        end
        local myskin = getCharModel(PLAYER_PED)
        local mmx, mmy, mmz = getCharCoordinates(PLAYER_PED)
        if megaftimer ~= nil then
            if megaftimer <= os.time() then
                ftext('Время погони истекло')
                gmegafid = nil
                gmegaflvl = nil
                gmegaffrak = nil
                megaftimer = nil
                gmegafhandle = nil
            end
        end
        if not doesCharExist(gmegafhandle) and gmegafhandle ~= nil then
            ftext(string.format('Игрок {9966cc}%s[%s] {ffffff}потерян из поля зрения', sampGetPlayerNickname(gmegafid), gmegafid))
            gmegafid = nil
			gmegaflvl = nil
			gmegaffrak = nil
            megaftimer = nil
            gmegafhandle = nil
        end
        if myskin == 280 or myskin == 265 or myskin == 266 or myskin == 267 or myskin == 281 or myskin == 282 or myskin == 288 or myskin == 284 or myskin == 285 or myskin == 304 or myskin == 305 or myskin == 306 or myskin == 307 or myskin == 309 or myskin == 283 or myskin == 286 or myskin == 287 or myskin == 252 or myskin == 279 or myskin == 163 or myskin == 164 or myskin == 165 or myskin == 166 then
            rabden = true
        end
        if changetextpos then
            sampToggleCursor(true)
            local CPX, CPY = getCursorPos()
            cfg.main.posX = CPX
            cfg.main.posY = CPY
        end
        local myhp = getCharHealth(PLAYER_PED)
        local valid, ped = getCharPlayerIsTargeting(PLAYER_HANDLE)
        if valid and doesCharExist(ped) then
            local result, id = sampGetPlayerIdByCharHandle(ped)
            if result and wasKeyPressed(key.VK_Z) then
                gmegafhandle = ped
                gmegafid = id
                gmegaflvl = sampGetPlayerScore(id)
                gmegaffrak = getFraktionBySkin(id)
                --[[ftext(gmegafid)
                ftext(gmegaflvl)
                ftext(gmegaffrak)]]
				megaftimer = os.time() + 300
                submenus_show(pkmmenu(id), "{9966cc}FBI Tools {ffffff}| "..sampGetPlayerNickname(id).."["..id.."] ")
            end
        end
        oopchat()
        local result, button, list, input = sampHasDialogRespond(1385)
        local result1, button, list, input = sampHasDialogRespond(1386)
        local result2, button, list, input = sampHasDialogRespond(1387)
        local result3, button, list, input = sampHasDialogRespond(1388)
        local result4, button, list, input = sampHasDialogRespond(1389)
        local result5, button, list, input = sampHasDialogRespond(1390)
        local result6, button, list, input = sampHasDialogRespond(1391)
        local result7, button, list, input = sampHasDialogRespond(1392)
        local result8, button, list, input = sampHasDialogRespond(1393)
        local result9, button, list, input = sampHasDialogRespond(1394)
        local result10, button, list, input = sampHasDialogRespond(1395)
        local result11, button, list, input = sampHasDialogRespond(1396)
        local result12, button, list, input = sampHasDialogRespond(1397)
        local result13, button, list, input = sampHasDialogRespond(1398)
        local result14, button, list, input = sampHasDialogRespond(1399)
        local result15, button, list, input = sampHasDialogRespond(1400)
        local result16, button, list, input = sampHasDialogRespond(1401)
        local _, myid = sampGetPlayerIdByCharHandle(PLAYER_PED)
        if result16 then
            if input ~= '' and button == 1 then
                if cfg.main.tarb then
                    sampSendChat(string.format('/r [%s] Запрашиваю эвакуацию в квадрат %s на %s', cfg.main.tar, kvadrat(), input))
                else
                    sampSendChat(string.format('/r Запрашиваю эвакуацию в квадрат %s на %s', kvadrat(), input))
                end
            end
        end
        if result then
            if button == 1 then
                if cfg.main.male == true then
                    sampSendChat("/r Переоделся в одежду гражданского. Причина: "..input)
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/rb "..myid)
                end
                if cfg.main.male == false then
                    sampSendChat("/r Переоделась в одежду гражданского. Причина: "..input)
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/rb "..myid)
                end
            end
        end
        if result1 then
            if button == 1 then
                if cfg.main.male == true then
                    sampSendChat("/r Переоделся в форму полицейского. Причина: "..input)
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/rb "..myid)
                end
                if cfg.main.male == false then
                    sampSendChat("/r Переоделась в форму полицейского. Причина: "..input)
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/rb "..myid)
                end
            end
        end
        if result2 then
            if button == 1 then
                if cfg.main.male == true then
                    sampSendChat("/r Переоделся в форму армейского. Причина: "..input)
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/rb "..myid)
                end
                if cfg.main.male == false then
                    sampSendChat("/r Переоделась в форму армейского. Причина: "..input)
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/rb "..myid)
                end
            end
        end
        if result3 then
            if button == 1 then
                if cfg.main.male == true then
                    sampSendChat("/r Переоделся в форму медика. Причина: "..input)
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/rb "..myid)
                end
                if cfg.main.male == false then
                    sampSendChat("/r Переоделась в форму медика. Причина: "..input)
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/rb "..myid)
                end
            end
        end
        if result4 then
            if button == 1 then
                if cfg.main.male == true then
                    sampSendChat("/r Переоделся в форму работника мэрии. Причина: "..input)
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/rb "..myid)
                end
                if cfg.main.male == false then
                    sampSendChat("/r Переоделась в форму работника мэрии. Причина: "..input)
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/rb "..myid)
                end
            end
        end
        if result5 then
            if button == 1 then
                if cfg.main.male == true then
                    sampSendChat("/r Переоделся в форму работника автошколы. Причина: "..input)
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/rb "..myid)
                end
                if cfg.main.male == false then
                    sampSendChat("/r Переоделась в форму работника автошколы. Причина: "..input)
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/rb "..myid)
                end
            end
        end
        if result6 then
            if button == 1 then
                if cfg.main.male == true then
                    sampSendChat("/r Переоделся в форму работника новостей. Причина: "..input)
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/rb "..myid)
                end
                if cfg.main.male == false then
                    sampSendChat("/r Переоделась в форму работника новостей. Причина: "..input)
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/rb "..myid)
                end
            end
        end
        if result7 then
            if button == 1 then
                if cfg.main.male == true then
                    sampSendChat("/r Переоделся в форму ЧОП LCN. Причина: "..input)
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/rb "..myid)
                end
                if cfg.main.male == false then
                    sampSendChat("/r Переоделась в форму ЧОП LCN. Причина: "..input)
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/rb "..myid)
                end
            end
        end
        if result8 then
            if button == 1 then
                if cfg.main.male == true then
                    sampSendChat("/r Переоделся в форму ЧОП Yakuza. Причина: "..input)
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/rb "..myid)
                end
                if cfg.main.male == false then
                    sampSendChat("/r Переоделась в форму ЧОП Yakuza. Причина: "..input)
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/rb "..myid)
                end
            end
        end
        if result9 then
            if button == 1 then
                if cfg.main.male == true then
                    sampSendChat("/r Переоделся в форму ЧОП РМ. Причина: "..input)
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/rb "..myid)
                end
                if cfg.main.male == false then
                    sampSendChat("/r Переоделась в форму ЧОП РМ. Причина: "..input)
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/rb "..myid)
                end
            end
        end
        if result10 then
            if button == 1 then
                if cfg.main.male == true then
                    sampSendChat("/r Переоделся в форму БК Rifa. Причина: "..input)
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/rb "..myid)
                end
                if cfg.main.male == false then
                    sampSendChat("/r Переоделась в форму БК Rifa. Причина: "..input)
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/rb "..myid)
                end
            end
        end
        if result11 then
            if button == 1 then
                if cfg.main.male == true then
                    sampSendChat("/r Переоделся в форму БК Grove. Причина: "..input)
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/rb "..myid)
                end
                if cfg.main.male == false then
                    sampSendChat("/r Переоделась в форму БК Grove. Причина: "..input)
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/rb "..myid)
                end
            end
        end
        if result12 then
            if button == 1 then
                if cfg.main.male == true then
                    sampSendChat("/r Переоделся в форму БК Ballas. Причина: "..input)
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/rb "..myid)
                end
                if cfg.main.male == false then
                    sampSendChat("/r Переоделась в форму БК Ballas. Причина: "..input)
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/rb "..myid)
                end
            end
        end
        if result13 then
            if button == 1 then
                if cfg.main.male == true then
                    sampSendChat("/r Переоделся в форму БК Vagos. Причина: "..input)
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/rb "..myid)
                end
                if cfg.main.male == false then
                    sampSendChat("/r Переоделась в форму БК Vagos. Причина: "..input)
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/rb "..myid)
                end
            end
        end
        if result14 then
            if button == 1 then
                if cfg.main.male == true then
                    sampSendChat("/r Переоделся в форму БК Aztec. Причина: "..input)
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/rb "..myid)
                end
                if cfg.main.male == false then
                    sampSendChat("/r Переоделся в форму БК Aztec. Причина: "..input)
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/rb "..myid)
                end
            end
        end
        if result15 then
            if button == 1 then
                if cfg.main.male == true then
                    sampSendChat("/r Переоделся в одежду байкеров. Причина: "..input)
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/rb "..myid)
                end
                if cfg.main.male == false then
                    sampSendChat("/r Переоделась в одежду байкеров. Причина: "..input)
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/rb "..myid)
                end
            end
        end
    end
end
function onHotKey(id, keys)
	local sKeys = tostring(table.concat(keys, " "))
	for k, v in pairs(tBindList) do
		if sKeys == tostring(table.concat(v.v, " ")) then
			if tostring(v.text):len() > 0 then
				local bIsEnter = string.match(v.text, "(.)%[enter%]$") ~= nil
				if bIsEnter then
					sampProcessChatInput(v.text:gsub("%[enter%]$", ""))
				else
					sampSetChatInputText(v.text)
					sampSetChatInputEnabled(true)
				end
			end
		end
	end
end

--COMMANDS--
function su(pam)
    pID = tonumber(pam)
    if pID ~= nil then
        if sampIsPlayerConnected(pID) then
            lua_thread.create(function()
                submenus_show(sumenu(pID), "{9966cc}FBI Tools {ffffff}| "..sampGetPlayerNickname(pID).."["..pID.."] ")
            end)
        else
            ftext("Игрок с ID: "..pID.." не подключен к серверу")
        end
    else
        ftext("Введите: /su [id]")
    end
end
function ssu(pam)
    local id, zv, orichina = pam:match('(%d+) (%d+) (.+)')
    if id and zv and orichina then
        sampSendChat(string.format('/su %s %s %s', id, zv, orichina))
    else
        ftext('Введите: /ssu [id] [кол-во звезд] [причина]')
    end
end
function tazer()
    if cfg.main.male == true then
        lua_thread.create(function()
            sampSendChat("/tazer")
            wait(cfg.commands.zaderjka)
            sampSendChat("/me сменил тип патронов")
        end)
    end
    if cfg.main.male == false then
        lua_thread.create(function()
            sampSendChat("/tazer")
            wait(cfg.commands.zaderjka)
            sampSendChat("/me сменила тип патронов")
        end)
    end
end
function keys()
    if cfg.main.male == true then
        lua_thread.create(function()
            sampSendChat("/me взял ключ")
            wait(cfg.commands.zaderjka)
            sampSendChat("/me сравнивает ключ с ключом от КПЗ")
            wait(cfg.commands.zaderjka)
            sampSendChat("/try обнаружил, что ключи идентичны")
            wait(cfg.commands.zaderjka)
        end)
    end
    if cfg.main.male == false then
        lua_thread.create(function()
            sampSendChat("/me взяла ключ")
            wait(cfg.commands.zaderjka)
            sampSendChat("/me сравнивает ключ с ключом от КПЗ")
            wait(cfg.commands.zaderjka)
            sampSendChat("/try обнаружила, что ключи идентичны")
        end)
    end
end
function oop(pam)
    pID = tonumber(pam)
    if frak == 'FBI' or frak == 'LSPD' or frak == 'SFPD' or frak == 'LVPD' then
        if rang == 'Кадет' or rang == 'Офицер' or rang == 'Мл.Сержант' or  rang == 'Сержант' or  rang == 'Прапорщик' then
            if pID == nil then
                ftext("Введите: /oop [id]")
            end
            if pID ~= nil and sampIsPlayerConnected(pID) then
                if not cfg.main.tarb then
                    sampSendChat("/r Дело на имя "..sampGetPlayerNickname(pID):gsub('_', ' ').." ("..pID..") рассмотрению не подлежит, ООП, объявите.")
                else
                    sampSendChat("/r ["..cfg.main.tar.."]: Дело на имя "..sampGetPlayerNickname(pID):gsub('_', ' ').." ("..pID..") рассмотрению не подлежит, ООП, объявите.")
                end
            end
            if pID ~= nil and not sampIsPlayerConnected(pID) then
                ftext("Игрок с ID: "..pID.." не подключен к серверу")
            end
        else
            if pID == nil then
                ftext("Введите: /oop [id]", -1)
            end
            if pID ~= nil and sampIsPlayerConnected(pID) then
                sampSendChat("/d Mayor, дело на имя "..sampGetPlayerNickname(pID):gsub('_', ' ').." рассмотрению не подлежит, ООП.")
            else
                ftext("Игрок с ID: "..pID.." не подключен к серверу")
            end
        end
    else
        ftext("Вы не сотрудник ПД/FBI")
    end
end
function cput(pam)
    local id, seat = string.match(pam, '(%d+)%s*(%d*)')
    if cfg.commands.cput == true then
        if cfg.main.male == true then
            if id == nil or seat == nil then
                ftext("Введите: /cput [id] [seat]")
            end
            if id ~= nil and sampIsPlayerConnected(id) then
                if seat == "" or seat < "1" or seat > "3" then
                    ftext("Введите: /cput [id] [seat]", -1)
                elseif seat == "1" then
                    if isCharOnAnyBike(playerPed) then
                        lua_thread.create(function()
                            sampSendChat("/me посадил "..sampGetPlayerNickname(id).." на сиденье мотоцикла")
                            wait(cfg.commands.zaderjka)
                            sampSendChat("/cput "..id.." 1", -1)
                        end)
                    else
                        lua_thread.create(function()
                            sampSendChat("/me открыл дверь автомобиля и затолкнул туда "..sampGetPlayerNickname(id))
                            wait(cfg.commands.zaderjka)
                            sampSendChat("/cput "..id.." 1", -1)
                        end)
                    end
                elseif seat =="2" then
                    if isCharOnAnyBike(playerPed) then
                        lua_thread.create(function()
                            sampSendChat("/me посадил "..sampGetPlayerNickname(id).." на сиденье мотоцикла")
                            wait(cfg.commands.zaderjka)
                            sampSendChat("/cput "..id.." 1", -1)
                        end)
                    else
                        lua_thread.create(function()
                            sampSendChat("/me открыл дверь автомобиля и затолкнул туда "..sampGetPlayerNickname(id))
                            wait(cfg.commands.zaderjka)
                            sampSendChat("/cput "..id.." 2", -1)
                        end)
                    end
                elseif seat == "3" then
                    if isCharOnAnyBike(playerPed) then
                        lua_thread.create(function()
                            sampSendChat("/me посадил "..sampGetPlayerNickname(id).." на сиденье мотоцикла")
                            wait(cfg.commands.zaderjka)
                            sampSendChat("/cput "..id.." 1", -1)
                        end)
                    else
                        lua_thread.create(function()
                            sampSendChat("/me открыл дверь автомобиля и затолкнул туда "..sampGetPlayerNickname(id))
                            wait(cfg.commands.zaderjka)
                            sampSendChat("/cput "..id.." 3", -1)
                        end)
                    end
                end
            end
        end
        if cfg.main.male == false then
            if id == nil or seat == nil then
                ftext("Введите: /cput [id] [seat]")
            end
            if id ~= nil and sampIsPlayerConnected(id) then
                if seat == "" or seat < "1" or seat > "3" then
                    ftext("Введите: /cput [id] [seat]")
                elseif seat == "1" then
                    if isCharOnAnyBike(playerPed) then
                        lua_thread.create(function()
                            sampSendChat("/me посадила "..sampGetPlayerNickname(id).." на сиденье мотоцикла")
                            wait(cfg.commands.zaderjka)
                            sampSendChat("/cput "..id.." 1", -1)
                        end)
                    else
                        lua_thread.create(function()
                            sampSendChat("/me открыла дверь автомобиля и затолкнула туда "..sampGetPlayerNickname(id))
                            wait(cfg.commands.zaderjka)
                            sampSendChat("/cput "..id.." 1", -1)
                        end)
                    end
                elseif seat =="2" then
                    if isCharOnAnyBike(playerPed) then
                        lua_thread.create(function()
                            sampSendChat("/me посадила "..sampGetPlayerNickname(id).." на сиденье мотоцикла")
                            wait(cfg.commands.zaderjka)
                            sampSendChat("/cput "..id.." 1", -1)
                        end)
                    else
                        lua_thread.create(function()
                            sampSendChat("/me открыла дверь автомобиля и затолкнула туда "..sampGetPlayerNickname(id))
                            wait(cfg.commands.zaderjka)
                            sampSendChat("/cput "..id.." 2", -1)
                        end)
                    end
                elseif seat == "3" then
                    if isCharOnAnyBike(playerPed) then
                        lua_thread.create(function()
                            sampSendChat("/me посадила "..sampGetPlayerNickname(id).." на сиденье мотоцикла")
                            wait(cfg.commands.zaderjka)
                            sampSendChat("/cput "..id.." 1", -1)
                        end)
                    else
                        lua_thread.create(function()
                            sampSendChat("/me открыла дверь автомобиля и затолкнула туда "..sampGetPlayerNickname(id))
                            wait(cfg.commands.zaderjka)
                            sampSendChat("/cput "..id.." 3", -1)
                        end)
                    end
                end
            end
        end
    else
        if pam ~= nil then
            sampSendChat('/cput '..pam)
        else
            ftext("Введите: /cput [id] [seat]")
        end
    end
end
function ceject(pam)
    local id = tonumber(pam)
    if cfg.commands.ceject == true then
        if cfg.main.male == true then
            if id == nil then
                ftext("Введите: /ceject [id]")
            end
            if id ~= nil and sampIsPlayerConnected(id) then
                if isCharOnAnyBike(playerPed) then
                    lua_thread.create(function()
                        sampSendChat("/me высадил "..sampGetPlayerNickname(id).." из мотоцикла")
                        wait(cfg.commands.zaderjka)
                        sampSendChat("/ceject "..id, -1)
                    end)
                else
                    lua_thread.create(function()
                        sampSendChat("/me открыл дверь автомобиля и высадил "..sampGetPlayerNickname(id))
                        wait(cfg.commands.zaderjka)
                        sampSendChat("/ceject "..id)
                    end)
                end
            end
        end
        if cfg.main.male == false then
            if id == nil then
                ftext("Введите: /ceject [id]")
            end
            if id ~= nil and sampIsPlayerConnected(id) then
                if isCharOnAnyBike(playerPed) then
                    lua_thread.create(function()
                        sampSendChat("/me высадила "..sampGetPlayerNickname(id).." из мотоцикла")
                        wait(cfg.commands.zaderjka)
                        sampSendChat("/ceject "..id, -1)
                    end)
                else
                    lua_thread.create(function()
                        sampSendChat("/me открыла дверь автомобиля и высадила "..sampGetPlayerNickname(id))
                        wait(cfg.commands.zaderjka)
                        sampSendChat("/ceject "..id)
                    end)
                end
            end
        end
    else
        if pam ~= nil then
            sampSendChat('/ceject '..pam)
        else
            ftext("Введите: /ceject [id]")
        end
    end
end
function st(pam)
    local id = tonumber(pam)
    local result, ped = sampGetCharHandleBySampPlayerId(id)
    if id == nil then
        sampSendChat('/m ['..frak..'] Водитель, снизьте скорость и прижмитесь к обочине или мы откроем огонь!')
    end
    if id ~= nil and not sampIsPlayerConnected(id) then
        ftext(string.format('Игрок с ID: %s не подключен к серверу', id), -1)
    end
    if result and not doesCharExist(ped) then
        local stname = sampGetPlayerNickname(id)
        ftext(string.format('Игрок %s[%s] не доступен', stname, id), -1)
    end
    if result and doesCharExist(ped) and not isCharInAnyCar(ped) then
        local stnaame = sampGetPlayerNickname(id)
        ftext(string.format('Игрок %s[%s] не в транспорте', stnaame, id), -1)
    end
    if result and doesCharExist(ped) and isCharInAnyCar(ped) then
        local vehName = getCarNamebyModel(getCarModel(storeCarCharIsInNoSave(ped)))
        sampSendChat("/m Водитель Т/C "..vehName.." с гос.номером [EVL"..id.."X], прижмитесь к обочине и остановите своё Т/С")
    end
end
function deject(pam)
    local id = tonumber(pam)
    if cfg.commands.deject == true then
        if cfg.main.male == true then
            if id == nil then
                ftext("Введите: /deject [id]")
            end
            if id ~= nil and sampIsPlayerConnected(id) then
                local result, ped = sampGetCharHandleBySampPlayerId(id)
                if result then
                    if isCharInFlyingVehicle(ped) then
                        lua_thread.create(function()
                            sampSendChat("/me открыл дверь вертолёта и вытащил "..sampGetPlayerNickname(id))
                            wait(cfg.commands.zaderjka)
                            sampSendChat("/deject "..id)
                        end)
                    elseif isCharInModel(ped, 481) or isCharInModel(ped, 510) then
                        lua_thread.create(function()
                            sampSendChat("/me скинул "..sampGetPlayerNickname(id).." с велосипеда")
                            wait(cfg.commands.zaderjka)
                            sampSendChat("/deject "..id)
                        end)
                    elseif isCharInModel(ped, 462) then
                        lua_thread.create(function()
                            sampSendChat("/me скинул "..sampGetPlayerNickname(id).." со скутера")
                            wait(cfg.commands.zaderjka)
                            sampSendChat("/deject "..id)
                        end)
                    elseif isCharOnAnyBike(ped) then
                        lua_thread.create(function()
                            sampSendChat("/me скинул "..sampGetPlayerNickname(id).." с мотоцикла")
                            wait(cfg.commands.zaderjka)
                            sampSendChat("/deject "..id)
                        end)
                    elseif isCharInAnyCar(ped) then
                        lua_thread.create(function()
                            sampSendChat("/me разбил окно и вытолкнул "..sampGetPlayerNickname(id).." из машины")
                            wait(cfg.commands.zaderjka)
                            sampSendChat("/deject "..id)
                        end)
                    end
                end
            end
        end
        if cfg.main.male == false then
            if id == nil then
                ftext("Введите: /deject [id]")
            end
            if id ~= nil and sampIsPlayerConnected(id) then
                local result, ped = sampGetCharHandleBySampPlayerId(id)
                if result then
                    if isCharInFlyingVehicle(ped) then
                        lua_thread.create(function()
                            sampSendChat("/me открыла дверь вертолёта и вытащила "..sampGetPlayerNickname(id))
                            wait(cfg.commands.zaderjka)
                            sampSendChat("/deject "..id)
                        end)
                    elseif isCharInModel(ped, 481) or isCharInModel(ped, 510) then
                        lua_thread.create(function()
                            sampSendChat("/me скинула "..sampGetPlayerNickname(id).." с велосипеда")
                            wait(cfg.commands.zaderjka)
                            sampSendChat("/deject "..id)
                        end)
                    elseif isCharInModel(ped, 462) then
                        lua_thread.create(function()
                            sampSendChat("/me скинула "..sampGetPlayerNickname(id).." со скутера")
                            wait(cfg.commands.zaderjka)
                            sampSendChat("/deject "..id)
                        end)
                    elseif isCharOnAnyBike(ped) then
                        lua_thread.create(function()
                            sampSendChat("/me скинула "..sampGetPlayerNickname(id).." с мотоцикла")
                            wait(cfg.commands.zaderjka)
                            sampSendChat("/deject "..id)
                        end)
                    elseif isCharInAnyCar(ped) then
                        lua_thread.create(function()
                            sampSendChat("/me разбила окно и вытолкнула "..sampGetPlayerNickname(id).." из машины")
                            wait(cfg.commands.zaderjka)
                            sampSendChat("/deject "..id)
                        end)
                    end
                end
            end
        end
    else
        if pam ~= nil then
            sampSendChat('/deject '..pam)
        else
            ftext("Введите: /deject [id]")
        end
    end
end
function rh(id)
    local _, myid = sampGetPlayerIdByCharHandle(PLAYER_PED)
    if id == "" or id < "1" or id > "3" or id == nil then
        ftext("Введите: /rh Департамент", -1)
        ftext("1 - LSPD | 2 - SFPD | 3 - LVPD", -1)
    elseif id == "1" then
        sampSendChat("/d LSPD, запрашиваю патрульный экипаж в "..kvadrat()..", как приняли? Ответ на пдж."..myid)
    elseif id == "2" then
        sampSendChat("/d SFPD, запрашиваю патрульный экипаж в "..kvadrat()..", как приняли? Ответ на пдж."..myid)
    elseif id == "3" then
        sampSendChat("/d LVPD, запрашиваю патрульный экипаж в "..kvadrat()..", как приняли? Ответ на пдж."..myid)
    end
end
function gr(pam)
    local dep, reason = pam:match('(%d+)%s+(.+)')
    if dep == nil or reason == nil then
        ftext("Введите: /gr [1-3] [Причина]")
        ftext("1 - LSPD | 2 - SFPD | 3 - LVPD")
    end
    if dep ~= nil then
        if dep == "" or dep < "1" or dep > "3" then
            ftext("{9966CC}FBI Tools {FFFFFF}| Введите: /gr [1-3] [Причина]")
            ftext("{9966CC}FBI Tools {FFFFFF}| 1 - LSPD | 2 - SFPD | 3 - LVPD")
        elseif dep == "1" then
            sampSendChat("/d LSPD, пересекаю вашу юрисдикцию, "..reason)
        elseif dep == "2" then
            sampSendChat("/d SFPD, пересекаю вашу юрисдикцию, "..reason)
        elseif dep == "3" then
            sampSendChat("/d LVPD, пересекаю вашу юрисдикцию, "..reason)
        end
    end
end
function warn(pam)
    local id = tonumber(pam)
    if frak == 'FBI' then
        if id == nil then
            ftext('Введите /warn ID')
        end
        if id ~= nil and sampIsPlayerConnected(id) then
            lua_thread.create(function()
                warnst = true
                sampSendChat('/mdc '..id)
                wait(cfg.commands.zaderjka)
                if wfrac == 'LSPD' or wfrac == 'SFPD' or wfrac == 'LVPD' then
                    sampSendChat(string.format('/d %s, %s получает предупреждение за неправильную подачу в розыск.', wfrac, sampGetPlayerNickname(id):gsub('_', ' ')))
                else
                    ftext('Человек не является сотрудником PD')
                end
                wfrac = nil
                warnst = false
            end)
        end
    else
        ftext("Вы не сотрудник ФБР")
    end
end
function ms(pam)
    local _, myid = sampGetPlayerIdByCharHandle(PLAYER_PED)
    if frak == 'FBI' then
        if cfg.main.male == true then
            if pam == "" or pam < "0" or pam > "3" or pam == nil then
                ftext("Введите: /ms [Тип]", -1)
                ftext("0 - Снять маскировку | 1 - Офис | 2 - Багажник | 3 - Сумка", -1)
            elseif pam == "1" then
                lua_thread.create(function()
                    sampSendChat("/me снял с себя костюм агента и повесил на вешалку")
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/me открыл ящик, после чего достал комплект маскировки")
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/me надел на себя маскировку и закрыл ящик")
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/do Агент в маскировке.")
                    wait(100)
                    submenus_show(osnova, "{9966cc}FBI Tools {ffffff}| Mask")
                end)
            elseif pam == "2" then
                lua_thread.create(function()
                    sampSendChat("/me открыл багажник автомобиля")
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/me снял с себя костюм агента и убрал в багажник")
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/me достал из багажника комплект маскировки и надел на себя")
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/me закрыл багажник")
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/do Агент в маскировке.")
                    wait(100)
                    submenus_show(osnova, "{9966cc}FBI Tools {ffffff}| Mask")
                end)
            elseif pam == "3" then
                lua_thread.create(function()
                    sampSendChat("/do на плече агента висит сумка")
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/me открыв сумку, снял костюм агента и убрал туда")
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/me достал из сумки комплект маскировки и надел на себя")
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/me закрыл сумку")
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/do Агент в маскировке.")
                    wait(100)
                    submenus_show(osnova, "{9966cc}FBI Tools {ffffff}| Mask")
                end)
            elseif pam == "0" then
                lua_thread.create(function()
                    sampSendChat("/me снял с себя маскировку")
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/me надел на себя костюм агента")
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/r Переоделся в костюм агента")
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/rb "..myid)
                end)
            end
        end
        if cfg.main.male == false then
            if pam == "" or pam < "0" or pam > "3" or pam == nil then
                ftext("Введите: /ms Тип", -1)
                ftext("0 - Снять маскировку | 1 - Офис | 2 - Багажник | 3 - Сумка", -1)
            elseif pam == "1" then
                lua_thread.create(function()
                    sampSendChat("/me сняла с себя костюм агента и повесила на вешалку")
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/me открыла ящик, после чего достала комплект маскировки")
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/me надела на себя маскировку и закрыла ящик")
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/do Агент в маскировке.")
                    wait(100)
                    submenus_show(osnova, "{9966cc}FBI Tools {ffffff}| Mask")
                end)
            elseif pam == "2" then
                lua_thread.create(function()
                    sampSendChat("/me открыла багажник автомобиля")
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/me сняла с себя костюм агента и убрала в багажник")
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/me достала из багажника комплект маскировки и надела на себя")
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/me закрыла багажник")
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/do Агент в маскировке.")
                    wait(100)
                    submenus_show(osnova, "{9966cc}FBI Tools {ffffff}| Mask")
                end)
            elseif pam == "3" then
                lua_thread.create(function()
                    sampSendChat("/do на плече агента висит сумка")
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/me открыв сумку, сняла костюм агента и убрала туда")
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/me достала из сумки комплект маскировки и надела на себя")
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/me закрыла сумку")
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/do Агент в маскировке.")
                    wait(100)
                    submenus_show(osnova, "{9966cc}FBI Tools {ffffff}| Mask")
                end)
            elseif pam == "0" then
                lua_thread.create(function()
                    sampSendChat("/me сняла с себя маскировку")
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/me надела на себя костюм агента")
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/r Переоделась в костюм агента")
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/rb "..myid)
                end)
            end
        end
    else
        ftext('Вы не сотрудник FBI')
    end
end

function ar(id)
    if id == "" or id < "1" or id > "2" or id == nil then
        ftext("Введите: /ar [1-2]", -1)
        ftext("1 - LVa | 2 - SFa", -1)
    elseif id == "1" then
        sampSendChat("/d LVa, разрешите въезд на вашу территорию, поимка преступника.")
    elseif id == "2" then
        sampSendChat("/d SFa, разрешите въезд на вашу территорию, поимка преступника.")
    end
end

function r(pam)
    if #pam ~= 0 then
        if cfg.main.tarb then
            sampSendChat(string.format('/r [%s]: %s', cfg.main.tar, pam))
        else
            sampSendChat(string.format('/r %s', pam))
        end
    else
        ftext('Введите /r [текст]')
    end
end
function f(pam)
    if #pam ~= 0 then
        if cfg.main.tarb then
            sampSendChat(string.format('/f [%s]: %s', cfg.main.tar, pam))
        else
            sampSendChat(string.format('/f %s', pam))
        end
    else
        ftext('Введите /f [текст]')
    end
end
function fthelp()
    lua_thread.create(function()
        submenus_show(fthelpsub, '{9966cc}FBI Tools {ffffff}| Help')
    end)
end
function fst(param)
    local hour = tonumber(param)
    if hour ~= nil and hour >= 0 and hour <= 23 then
        time = hour
        patch_samp_time_set(true)
        if time then
            setTimeOfDay(time, 0)
            ftext('Время изменено на: {9966cc}'..time, -1)
        end
    else
        ftext('Значение времени должно быть в диапазоне от 0 до 23.', -1)
        patch_samp_time_set(false)
        time = nil
    end
end

function fsw(param)
    local weather = tonumber(param)
    if weather ~= nil and weather >= 0 and weather <= 45 then
        forceWeatherNow(weather)
        ftext('Погода изменена на: {9966cc}'..weather, -1)
    else
        ftext('Значение погоды должно быть в диапазоне от 0 до 45.', -1)
    end
end

function patch_samp_time_set(enable)
    if enable and default == nil then
        default = readMemory(sampGetBase() + 0x9C0A0, 4, true)
        writeMemory(sampGetBase() + 0x9C0A0, 4, 0x000008C2, true)
    elseif enable == false and default ~= nil then
        writeMemory(sampGetBase() + 0x9C0A0, 4, default, true)
        default = nil
    end
end
------------
function fshp(pam)
    if #pam ~= 0 then
        local f = io.open('moonloader\\fbitools\\shp.txt')
        for line in f:lines() do
            if string.find(line, pam) or string.rlower(line):find(pam) or string.rupper(line):find(pam) then
                sampAddChatMessage(' '..line, -1)
            end
        end
        f:close()
    else
        ftext('Введите /fshp [текст]')
    end
end
function fyk(pam)
    if #pam ~= 0 then
        local f = io.open('moonloader\\fbitools\\yk.txt')
        for line in f:lines() do
            if string.find(line, pam) or string.rlower(line):find(pam) or string.rupper(line):find(pam) then
                sampAddChatMessage(' '..line, -1)
            end
        end
        f:close()
    else
        ftext('Введите /fyk [текст]')
    end
end

function ffp(pam)
    if #pam ~= 0 then
        local f = io.open('moonloader\\fbitools\\fp.txt')
        for line in f:lines() do
            if string.find(line, pam) or string.rlower(line):find(pam) or string.rupper(line):find(pam) then
                sampAddChatMessage(' '..line, -1)
            end
        end
        f:close()
    else
        ftext('Введите /ffp [текст]')
    end
end

function fak(pam)
    if #pam ~= 0 then
        local f = io.open('moonloader\\fbitools\\ak.txt')
        for line in f:lines() do
            if string.find(line, pam) or string.rlower(line):find(pam) or string.rupper(line):find(pam) then
                sampAddChatMessage(' '..line, -1)
            end
        end
        f:close()
    else
        ftext('Введите /fak [текст]')
    end
end
players1 = {'{ffffff}Ник\t{ffffff}Ранг'}
players2 = {'{ffffff}Ник\t{ffffff}Ранг\t{ffffff}Статус'}
function dmb()
	lua_thread.create(function()
		status = true
		sampSendChat('/members')
		while not gotovo do wait(0) end
		if gosmb then
			sampShowDialog(716, "{ffffff}В сети: "..gcount.." | {ae433d}Организация", table.concat(players2, "\n"), "x", _, 5) -- Показываем информацию.
		elseif krimemb then
			sampShowDialog(716, "{ffffff}В сети: "..gcount.." | {ae433d}Организация", table.concat(players1, "\n"), "x", _, 5) -- Показываем информацию.
		end
		gosmb = false
		krimemb = false
		gotovo = false
		status = false
		players2 = {'{ffffff}Ник\t{ffffff}Ранг\t{ffffff}Статус'}
		players1 = {'{ffffff}Ник\t{ffffff}Ранг'}
		gcount = nil
	end)
end
function megaf()
    lua_thread.create(function()
        if isCharInAnyCar(playerPed) then
            local peds = getAllChars()
            local _, myvodil = sampGetPlayerIdByCharHandle(getDriverOfCar(storeCarCharIsInNoSave(playerPed)))
            if #peds ~= 0 then
                for _, hm in pairs(peds) do
                    local _ , megafid = sampGetPlayerIdByCharHandle(hm)
                    local _ , m = sampGetPlayerIdByCharHandle(PLAYER_PED)
                    if megafid ~= -1 and megafid ~= m and doesCharExist(hm) and sampIsPlayerConnected(megafid) then
                        local x, y, z = getCharCoordinates(hm)
                        local mx, my, mz = getCharCoordinates(PLAYER_PED)
                        local dist = getDistanceBetweenCoords3d(mx, my, mz, x, y, z)
                        local hskin = getCharModel(hm)
                        if dist <= 65 then
                            if isCharInAnyCar(hm) then
                                if getFraktionBySkin(megafid) ~= 'FBI' and getFraktionBySkin(megafid) ~= 'Полиция' then
                                    if storeCarCharIsInNoSave(hm) ~= storeCarCharIsInNoSave(playerPed) then
                                        local _, myvodil = sampGetPlayerIdByCharHandle(getDriverOfCar(storeCarCharIsInNoSave(hm)))
                                        if megafid == myvodil then
                                            local carh = storeCarCharIsInNoSave(hm)
                                            local nameofcar = getNameOfVehicleModel(getCarModel(carh))
                                            local _ , idofplayercar = sampGetPlayerIdByCharHandle(hm)
                                            sampSendChat(string.format("/m Водитель а/м %s с гос. номером [EVL%sX] прижмитесь к обочине", getCarNamebyModel(getCarModel(carh)), megafid), -1)
                                            wait(1200)
                                            sampSendChat('/m В противном случае нам придется открыть по вам огонь! ', -1)
											wait(300)
                                            sampAddChatMessage(' {ffffff}~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~', 0x9966cc)
											sampAddChatMessage('', 0x9966cc)
											sampAddChatMessage(' {ffffff}Ник: {9966cc}'..sampGetPlayerNickname(megafid)..'['..megafid..']', 0x9966cc)
											sampAddChatMessage(' {ffffff}Уровень: {9966cc}'..sampGetPlayerScore(megafid), 0x9966cc)
											sampAddChatMessage(' {ffffff}Фракция: {9966cc}'..getFraktionBySkin(megafid), 0x9966cc)
											sampAddChatMessage('', 0x9966cc)
                                            sampAddChatMessage(' {ffffff}~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~', 0x9966cc)
                                            gmegafid = megafid
                                            gmegaflvl = sampGetPlayerScore(megafid)
                                            gmegaffrak = getFraktionBySkin(megafid)
                                            break
                                        end
                                    end
                                end
                            end
                        end
                    end
                end
            else
                ftext("Не найден ни один игрок в зоне прорисовки для объявления в мегафон.")
                ftext("Для объявления в мегафон о нарушении вам необходимо быть не более 50 метров от нарушителя.")
            end
        else
            ftext("Вам необходимо сидеть в транспорте правоохранительных органов.")
        end
    end)
end
function dkld()
    local tn = {}
    if isCharInAnyCar(PLAYER_PED) then
        if post ~= 7 and post ~= 12 and post ~= 13 and post ~= 14 and post ~= 18 and post ~= 21 and post ~= 22 and post ~= 23 and post ~= 24 and post ~= 25 and post ~= 26 and post ~= 27 and post ~= 28 and post ~= 29 and post ~= 30 and post ~= 31 then
            for patrulid = 0, sampGetMaxPlayerId(true) do
                local result, ped = sampGetCharHandleBySampPlayerId(patrulid)
                if result then
                    local myPosX, myPosY, myPosZ = getCharCoordinates(PLAYER_PED)
                    local posX, posY, posZ = getCharCoordinates(ped)
                    local distance = getDistanceBetweenCoords3d(myPosX, myPosY, myPosZ, posX, posY, posZ)
                    if distance <= 5.0 then
                        local nskin = getCharModel(ped)
                        if getFraktionBySkin(patrulid) == 'FBI' or getFraktionBySkin(patrulid) == 'Полиция' then
                            local doknick, dockfam = sampGetPlayerNickname(patrulid):match('(.+)_(.+)')
                            if doknick and dockfam then
                                table.insert(tn, string.format('%s.%s', doknick:sub(1,1), dockfam))
                            end
                        end
                    end
                end
            end
            if frak == 'LSPD' then
                if not cfg.main.tarb  then
                    if #tn == 0 then
                    sampSendChat('/r Патруль г. Лос-Сантос. Напарников нет.')
                    elseif #tn == 1 then
                    sampSendChat('/r Патруль г. Лос-Сантос. Напарник: '..table.concat(tn, ", ")..'.')
                    elseif #tn > 1 then
                    sampSendChat('/r Патруль г. Лос-Сантос. Напарники: '..table.concat(tn, ", ")..'.')
                    end
                else
                    if #tn == 0 then
                    sampSendChat('/r ['..cfg.main.tar..']: Патруль г. Лос-Сантос. Напарников нет.')
                    elseif #tn == 1 then
                    sampSendChat('/r ['..cfg.main.tar..']: Патруль г. Лос-Сантос. Напарник: '..table.concat(tn, ", ")..'.')
                    elseif #tn > 1 then
                    sampSendChat('/r ['..cfg.main.tar..']: Патруль г. Лос-Сантос. Напарники: '..table.concat(tn, ", ")..'.')
                    end
                end
            elseif frak == 'SFPD' then
                if not cfg.main.tarb then
                    if #tn == 0 then
                        sampSendChat('/r Патруль г. Сан-Фиерро. Напарников нет.')
                    elseif #tn == 1 then
                        sampSendChat('/r Патруль г. Сан-Фиерро. Напарник: '..table.concat(tn, ", ")..'.')
                    elseif #tn > 1 then
                        sampSendChat('/r Патруль г. Сан-Фиерро. Напарники: '..table.concat(tn, ", ")..'.')
                    end
                else
                    if #tn == 0 then
                        sampSendChat('/r ['..cfg.main.tar..']: Патруль г. Сан-Фиерро. Напарников нет.')
                    elseif #tn == 1 then
                        sampSendChat('/r ['..cfg.main.tar..']: Патруль г. Сан-Фиерро. Напарник: '..table.concat(tn, ", ")..'.')
                    elseif #tn > 1 then
                        sampSendChat('/r ['..cfg.main.tar..']: Патруль г. Сан-Фиерро. Напарники: '..table.concat(tn, ", ")..'.')
                    end
                end
            elseif frak == 'LVPD' then
                if not cfg.main.tarb then
                    if #tn == 0 then
                        sampSendChat('/r Патруль г. Лас-Вентурас. Напарников нет.')
                    elseif #tn == 1 then
                        sampSendChat('/r Патруль г. Лас-Вентурас. Напарник: '..table.concat(tn, ", ")..'.')
                    elseif #tn > 1 then
                        sampSendChat('/r Патруль г. Лас-Вентурас. Напарники: '..table.concat(tn, ", ")..'.')
                    end
                else
                    if #tn == 0 then
                        sampSendChat('/r ['..cfg.main.tar..']: Патруль г. Лас-Вентурас. Напарников нет.')
                    elseif #tn == 1 then
                        sampSendChat('/r ['..cfg.main.tar..']: Патруль г. Лас-Вентурас. Напарник: '..table.concat(tn, ", ")..'.')
                    elseif #tn > 1 then
                        sampSendChat('/r ['..cfg.main.tar..']: Патруль г. Лас-Вентурас. Напарники: '..table.concat(tn, ", ")..'.')
                    end
                end
            end
        end
        if post == 7 or post == 12 or post == 13 or post == 14 or post == 18 then
            local tn = {}
            for patrulid = 0, sampGetMaxPlayerId(true) do
                local result, ped = sampGetCharHandleBySampPlayerId(patrulid)
                if result then
                    local myPosX, myPosY, myPosZ = getCharCoordinates(PLAYER_PED)
                    local posX, posY, posZ = getCharCoordinates(ped)
                    local distance = getDistanceBetweenCoords3d(myPosX, myPosY, myPosZ, posX, posY, posZ)
                    if distance <= 5.0 then
                        local nskin = getCharModel(ped)
                        if getFraktionBySkin(patrulid) == 'FBI' or getFraktionBySkin(patrulid) == 'Полиция' then
                            local doknick, dockfam = sampGetPlayerNickname(patrulid):match('(.+)_(.+)')
                            if doknick and dockfam then
                                table.insert(tn, string.format('%s.%s', doknick:sub(1,1), dockfam))
                            end
                        end
                    end
                end
            end
            if not cfg.main.tarb then
                if #tn == 0 then
                    sampSendChat('/r Пост: '..getNameSphere(post)..'. Напарников нет.')
                elseif #tn == 1 then
                    sampSendChat('/r Пост: '..getNameSphere(post)..'. Напарник: '..table.concat(tn, ", ")..'.')
                elseif #tn > 1 then
                    sampSendChat('/r Пост: '..getNameSphere(post)..'. Напарники: '..table.concat(tn, ", ")..'.')
                end
            else
                if #tn == 0 then
                    sampSendChat('/r ['..cfg.main.tar..']: Пост: '..getNameSphere(post)..'. Напарников нет.')
                elseif #tn == 1 then
                    sampSendChat('/r ['..cfg.main.tar..']: Пост: '..getNameSphere(post)..'. Напарник: '..table.concat(tn, ", ")..'.')
                elseif #tn > 1 then
                    sampSendChat('/r ['..cfg.main.tar..']: Пост: '..getNameSphere(post)..'. Напарники: '..table.concat(tn, ", ")..'.')
                end
            end
        end
        if post == 21 then
            local tn = {}
            for patrulid = 0, sampGetMaxPlayerId(true) do
                local result, ped = sampGetCharHandleBySampPlayerId(patrulid)
                if result then
                    local myPosX, myPosY, myPosZ = getCharCoordinates(PLAYER_PED)
                    local posX, posY, posZ = getCharCoordinates(ped)
                    local distance = getDistanceBetweenCoords3d(myPosX, myPosY, myPosZ, posX, posY, posZ)
                    if distance <= 5.0 then
                        local nskin = getCharModel(ped)
                        if getFraktionBySkin(patrulid) == 'FBI' or getFraktionBySkin(patrulid) == 'Полиция' then
                            local doknick, dockfam = sampGetPlayerNickname(patrulid):match('(.+)_(.+)')
                            if doknick and dockfam then
                                table.insert(tn, string.format('%s.%s', doknick:sub(1,1), dockfam))
                            end
                        end
                    end
                end
            end
            if not cfg.main.tarb then
                if #tn == 0 then
                    sampSendChat('/r Патруль опасного района. Напарников нет.')
                elseif #tn == 1 then
                    sampSendChat('/r Патруль опасного района. Напарник:'..table.concat(tn, ", ")..'.')
                elseif #tn > 1 then
                    sampSendChat('/r Патруль опасного района. Напарники:'..table.concat(tn, ", ")..'.')
                end
            else
                if #tn == 0 then
                    sampSendChat('/r ['..cfg.main.tar..']: Патруль опасного района. Напарников нет.')
                elseif #tn == 1 then
                    sampSendChat('/r ['..cfg.main.tar..']: Патруль опасного района. Напарник:'..table.concat(tn, ", ")..'.')
                elseif #tn > 1 then
                    sampSendChat('/r ['..cfg.main.tar..']: Патруль опасного района. Напарники:'..table.concat(tn, ", ")..'.')
                end
            end
        end
        if post == 22 then
            local tn = {}
            for patrulid = 0, sampGetMaxPlayerId(true) do
                local result, ped = sampGetCharHandleBySampPlayerId(patrulid)
                if result then
                    local myPosX, myPosY, myPosZ = getCharCoordinates(PLAYER_PED)
                    local posX, posY, posZ = getCharCoordinates(ped)
                    local distance = getDistanceBetweenCoords3d(myPosX, myPosY, myPosZ, posX, posY, posZ)
                    if distance <= 5.0 then
                        local nskin = getCharModel(ped)
                        if getFraktionBySkin(patrulid) == 'FBI' or getFraktionBySkin(patrulid) == 'Полиция' then
                            local doknick, dockfam = sampGetPlayerNickname(patrulid):match('(.+)_(.+)')
                            if doknick and dockfam then
                                table.insert(tn, string.format('%s.%s', doknick:sub(1,1), dockfam))
                            end
                        end
                    end
                end
            end
            if cfg.main.tar == nil then
                if #tn == 0 then
                    sampSendChat('/r Патруль ЛВа. Напарников нет.')
                elseif #tn == 1 then
                    sampSendChat('/r Патруль ЛВа. Напарник: '..table.concat(tn, ", ")..'.')
                elseif #tn > 1 then
                    sampSendChat('/r Патруль ЛВа. Напарники: '..table.concat(tn, ", ")..'.')
                end
            else
                if #tn == 0 then
                    sampSendChat('/r ['..cfg.main.tar..']: Патруль ЛВа. Напарников нет.')
                elseif #tn == 1 then
                    sampSendChat('/r ['..cfg.main.tar..']: Патруль ЛВа. Напарник: '..table.concat(tn, ", ")..'.')
                elseif #tn > 1 then
                    sampSendChat('/r ['..cfg.main.tar..']: Патруль ЛВа. Напарники: '..table.concat(tn, ", ")..'.')
                end
            end
        end
        lua_thread.create(function()
            if post == 23 then
                if frak == 'LSPD' then
                    sampSendChat('/d SFPD, пересекаю вашу юрисдикцию, погоня.')
                elseif frak == 'SFPD' then
                    sampSendChat('/d LSPD, пересекаю вашу юрисдикцию, погоня.')
                elseif frak == 'LVPD' then
                    submenus_show(yrisdkld1404, '{9966CC}FBI Tools{ffffff} | Пересечение юрисдикции')
                end
            end
            if post == 24 then
                if frak == 'LSPD' then
                    sampSendChat('/d LVPD, пересекаю вашу юрисдикцию, погоня.')
                elseif frak == 'LVPD' then
                    sampSendChat('/d LSPD, пересекаю вашу юрисдикцию, погоня.')
                elseif frak == 'SFPD' then
                    submenus_show(yrisdkld1405, '{9966CC}FBI Tools{ffffff} | Пересечение юрисдикции')
                end
            end
            if post == 25 then
                if frak == 'LSPD' then
                    sampSendChat('/d LVPD, пересекаю вашу юрисдикцию, погоня.')
                elseif frak == 'LVPD' then
                    sampSendChat('/d LSPD, пересекаю вашу юрисдикцию, погоня.')
                elseif frak == 'SFPD' then
                    submenus_show(yrisdkld1405, '{9966CC}FBI Tools{ffffff} | Пересечение юрисдикции')
                end
            end
            if post == 26 then
                if frak == 'LSPD' then
                    sampSendChat('/d LVPD, пересекаю вашу юрисдикцию, погоня.')
                elseif frak == 'LVPD' then
                    sampSendChat('/d LSPD, пересекаю вашу юрисдикцию, погоня.')
                elseif frak == 'SFPD' then
                    submenus_show(yrisdkld1405, '{9966CC}FBI Tools{ffffff} | Пересечение юрисдикции')
                end
            end
            if post == 27 then
                if frak == 'LVPD' then
                    sampSendChat('/d SFPD, пересекаю вашу юрисдикцию, погоня.')
                elseif frak == 'SFPD' then
                    sampSendChat('/d LVPD, пересекаю вашу юрисдикцию, погоня.')
                elseif frak == 'LSPD' then
                    submenus_show(yrisdkld1406, '{9966CC}FBI Tools{ffffff} | Пересечение юрисдикции')
                end
            end
            if post == 28 then
                if frak == 'LVPD' then
                    sampSendChat('/d SFPD, пересекаю вашу юрисдикцию, погоня.')
                elseif frak == 'SFPD' then
                    sampSendChat('/d LVPD, пересекаю вашу юрисдикцию, погоня.')
                elseif frak == 'LSPD' then
                    submenus_show(yrisdkld1406, '{9966CC}FBI Tools{ffffff} | Пересечение юрисдикции')
                end
            end
            if post == 29 then
                if frak == 'LSPD' then
                    sampSendChat('/d SFPD, пересекаю вашу юрисдикцию, погоня.')
                elseif frak == 'SFPD' then
                    sampSendChat('/d LSPD, пересекаю вашу юрисдикцию, погоня.')
                elseif frak == 'LVPD' then
                    submenus_show(yrisdkld1404, '{9966CC}FBI Tools{ffffff} | Пересечение юрисдикции')
                end
            end
            if post == 30 then
                if frak == 'LSPD' then
                    sampSendChat('/d SFPD, пересекаю вашу юрисдикцию, погоня.')
                elseif frak == 'SFPD' then
                    sampSendChat('/d LSPD, пересекаю вашу юрисдикцию, погоня.')
                elseif frak == 'LVPD' then
                    submenus_show(yrisdkld1404, '{9966CC}FBI Tools{ffffff} | Пересечение юрисдикции')
                end
            end
            if post == 31 then
                if frak == 'LSPD' then
                    sampSendChat('/d SFPD, пересекаю вашу юрисдикцию, погоня.')
                elseif frak == 'SFPD' then
                    sampSendChat('/d LSPD, пересекаю вашу юрисдикцию, погоня.')
                elseif frak == 'LVPD' then
                    submenus_show(yrisdkld1404, '{9966CC}FBI Tools{ffffff} | Пересечение юрисдикции')
                end
            end
        end)
    end
    if not isCharInAnyCar(PLAYER_PED) then
        if post ~= nil and post ~= 8 then
            local pn = {}
            for patrulid = 0, sampGetMaxPlayerId(true) do
                local result, ped = sampGetCharHandleBySampPlayerId(patrulid)
                if result then
                    local myPosX, myPosY, myPosZ = getCharCoordinates(PLAYER_PED)
                    local posX, posY, posZ = getCharCoordinates(ped)
                    local distance = getDistanceBetweenCoords3d(myPosX, myPosY, myPosZ, posX, posY, posZ)
                    if distance <= 20.0 then
                        local nskin = getCharModel(ped)
                        if getFraktionBySkin(patrulid) == 'FBI' or getFraktionBySkin(patrulid) == 'Полиция' then
                            local doknick, dockfam = sampGetPlayerNickname(patrulid):match('(.+)_(.+)')
                            if doknick and dockfam then
                                table.insert(pn, string.format('%s.%s', doknick:sub(1,1), dockfam))
                            end
                        end
                    end
                end
            end
            if not cfg.main.tarb then
                if #pn == 0 then
                    sampSendChat('/r Пост: '..getNameSphere(post)..'. Напарников нет.')
                elseif #pn == 1 then
                    sampSendChat('/r Пост: '..getNameSphere(post)..'. Напарник: '..table.concat(pn, ", ")..'.')
                elseif #pn > 1 then
                    sampSendChat('/r Пост: '..getNameSphere(post)..'. Напарники: '..table.concat(pn, ", ")..'.')
                end
            else
                if #pn == 0 then
                    sampSendChat('/r ['..cfg.main.tar..']: Пост: '..getNameSphere(post)..'. Напарников нет.')
                elseif #pn == 1 then
                    sampSendChat('/r ['..cfg.main.tar..']: Пост: '..getNameSphere(post)..'. Напарник: '..table.concat(pn, ", ")..'.')
                elseif #pn > 1 then
                    sampSendChat('/r ['..cfg.main.tar..']: Пост: '..getNameSphere(post)..'. Напарники: '..table.concat(pn, ", ")..'.')
                end
            end
        end
        if post == 8 then
            local pn = {}
            for patrulid = 0, sampGetMaxPlayerId(true) do
                local result, ped = sampGetCharHandleBySampPlayerId(patrulid)
                if result then
                    local myPosX, myPosY, myPosZ = getCharCoordinates(PLAYER_PED)
                    local posX, posY, posZ = getCharCoordinates(ped)
                    local distance = getDistanceBetweenCoords3d(myPosX, myPosY, myPosZ, posX, posY, posZ)
                    if distance <= 50.0 then
                        local nskin = getCharModel(ped)
                        if getFraktionBySkin(patrulid) == 'FBI' or getFraktionBySkin(patrulid) == 'Полиция' then
                            local doknick, dockfam = sampGetPlayerNickname(patrulid):match('(.+)_(.+)')
                            if doknick and dockfam then
                                table.insert(pn, string.format('%s.%s', doknick:sub(1,1), dockfam))
                            end
                        end
                    end
                end
            end
            if not cfg.main.tarb then
                if #pn == 0 then
                    sampSendChat('/r Пост: '..getNameSphere(post)..'. Напарников нет.')
                elseif #pn == 1 then
                    sampSendChat('/r Пост: '..getNameSphere(post)..'. Напарник: '..table.concat(pn, ", ")..'.')
                elseif #pn > 1 then
                    sampSendChat('/r Пост: '..getNameSphere(post)..'. Напарники: '..table.concat(pn, ", ")..'.')
                end
            else
                if #pn == 0 then
                    sampSendChat('/r ['..cfg.main.tar..']: Пост: '..getNameSphere(post)..'. Напарников нет.')
                elseif #pn == 1 then
                    sampSendChat('/r ['..cfg.main.tar..']: Пост: '..getNameSphere(post)..'. Напарник: '..table.concat(pn, ", ")..'.')
                elseif #pn > 1 then
                    sampSendChat('/r ['..cfg.main.tar..']: Пост: '..getNameSphere(post)..'. Напарники: '..table.concat(pn, ", ")..'.')
                end
            end
        end
    end
end

function kmdc(args)
    pID = tonumber(args)
    if cfg.main.male then
        if pID ~= nil then
            if sampIsPlayerConnected(pID) then
                lua_thread.create(function()
                    sampSendChat("/me достал КПК и сделал фотографию человека")
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/do КПК дал информацию: Имя: "..sampGetPlayerNickname(pID):gsub('_', ' ')..".")
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/mdc "..args)
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/time")
                    wait(500)
                    setVirtualKeyDown(key.VK_F8, true)
                    wait(150)
                    setVirtualKeyDown(key.VK_F8, false)
                end)
            else
                ftext("Игрок с ID: "..args.." не подключен к серверу", -1)
            end
       else
            ftext("Введите: /kmdc ID", -1)
       end
    else
        if pID ~= nil then
            if sampIsPlayerConnected(pID) then
                lua_thread.create(function()
                    sampSendChat("/me достала КПК и сделала фотографию человека")
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/do КПК дал информацию: Имя: "..sampGetPlayerNickname(pID):gsub('_', ' ')..".")
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/mdc "..args)
                    wait(cfg.commands.zaderjka)
                    sampSendChat("/time")
                    wait(500)
                    setVirtualKeyDown(key.VK_F8, true)
                    wait(150)
                    setVirtualKeyDown(key.VK_F8, false)
                end)
            else
                ftext("Игрок с ID: "..args.." не подключен к серверу", -1)
            end
        else
            ftext("Введите: /kmdc ID", -1)
        end
    end
end
function ftazer(id)
    if cfg.commands.ftazer then
        if cfg.main.male == true then
            if id == "" or id < "1" or id > "3" or id == nil then
                ftext("Введите: /ftazer [1-3]")
                ftext("1 - Всех | 2 - Гос.Сотрудников | 3 - Гражданских")
            elseif id == "1" then
                lua_thread.create(function()
                    sampSendChat("/me достал из внутреннего кармана беруши")
                    wait(1500)
                    sampSendChat("/me надел беруши и зажмурился")
                    wait(1500)
                    sampSendChat("/me бросил светошумовую гранату")
                    wait(1500)
                    sampSendChat("/ftazer 1", -1)
                end)
            elseif id == "2" then
                lua_thread.create(function()
                    sampSendChat("/me достал из внутреннего кармана беруши")
                    wait(1500)
                    sampSendChat("/me надел беруши и зажмурился")
                    wait(1500)
                    sampSendChat("/me бросил светошумовую гранату")
                    wait(1500)
                    sampSendChat("/ftazer 2", -1)
                end)
            elseif id == "3" then
                lua_thread.create(function()
                    sampSendChat("/me достал из внутреннего кармана беруши")
                    wait(1500)
                    sampSendChat("/me надел беруши и зажмурился")
                    wait(1500)
                    sampSendChat("/me бросил светошумовую гранату")
                    wait(1500)
                    sampSendChat("/ftazer 3", -1)
                end)
            end
        end
        if cfg.main.male == false then
            if id == "" or id < "1" or id > "3" or id == nil then
                ftext("Введите: /ftzer [1-3]")
                ftext("1 - Всех | 2 - Гос.Сотрудников | 3 - Гражданских")
            elseif id == "1" then
                lua_thread.create(function()
                    sampSendChat("/me достала из внутреннего кармана беруши")
                    wait(1500)
                    sampSendChat("/me надела беруши и зажмурилась")
                    wait(1500)
                    sampSendChat("/me бросила светошумовую гранату")
                    wait(1500)
                    sampSendChat("/ftazer 1", -1)
                end)
            elseif id == "2" then
                lua_thread.create(function()
                    sampSendChat("/me достала из внутреннего кармана беруши")
                    wait(1500)
                    sampSendChat("/me надела беруши и зажмурилась")
                    wait(1500)
                    sampSendChat("/me бросила светошумовую гранату")
                    wait(1500)
                    sampSendChat("/ftazer 2", -1)
                end)
            elseif id == "3" then
                lua_thread.create(function()
                    sampSendChat("/me достала из внутреннего кармана беруши")
                    wait(1500)
                    sampSendChat("/me надела беруши и зажмурилась")
                    wait(1500)
                    sampSendChat("/me бросила светошумовую гранату")
                    wait(1500)
                    sampSendChat("/ftazer 3", -1)
                end)
            end
        end
    else
        local ftazerid = tonumber(id)
        if ftazerid ~= nil then
            sampSendChat('/ftazer '..ftazerid)
        else
            ftext("Введите: /ftzer [1-3]")
            ftext("1 - Всех | 2 - Гос.Сотрудников | 3 - Гражданских")
        end
    end
end
function fvz(pam)
    local id = tonumber(pam)
    local _, myid = sampGetPlayerIdByCharHandle(playerPed)
    if frak == 'FBI' then
        if id == nil then
            ftext("Введите: /fvz [id]")
        end
        if id ~= nil and sampIsPlayerConnected(id) then
            lua_thread.create(function()
                warnst = true
                sampSendChat('/mdc '..id)
                wait(cfg.commands.zaderjka)
                if wfrac == 'LSPD' or wfrac == 'SFPD' or wfrac == 'LVPD' or wfrac == 'LVa' or wfrac == 'SFa' then
                    sampSendChat(string.format('/d %s, %s, явитесь в офис ФБР со старшими. Как приняли? Ответ на пдж.%s', wfrac, sampGetPlayerNickname(id):gsub('_', ' '), myid))
                else
                    ftext('Человек не является сотрудником PD/Army')
                end
                warnst = false
                wfrac = nil
            end)
        end
    else
        ftext("Вы не сотрудник ФБР")
    end
end
function fbd(pam)
    local id = tonumber(pam)
    if frak == 'FBI' then
        if id == nil then
            ftext("Введите: /fbd [id]")
        end
        if id ~= nil and sampIsPlayerConnected(id) then
            lua_thread.create(function()
                local _, myid = sampGetPlayerIdByCharHandle(playerPed)
                warnst = true
                sampSendChat('/mdc '..id)
                wait(cfg.commands.zaderjka)
                if wfrac == 'LSPD' or wfrac == 'SFPD' or wfrac == 'LVPD' then
                    sampSendChat(string.format('/d %s, %s, Причина изменения БД на п.%s', wfrac, sampGetPlayerNickname(id):gsub('_', ' '), myid))
                else
                    ftext('Человек не является сотрудником PD')
                end
                warnst = false
                wfrac = nil
            end)
        end
    else
        ftext("Вы не сотрудник ФБР")
    end
end
function cc()
    local memory = require "memory"
    memory.fill(sampGetChatInfoPtr() + 306, 0x0, 25200)
    memory.write(sampGetChatInfoPtr() + 306, 25562, 4, 0x0)
    memory.write(sampGetChatInfoPtr() + 0x63DA, 1, 1)
end
function blg(pam)
    local id, frack, pric = pam:match('(%d+) (%a+) (.+)')
    if id and frack and pric and sampIsPlayerConnected(id) then
        name = sampGetPlayerNickname(id)
        rpname = name:gsub('_', ' ')
        sampSendChat(string.format("/d %s, благодарю %s за %s. Цените", frack, rpname, pric))
    else
        ftext("Введите: /blg [id] [Фракция] [Причина]", -1)
    end
end
function df()
    lua_thread.create(function()
        submenus_show(dfmenu, "{9966cc}FBI Tools {ffffff}| Bomb Menu")
    end)
end
function mcheck()
    peds = getAllChars()
    if peds ~= nil then
        local openw = io.open("moonloader/fbitools/mcheck.txt", 'a')
        openw:write('\n')
        openw:write(os.date()..'\n')
        openw:close()
        lua_thread.create(function()
            for _, hm in pairs(peds) do
                _ , id = sampGetPlayerIdByCharHandle(hm)
                _ , m = sampGetPlayerIdByCharHandle(PLAYER_PED)
                if id ~= -1 and id ~= m and doesCharExist(hm) and sampIsPlayerConnected(id) then
                    local x, y, z = getCharCoordinates(hm)
                    local mx, my, mz = getCharCoordinates(PLAYER_PED)
                    local dist = getDistanceBetweenCoords3d(mx, my, mz, x, y, z)
                    if dist <= 200 then
                        mcheckb = true
                        _ , idofplayercar = sampGetPlayerIdByCharHandle(hm)
                        sampSendChat('/mdc '..idofplayercar)
                        wait(cfg.commands.zaderjka)
                        mcheckb = false
                    end
                end
            end
        end)
    end
end