{
    "global":{
        "latest":4.21,
        "updateurl":"https://raw.githubusercontent.com/tlwsn/kirya/master/fbitools.luac",
        "updlist": "4.21: — Немного изменен принцип /fmask, работает быстрее и лучше\n— АвтоБП теперь работает в ФБР\n— Окно шпор теперь закрывается на ESC\n— В командах /ticket /cput /ceject /deject добавлена проверка на нахождение игрока в зоне прорисовки\n\n4.2: — /fmask. Автоматически выбирает первую маску в инвентаре и надевает ее ( Если у вас скин свата, то сразу наденет маску )\n— Немного переделан принцип сохранения конфигов, возможно полностью пропадут слеты конфига\n— В инфобар добавлено отображение стороны, в которую направлен персонаж\n— Ключ {location} в биндер, который возвращает район, в котором вы находитесь\n— Ключ {direction} в биндер, который возвращает направление вашего персонажа\n\n4.16: — Фикс голоса из-под маски после смерти\n— Команда /mo для оповещения в департамент об ограбленном МО\n— Команда /shp для открытия окна шпор\n— В мегафон добавлено оповещение, если игрок мог не увидеть просьбу остановки\n— Фикс вылета скрипта при использовании /mcheck\n\n4.15: — Фикс голоса из-под маски\n\n4.14: — Добавил функцию автоматического добавления [Голос из-под маски], если надета маска\n— Добавил отображение игроков, которые отключились в зоне стрима\n— Добавил новый стиль для скрипта\n\n4.13: — Фикс, когда не пропадала стрелка за преступником\n— Вернул /z\n\n4.12: — Фикс вылета скрипта из-за включенного автобп вне ПД\n— Реализовано автобп для армий\n\n4.11: — Фикс зависаний\n— Фикс вылета скрипта при открытии ключей\n\n4.1: — Была изменена система конфигов. Теперь в зависимости от ника и сервера, на котором вы играете будет подгружаться конфиг под ник и сервер.\n— Новая система шпор, теперь все шпоры собраны в одном окне, в котором можно переключаться между шпорами, искать нужный текст в них, редактировать их прямо в игре, кликом на строку выводить ее в окно ввода чата. ( Старые команды /yk /ak /fp /shp /fak /fyk /ffp /fshp удалены, вызвать окно можно из главного меню )\n— Починил /dmb, добавил отображение войс чата у игрока\n— Добавил возможность отключать квадратные скобки в тэге, добавил поддержку ключей.\n— Изменил систему /su, теперь диалог можно редактировать: добавлять, удалять или изменять статьи, разделы. Была убрана команда /z.\n— Добавил счетчик онлайна как в SFA-Helper\n— Изменил внешний вид инфобара, убрал из него отображение состояния тазера, добавил отображение ХП / Брони\n— Добавил выбор стилей для скрипта\n— Починил определение статистики и все баги связанные с ним.\n— Переделал логику /cput, теперь, если не вводить место, на которое должен сесть преступник скрипт корректно выбирает свободное место в авто.\n— При выключении скрипта вылазит окно с подтверждением, где будет написано, как включить скрипт заново, если такая возможность вообще имеется\n— Изменил логику скрывания начала патрулей и выдачи розыска:\n    – Сообщения от диспетчера о ограблении АММО / МО / Больницы будут отображаться в любом случае, как и выдача розыска от тех людей, которые сидят у вас в машине.\n    – При включенной функции скрытия сообщений о начале патруля вы все равно будете видеть, если кто-то из тех, кто сидит у вас в машине начнет патруль.\n— Убрал дополненный clear из-за ненадобности.\n— АвтоБП теперь исправно работает, правда работает оно только в ПД, в последующих обновлениях сделаю и под ФБР / Армии.\n— Добавил возможность отображать стрелку до преступника, которого словили по патрулю ( не является читом и обсужденно с главным следящим за госами 01 сервера )\n— Попробовал починить автозагрузку библиотек, вроде вышло. ( Тестировал на чистой ГТА без сторонних скриптов, все работает идеально )\n— Изменен внешний вид /rlog /smslog /dlog /sulog, добавлен /adlog ( логирование объявлений )"
    },
    "test":{
        "latest":1,
        "updateurl":"https://raw.githubusercontent.com/tlwsn/kirya/master/fbitoolstest.luac",
        "access":false
    }
}
